static cptr kaji_tips_sh[5] =
{
	"現在持っているエッセンスの一覧を表示する。",
	"アイテムからエッセンスを取り出す。エッセンスを取られたアイテムは消滅する。古道具屋は(武具・鉱石・一部の珍品)からエッセンスを抽出できる。",
	"既にエッセンスが付加されたアイテムからエッセンスのみ消し去る。エッセンスは手に入らない。",
	"アイテムにエッセンスを付加する。既にエッセンスが付加されたアイテムやアーティファクトには付加できない。古道具屋はすべての武具に対してエッセンスを付加できる。",
	"武器や防具を強化したり、攻撃で傷つかないようにしたりする。エッセンスが付加されたアイテムやアーティファクトに対しても使用できる。",
};
static cptr kaji_tips_jewel[5] =
{
	"現在持っているエッセンスの一覧を表示する。",
	"アイテムからエッセンスを取り出す。エッセンスを取られたアイテムは消滅する。宝飾師は(装飾品・ランタン類・宝石・鉱石・一部の珍品)からエッセンスを抽出できる。",
	"既にエッセンスが付加されたアイテムからエッセンスのみ消し去る。エッセンスは手に入らない。",
	"アイテムにエッセンスを付加する。既にエッセンスが付加されたアイテムやアーティファクトには付加できない。宝飾師は(近接武器・指輪・アミュレット・ランタン類・リボン・頭防具)に対してエッセンスを付加できる。",
	"武器や防具を強化したり、攻撃で傷つかないようにしたりする。エッセンスが付加されたアイテムやアーティファクトに対しても使用できる。",
};
