/* File: tables.c */

/*
 * Copyright (c) 1997 Ben Harrison, James E. Wilson, Robert A. Koeneke
 *
 * This software may be copied and distributed for educational, research,
 * and not for profit purposes provided that this copyright and statement
 * are included in all such copies.  Other copyrights may also apply.
 */

/* Purpose: Angband Tables */

#include "angband.h"




/*
 * Global array for looping through the "keypad directions"
 */
const s16b ddd[9] =
{ 2, 8, 6, 4, 3, 1, 9, 7, 5 };

/*
 * Global arrays for converting "keypad direction" into offsets
 */
/*:::キー入力の数字を座標移動に変換する表*/
const s16b ddx[10] =
{ 0, -1, 0, 1, -1, 0, 1, -1, 0, 1 };

const s16b ddy[10] =
{ 0, 1, 1, 1, 0, 0, 0, -1, -1, -1 };

/*
 * Global arrays for optimizing "ddx[ddd[i]]" and "ddy[ddd[i]]"
 */
const s16b ddx_ddd[9] =
{ 0, 0, 1, -1, 1, -1, 1, -1, 0 };

const s16b ddy_ddd[9] =
{ 1, -1, 0, 0, 1, 1, -1, -1, 0 };


/*
 * Circular keypad direction array
 */
const s16b cdd[8] =
{ 2, 3, 6, 9, 8, 7, 4, 1 };

/*
 * Global arrays for optimizing "ddx[cdd[i]]" and "ddy[cdd[i]]"
 */
const s16b ddx_cdd[8] =
{ 0, 1, 1, 1, 0, -1, -1, -1 };

const s16b ddy_cdd[8] =
{ 1, 1, 0, -1, -1, -1, 0, 1 };



/*
 * Global array for converting numbers to uppercase hecidecimal digit
 * This array can also be used to convert a number to an octal digit
 */
const char hexsym[16] =
{
	'0', '1', '2', '3', '4', '5', '6', '7',
	'8', '9', 'A', 'B', 'C', 'D', 'E', 'F'
};


/*
 * Global array for converting numbers to a logical list symbol
 */
///mod151213 花果子念報が入らなくなったのでちょっと増やした
const char listsym[] =
{
	'0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
	'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
	'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
	'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
	'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
	'!', '"','$','%','&','(',')','=','-',
	'\0'
};


/*
 * Encode the screen colors
 */
const cptr color_char = "dwsorgbuDWvyRGBU";


/*
 * Stat Table (INT/WIS) -- Number of half-spells per level
 */
const byte adj_mag_study[] =
{
	0	/* 3 */,
	0	/* 4 */,
	0	/* 5 */,
	0	/* 6 */,
	0	/* 7 */,
	1	/* 8 */,
	1	/* 9 */,
	1	/* 10 */,
	1	/* 11 */,
	2	/* 12 */,
	2	/* 13 */,
	2	/* 14 */,
	2	/* 15 */,
	2	/* 16 */,
	2	/* 17 */,
	2	/* 18/00-18/09 */,
	2	/* 18/10-18/19 */,
	2	/* 18/20-18/29 */,
	2	/* 18/30-18/39 */,
	2	/* 18/40-18/49 */,
	3	/* 18/50-18/59 */,
	3	/* 18/60-18/69 */,
	3	/* 18/70-18/79 */,
	3	/* 18/80-18/89 */,
	4	/* 18/90-18/99 */,
	4	/* 18/100-18/109 */,
	4	/* 18/110-18/119 */,
	5	/* 18/120-18/129 */,
	5	/* 18/130-18/139 */,
	5	/* 18/140-18/149 */,
	5	/* 18/150-18/159 */,
	5	/* 18/160-18/169 */,
	5	/* 18/170-18/179 */,
	5	/* 18/180-18/189 */,
	5	/* 18/190-18/199 */,
	5	/* 18/200-18/209 */,
	6	/* 18/210-18/219 */,
	6	/* 18/220+ */
	,6,6,6,6,6,6,6,6,6,6 ///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (INT/WIS) -- extra 1/4-mana-points per level
 */
const byte adj_mag_mana[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	1       /* 8 */,
	2       /* 9 */,
	3       /* 10 */,
	4       /* 11 */,
	5       /* 12 */,
	5       /* 13 */,
	6       /* 14 */,
	7       /* 15 */,
	8       /* 16 */,
	9       /* 17 */,
	10      /* 18/00-18/09 */,
	11      /* 18/10-18/19 */,
	11      /* 18/20-18/29 */,
	12      /* 18/30-18/39 */,
	12      /* 18/40-18/49 */,
	13      /* 18/50-18/59 */,
	14      /* 18/60-18/69 */,
	15      /* 18/70-18/79 */,
	16      /* 18/80-18/89 */,
	17      /* 18/90-18/99 */,
	18      /* 18/100-18/109 */,
	19      /* 18/110-18/119 */,
	20      /* 18/120-18/129 */,
	21      /* 18/130-18/139 */,
	22      /* 18/140-18/149 */,
	23      /* 18/150-18/159 */,
	24      /* 18/160-18/169 */,
	25      /* 18/170-18/179 */,
	26      /* 18/180-18/189 */,
	27      /* 18/190-18/199 */,
	28      /* 18/200-18/209 */,
	29      /* 18/210-18/219 */,
	30      /* 18/220+ */
	,31,32,33,34,35,36,37,38,39,40 ///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (INT/WIS) -- Minimum failure rate (percentage)
 */
/*:::レベル毎の魔法最低失敗率*/
const byte adj_mag_fail[] =
{
	99      /* 3 */,
	99      /* 4 */,
	99      /* 5 */,
	99      /* 6 */,
	99      /* 7 */,
	50      /* 8 */,
	30      /* 9 */,
	20      /* 10 */,
	15      /* 11 */,
	12      /* 12 */,
	11      /* 13 */,
	10      /* 14 */,
	9       /* 15 */,
	8       /* 16 */,
	7       /* 17 */,
	6       /* 18/00-18/09 */,
	6       /* 18/10-18/19 */,
	5       /* 18/20-18/29 */,
	5       /* 18/30-18/39 */,
	5       /* 18/40-18/49 */,
	4       /* 18/50-18/59 */,
	4       /* 18/60-18/69 */,
	4       /* 18/70-18/79 */,
	4       /* 18/80-18/89 */,
	3       /* 18/90-18/99 */,
	3       /* 18/100-18/109 */,
	2       /* 18/110-18/119 */,
	2       /* 18/120-18/129 */,
	2       /* 18/130-18/139 */,
	2       /* 18/140-18/149 */,
	1       /* 18/150-18/159 */,
	1       /* 18/160-18/169 */,
	1       /* 18/170-18/179 */,
	1       /* 18/180-18/189 */,
	1       /* 18/190-18/199 */,
	0       /* 18/200-18/209 */,
	0       /* 18/210-18/219 */,
	0       /* 18/220+ */
	,0,0,0,0,0,0,0,0,0,0///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (INT/WIS) -- Various things
 */
const byte adj_mag_stat[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	1       /* 8 */,
	1       /* 9 */,
	1       /* 10 */,
	1       /* 11 */,
	1       /* 12 */,
	1       /* 13 */,
	1       /* 14 */,
	2       /* 15 */,
	2       /* 16 */,
	2       /* 17 */,
	3       /* 18/00-18/09 */,
	3       /* 18/10-18/19 */,
	3       /* 18/20-18/29 */,
	3       /* 18/30-18/39 */,
	3       /* 18/40-18/49 */,
	4       /* 18/50-18/59 */,
	4       /* 18/60-18/69 */,
	5       /* 18/70-18/79 */,
	6       /* 18/80-18/89 */,
	7       /* 18/90-18/99 */,
	8       /* 18/100-18/109 */,
	9       /* 18/110-18/119 */,
	10      /* 18/120-18/129 */,
	11      /* 18/130-18/139 */,
	12      /* 18/140-18/149 */,
	13      /* 18/150-18/159 */,
	14      /* 18/160-18/169 */,
	15      /* 18/170-18/179 */,
	16      /* 18/180-18/189 */,
	17      /* 18/190-18/199 */,
	18      /* 18/200-18/209 */,
	19      /* 18/210-18/219 */,
	20      /* 18/220+ */
	,21,22,23,24,25,26,27,28,29,30///mod140104 パラメータ上限を変更
};


/*
 * Stat Table (CHR) -- payment percentages
 */
const byte adj_chr_gold[] =
{
	130     /* 3 */,
	125     /* 4 */,
	122     /* 5 */,
	120     /* 6 */,
	118     /* 7 */,
	116     /* 8 */,
	114     /* 9 */,
	112     /* 10 */,
	110     /* 11 */,
	108     /* 12 */,
	106     /* 13 */,
	104     /* 14 */,
	103     /* 15 */,
	102     /* 16 */,
	101     /* 17 */,
	100     /* 18/00-18/09 */,
	99      /* 18/10-18/19 */,
	98      /* 18/20-18/29 */,
	97      /* 18/30-18/39 */,
	96      /* 18/40-18/49 */,
	95      /* 18/50-18/59 */,
	94      /* 18/60-18/69 */,
	93      /* 18/70-18/79 */,
	92      /* 18/80-18/89 */,
	91      /* 18/90-18/99 */,
	90      /* 18/100-18/109 */,
	89      /* 18/110-18/119 */,
	88      /* 18/120-18/129 */,
	87      /* 18/130-18/139 */,
	86      /* 18/140-18/149 */,
	85      /* 18/150-18/159 */,
	84      /* 18/160-18/169 */,
	83      /* 18/170-18/179 */,
	82      /* 18/180-18/189 */,
	81      /* 18/190-18/199 */,
	80      /* 18/200-18/209 */,
	79      /* 18/210-18/219 */,
	78      /* 18/220+ */
	,77,76,75,74,73,72,71,70,69,68///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (INT) -- Magic devices
 */
const byte adj_int_dev[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	1       /* 8 */,
	1       /* 9 */,
	1       /* 10 */,
	1       /* 11 */,
	1       /* 12 */,
	1       /* 13 */,
	1       /* 14 */,
	2       /* 15 */,
	2       /* 16 */,
	2       /* 17 */,
	3       /* 18/00-18/09 */,
	3       /* 18/10-18/19 */,
	4       /* 18/20-18/29 */,
	4       /* 18/30-18/39 */,
	5       /* 18/40-18/49 */,
	5       /* 18/50-18/59 */,
	6       /* 18/60-18/69 */,
	6       /* 18/70-18/79 */,
	7       /* 18/80-18/89 */,
	7       /* 18/90-18/99 */,
	8       /* 18/100-18/109 */,
	9       /* 18/110-18/119 */,
	10      /* 18/120-18/129 */,
	11      /* 18/130-18/139 */,
	12      /* 18/140-18/149 */,
	13      /* 18/150-18/159 */,
	14      /* 18/160-18/169 */,
	15      /* 18/170-18/179 */,
	16      /* 18/180-18/189 */,
	17      /* 18/190-18/199 */,
	18      /* 18/200-18/209 */,
	19      /* 18/210-18/219 */,
	20      /* 18/220+ */
	,21,22,23,24,25,26,27,28,29,30///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (WIS) -- Saving throw
 */
const byte adj_wis_sav[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	1       /* 8 */,
	1       /* 9 */,
	1       /* 10 */,
	1       /* 11 */,
	1       /* 12 */,
	1       /* 13 */,
	1       /* 14 */,
	2       /* 15 */,
	2       /* 16 */,
	2       /* 17 */,
	3       /* 18/00-18/09 */,
	3       /* 18/10-18/19 */,
	3       /* 18/20-18/29 */,
	3       /* 18/30-18/39 */,
	3       /* 18/40-18/49 */,
	4       /* 18/50-18/59 */,
	4       /* 18/60-18/69 */,
	5       /* 18/70-18/79 */,
	5       /* 18/80-18/89 */,
	6       /* 18/90-18/99 */,
	7       /* 18/100-18/109 */,
	8       /* 18/110-18/119 */,
	9       /* 18/120-18/129 */,
	10      /* 18/130-18/139 */,
	11      /* 18/140-18/149 */,
	12      /* 18/150-18/159 */,
	13      /* 18/160-18/169 */,
	14      /* 18/170-18/179 */,
	15      /* 18/180-18/189 */,
	16      /* 18/190-18/199 */,
	17      /* 18/200-18/209 */,
	18      /* 18/210-18/219 */,
	19      /* 18/220+ */
	,20,22,24,26,28,30,32,34,37,40///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (DEX) -- disarming
 */
const byte adj_dex_dis[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	0       /* 8 */,
	0       /* 9 */,
	0       /* 10 */,
	0       /* 11 */,
	0       /* 12 */,
	1       /* 13 */,
	1       /* 14 */,
	1       /* 15 */,
	2       /* 16 */,
	2       /* 17 */,
	4       /* 18/00-18/09 */,
	4       /* 18/10-18/19 */,
	4       /* 18/20-18/29 */,
	4       /* 18/30-18/39 */,
	5       /* 18/40-18/49 */,
	5       /* 18/50-18/59 */,
	5       /* 18/60-18/69 */,
	6       /* 18/70-18/79 */,
	6       /* 18/80-18/89 */,
	7       /* 18/90-18/99 */,
	8       /* 18/100-18/109 */,
	8       /* 18/110-18/119 */,
	8       /* 18/120-18/129 */,
	8       /* 18/130-18/139 */,
	8       /* 18/140-18/149 */,
	9       /* 18/150-18/159 */,
	9       /* 18/160-18/169 */,
	9       /* 18/170-18/179 */,
	9       /* 18/180-18/189 */,
	9       /* 18/190-18/199 */,
	10      /* 18/200-18/209 */,
	10      /* 18/210-18/219 */,
	10      /* 18/220+ */
	,11,11,12,12,13,14,15,16,18,20///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (INT) -- disarming
 */
const byte adj_int_dis[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	1       /* 8 */,
	1       /* 9 */,
	1       /* 10 */,
	1       /* 11 */,
	1       /* 12 */,
	1       /* 13 */,
	1       /* 14 */,
	2       /* 15 */,
	2       /* 16 */,
	2       /* 17 */,
	3       /* 18/00-18/09 */,
	3       /* 18/10-18/19 */,
	3       /* 18/20-18/29 */,
	4       /* 18/30-18/39 */,
	4       /* 18/40-18/49 */,
	5       /* 18/50-18/59 */,
	6       /* 18/60-18/69 */,
	7       /* 18/70-18/79 */,
	8       /* 18/80-18/89 */,
	9       /* 18/90-18/99 */,
	10      /* 18/100-18/109 */,
	10      /* 18/110-18/119 */,
	11      /* 18/120-18/129 */,
	12      /* 18/130-18/139 */,
	13      /* 18/140-18/149 */,
	14      /* 18/150-18/159 */,
	15      /* 18/160-18/169 */,
	16      /* 18/170-18/179 */,
	17      /* 18/180-18/189 */,
	18      /* 18/190-18/199 */,
	19      /* 18/200-18/209 */,
	19      /* 18/210-18/219 */,
	20      /* 18/220+ */
	,21,22,23,24,25,27,29,31,33,35///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (DEX) -- bonus to ac (plus 128)
 */
const byte adj_dex_ta[] =
{
	128 + -4    /*  3 */,
	128 + -3    /*  4 */,
	128 + -2    /*  5 */,
	128 + -1    /*  6 */,
	128 + 0     /*  7 */,
	128 + 0     /*  8 */,
	128 + 0     /*  9 */,
	128 + 0     /* 10 */,
	128 + 0     /* 11 */,
	128 + 0     /* 12 */,
	128 + 0     /* 13 */,
	128 + 0     /* 14 */,
	128 + 1     /* 15 */,
	128 + 1     /* 16 */,
	128 + 1     /* 17 */,
	128 + 2     /* 18/00-18/09 */,
	128 + 2     /* 18/10-18/19 */,
	128 + 2     /* 18/20-18/29 */,
	128 + 2     /* 18/30-18/39 */,
	128 + 2     /* 18/40-18/49 */,
	128 + 3     /* 18/50-18/59 */,
	128 + 3     /* 18/60-18/69 */,
	128 + 3     /* 18/70-18/79 */,
	128 + 4     /* 18/80-18/89 */,
	128 + 5     /* 18/90-18/99 */,
	128 + 6     /* 18/100-18/109 */,
	128 + 7     /* 18/110-18/119 */,
	128 + 8     /* 18/120-18/129 */,
	128 + 9     /* 18/130-18/139 */,
	128 + 9     /* 18/140-18/149 */,
	128 + 10    /* 18/150-18/159 */,
	128 + 11    /* 18/160-18/169 */,
	128 + 12    /* 18/170-18/179 */,
	128 + 13    /* 18/180-18/189 */,
	128 + 14    /* 18/190-18/199 */,
	128 + 15    /* 18/200-18/209 */,
	128 + 15    /* 18/210-18/219 */,
	128 + 16    /* 18/220+ */
	,128 + 17,128 + 18,128 + 20,128 + 22,128 + 24,128 + 27,128 + 30,128 + 33,128 + 36,128 + 40
	///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (STR) -- bonus to dam (plus 128)
 */
const byte adj_str_td[] =
{
	128 + -2    /*  3 */,
	128 + -2    /*  4 */,
	128 + -1    /*  5 */,
	128 + -1    /*  6 */,
	128 + 0     /*  7 */,
	128 + 0     /*  8 */,
	128 + 0     /*  9 */,
	128 + 0     /* 10 */,
	128 + 0     /* 11 */,
	128 + 0     /* 12 */,
	128 + 0     /* 13 */,
	128 + 0     /* 14 */,
	128 + 0     /* 15 */,
	128 + 1     /* 16 */,
	128 + 2     /* 17 */,
	128 + 2     /* 18/00-18/09 */,
	128 + 2     /* 18/10-18/19 */,
	128 + 3     /* 18/20-18/29 */,
	128 + 3     /* 18/30-18/39 */,
	128 + 3     /* 18/40-18/49 */,
	128 + 3     /* 18/50-18/59 */,
	128 + 3     /* 18/60-18/69 */,
	128 + 4     /* 18/70-18/79 */,
	128 + 5     /* 18/80-18/89 */,
	128 + 5     /* 18/90-18/99 */,
	128 + 6     /* 18/100-18/109 */,
	128 + 7     /* 18/110-18/119 */,
	128 + 8     /* 18/120-18/129 */,
	128 + 9     /* 18/130-18/139 */,
	128 + 10    /* 18/140-18/149 */,
	128 + 11    /* 18/150-18/159 */,
	128 + 12    /* 18/160-18/169 */,
	128 + 13    /* 18/170-18/179 */,
	128 + 14    /* 18/180-18/189 */,
	128 + 15    /* 18/190-18/199 */,
	128 + 16    /* 18/200-18/209 */,
	128 + 18    /* 18/210-18/219 */,
	128 + 20    /* 18/220+ */
	,128 + 22,128 + 24,128 + 26,128 + 28,128 + 30,128 + 32,128 + 34,128 + 36,128 + 38,128 + 40
	///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (DEX) -- bonus to hit (plus 128)
 */
const byte adj_dex_th[] =
{
	128 + -3        /* 3 */,
	128 + -2        /* 4 */,
	128 + -2        /* 5 */,
	128 + -1        /* 6 */,
	128 + -1        /* 7 */,
	128 + 0 /* 8 */,
	128 + 0 /* 9 */,
	128 + 0 /* 10 */,
	128 + 0 /* 11 */,
	128 + 0 /* 12 */,
	128 + 0 /* 13 */,
	128 + 0 /* 14 */,
	128 + 0 /* 15 */,
	128 + 1 /* 16 */,
	128 + 2 /* 17 */,
	128 + 3 /* 18/00-18/09 */,
	128 + 3 /* 18/10-18/19 */,
	128 + 3 /* 18/20-18/29 */,
	128 + 3 /* 18/30-18/39 */,
	128 + 3 /* 18/40-18/49 */,
	128 + 4 /* 18/50-18/59 */,
	128 + 4 /* 18/60-18/69 */,
	128 + 4 /* 18/70-18/79 */,
	128 + 4 /* 18/80-18/89 */,
	128 + 5 /* 18/90-18/99 */,
	128 + 6 /* 18/100-18/109 */,
	128 + 7 /* 18/110-18/119 */,
	128 + 8 /* 18/120-18/129 */,
	128 + 9 /* 18/130-18/139 */,
	128 + 9 /* 18/140-18/149 */,
	128 + 10        /* 18/150-18/159 */,
	128 + 11        /* 18/160-18/169 */,
	128 + 12        /* 18/170-18/179 */,
	128 + 13        /* 18/180-18/189 */,
	128 + 14        /* 18/190-18/199 */,
	128 + 15        /* 18/200-18/209 */,
	128 + 15        /* 18/210-18/219 */,
	128 + 16        /* 18/220+ */
	,128 + 17,128 + 18,128 + 20,128 + 22,128 + 24,128 + 27,128 + 30,128 + 33,128 + 36,128 + 40
	///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (STR) -- bonus to hit (plus 128)
 */
const byte adj_str_th[] =
{
	128 + -3        /* 3 */,
	128 + -2        /* 4 */,
	128 + -1        /* 5 */,
	128 + -1        /* 6 */,
	128 + 0 /* 7 */,
	128 + 0 /* 8 */,
	128 + 0 /* 9 */,
	128 + 0 /* 10 */,
	128 + 0 /* 11 */,
	128 + 0 /* 12 */,
	128 + 0 /* 13 */,
	128 + 0 /* 14 */,
	128 + 0 /* 15 */,
	128 + 0 /* 16 */,
	128 + 0 /* 17 */,
	128 + 1 /* 18/00-18/09 */,
	128 + 1 /* 18/10-18/19 */,
	128 + 1 /* 18/20-18/29 */,
	128 + 1 /* 18/30-18/39 */,
	128 + 1 /* 18/40-18/49 */,
	128 + 1 /* 18/50-18/59 */,
	128 + 1 /* 18/60-18/69 */,
	128 + 2 /* 18/70-18/79 */,
	128 + 3 /* 18/80-18/89 */,
	128 + 4 /* 18/90-18/99 */,
	128 + 5 /* 18/100-18/109 */,
	128 + 6 /* 18/110-18/119 */,
	128 + 7 /* 18/120-18/129 */,
	128 + 8 /* 18/130-18/139 */,
	128 + 9 /* 18/140-18/149 */,
	128 + 10        /* 18/150-18/159 */,
	128 + 11        /* 18/160-18/169 */,
	128 + 12        /* 18/170-18/179 */,
	128 + 13        /* 18/180-18/189 */,
	128 + 14        /* 18/190-18/199 */,
	128 + 15        /* 18/200-18/209 */,
	128 + 15        /* 18/210-18/219 */,
	128 + 16        /* 18/220+ */
	,128 + 17,128 + 18,128 + 20,128 + 22,128 + 24,128 + 27,128 + 30,128 + 33,128 + 36,128 + 40
	///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (STR) -- weight limit in deca-pounds
 */
const byte adj_str_wgt[] =
{
	10      /* 3 */,
	11      /* 4 */,
	12      /* 5 */,
	13      /* 6 */,
	14      /* 7 */,
	15      /* 8 */,
	16      /* 9 */,
	17      /* 10 */,
	18      /* 11 */,
	19      /* 12 */,
	20      /* 13 */,
	21      /* 14 */,
	22      /* 15 */,
	23      /* 16 */,
	24      /* 17 */,
	25      /* 18/00-18/09 */,
	26      /* 18/10-18/19 */,
	27      /* 18/20-18/29 */,
	28      /* 18/30-18/39 */,
	29      /* 18/40-18/49 */,
	30      /* 18/50-18/59 */,
	31      /* 18/60-18/69 */,
	31      /* 18/70-18/79 */,
	32      /* 18/80-18/89 */,
	32      /* 18/90-18/99 */,
	33      /* 18/100-18/109 */,
	33      /* 18/110-18/119 */,
	34      /* 18/120-18/129 */,
	34      /* 18/130-18/139 */,
	35      /* 18/140-18/149 */,
	35      /* 18/150-18/159 */,
	36      /* 18/160-18/169 */,
	36      /* 18/170-18/179 */,
	37      /* 18/180-18/189 */,
	37      /* 18/190-18/199 */,
	38      /* 18/200-18/209 */,
	38      /* 18/210-18/219 */,
	39      /* 18/220+ */
	,40,42,44,47,50,54,58,63,69,75///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (STR) -- weapon weight limit in pounds
 */
/*:::運搬にならない武器重量　両手なら倍　k_info[].weight/10に対応*/
///mod160503 ちょっと調整
const byte adj_str_hold[] =
{
	4       /* 3 */,
	5       /* 4 */,
	6       /* 5 */,
	7       /* 6 */,
	8       /* 7 */,
	9       /* 8 */,
	10      /* 9 */,
	11      /* 10 */,
	12      /* 11 */,
	13      /* 12 */,
	14      /* 13 */,
	15      /* 14 */,
	16      /* 15 */,
	17      /* 16 */,
	18      /* 17 */,
	19      /* 18/00-18/09 */,
	20      /* 18/10-18/19 */,
	21      /* 18/20-18/29 */,
	22      /* 18/30-18/39 */,
	23      /* 18/40-18/49 */,
	24      /* 18/50-18/59 */,
	25      /* 18/60-18/69 */,
	26      /* 18/70-18/79 */,
	27      /* 18/80-18/89 */,
	28      /* 18/90-18/99 */,
	30      /* 18/100-18/109 */,
	32      /* 18/110-18/119 */,
	34      /* 18/120-18/129 */,
	36      /* 18/130-18/139 */,
	38      /* 18/140-18/149 */,
	40      /* 18/150-18/159 */,
	43      /* 18/160-18/169 */,
	46      /* 18/170-18/179 */,
	49      /* 18/180-18/189 */,
	52      /* 18/190-18/199 */,
	55     /* 18/200-18/209 */,
	60     /* 18/210-18/219 */,
	65     /* 18/220+ */
	,70,75,80,85,90,96,102,108,114,120///mod140325 全体的にやや見直し 高腕力で狂戦士化したとき斬魔刀(wgt2000)を両手で振れるように設定する
};

/*
 * Stat Table (STR) -- digging value
 */
const byte adj_str_dig[] =
{
	0       /* 3 */,
	0       /* 4 */,
	1       /* 5 */,
	2       /* 6 */,
	3       /* 7 */,
	4       /* 8 */,
	4       /* 9 */,
	5       /* 10 */,
	5       /* 11 */,
	6       /* 12 */,
	6       /* 13 */,
	7       /* 14 */,
	7       /* 15 */,
	8       /* 16 */,
	8       /* 17 */,
	9       /* 18/00-18/09 */,
	10      /* 18/10-18/19 */,
	12      /* 18/20-18/29 */,
	15      /* 18/30-18/39 */,
	20      /* 18/40-18/49 */,
	25      /* 18/50-18/59 */,
	30      /* 18/60-18/69 */,
	35      /* 18/70-18/79 */,
	40      /* 18/80-18/89 */,
	45      /* 18/90-18/99 */,
	50      /* 18/100-18/109 */,
	55      /* 18/110-18/119 */,
	60      /* 18/120-18/129 */,
	65      /* 18/130-18/139 */,
	70      /* 18/140-18/149 */,
	75      /* 18/150-18/159 */,
	80      /* 18/160-18/169 */,
	85      /* 18/170-18/179 */,
	90      /* 18/180-18/189 */,
	95      /* 18/190-18/199 */,
	100     /* 18/200-18/209 */,
	100     /* 18/210-18/219 */,
	100     /* 18/220+ */
	,105,110,115,120,125,130,135,140,145,150///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (STR) -- help index into the "blow" table
 */
///mod140907 255を超えたのでbyteでなくs16bにした
const s16b adj_str_blow[] =
{
	3       /* 3 */,
	4       /* 4 */,
	5       /* 5 */,
	6       /* 6 */,
	7       /* 7 */,
	8       /* 8 */,
	9       /* 9 */,
	10      /* 10 */,
	11      /* 11 */,
	12      /* 12 */,
	13      /* 13 */,
	14      /* 14 */,
	15      /* 15 */,
	16      /* 16 */,
	17      /* 17 */,
	20 /* 18/00-18/09 */,
	30 /* 18/10-18/19 */,
	40 /* 18/20-18/29 */,
	50 /* 18/30-18/39 */,
	60 /* 18/40-18/49 */,
	70 /* 18/50-18/59 */,
	80 /* 18/60-18/69 */,
	90 /* 18/70-18/79 */,
	100 /* 18/80-18/89 */,
	110 /* 18/90-18/99 */,
	120 /* 18/100-18/109 */,
	130 /* 18/110-18/119 */,
	140 /* 18/120-18/129 */,
	150 /* 18/130-18/139 */,
	160 /* 18/140-18/149 */,
	170 /* 18/150-18/159 */,
	180 /* 18/160-18/169 */,
	190 /* 18/170-18/179 */,
	200 /* 18/180-18/189 */,
	210 /* 18/190-18/199 */,
	220 /* 18/200-18/209 */,
	230 /* 18/210-18/219 */,
	240 /* 18/220+ */
	,250,260,270,280,300,320,340,360,380,400//mod140325 パラメータ上限を変更 byte型なのでこれ以上増やせない
};


/*
 * Stat Table (DEX) -- index into the "blow" table
 */
const byte adj_dex_blow[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	0       /* 8 */,
	0       /* 9 */,
	1       /* 10 */,
	1       /* 11 */,
	1       /* 12 */,
	1       /* 13 */,
	1       /* 14 */,
	2       /* 15 */,
	2       /* 16 */,
	2       /* 17 */,
	2       /* 18/00-18/09 */,
	3       /* 18/10-18/19 */,
	3       /* 18/20-18/29 */,
	3       /* 18/30-18/39 */,
	4       /* 18/40-18/49 */,
	4       /* 18/50-18/59 */,
	5       /* 18/60-18/69 */,
	5       /* 18/70-18/79 */,
	6       /* 18/80-18/89 */,
	6       /* 18/90-18/99 */,
	7       /* 18/100-18/109 */,
	7       /* 18/110-18/119 */,
	8       /* 18/120-18/129 */,
	8       /* 18/130-18/139 */,
	9      /* 18/140-18/149 */,
	9      /* 18/150-18/159 */,
	10      /* 18/160-18/169 */,
	10      /* 18/170-18/179 */,
	11      /* 18/180-18/189 */,
	11      /* 18/190-18/199 */,
	12      /* 18/200-18/209 */,
	12      /* 18/210-18/219 */,
	13      /* 18/220+ */
	,13,13,13,13,13,13,13,13,13,13///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (DEX) -- chance of avoiding "theft" and "falling"
 */
const byte adj_dex_safe[] =
{
	0       /* 3 */,
	1       /* 4 */,
	2       /* 5 */,
	3       /* 6 */,
	4       /* 7 */,
	5       /* 8 */,
	5       /* 9 */,
	6       /* 10 */,
	6       /* 11 */,
	7       /* 12 */,
	7       /* 13 */,
	8       /* 14 */,
	8       /* 15 */,
	9       /* 16 */,
	9       /* 17 */,
	10      /* 18/00-18/09 */,
	10      /* 18/10-18/19 */,
	15      /* 18/20-18/29 */,
	15      /* 18/30-18/39 */,
	20      /* 18/40-18/49 */,
	25      /* 18/50-18/59 */,
	30      /* 18/60-18/69 */,
	35      /* 18/70-18/79 */,
	40      /* 18/80-18/89 */,
	45      /* 18/90-18/99 */,
	50      /* 18/100-18/109 */,
	60      /* 18/110-18/119 */,
	70      /* 18/120-18/129 */,
	80      /* 18/130-18/139 */,
	90      /* 18/140-18/149 */,
	100     /* 18/150-18/159 */,
	100     /* 18/160-18/169 */,
	100     /* 18/170-18/179 */,
	100     /* 18/180-18/189 */,
	100     /* 18/190-18/199 */,
	100     /* 18/200-18/209 */,
	100     /* 18/210-18/219 */,
	100     /* 18/220+ */
	,100,100,100,100,100,100,100,100,100,100///mod140104 パラメータ上限と表記を変更
};


/*
 * Stat Table (CON) -- base regeneration rate
 */
const byte adj_con_fix[] =
{
	0       /* 3 */,
	0       /* 4 */,
	0       /* 5 */,
	0       /* 6 */,
	0       /* 7 */,
	0       /* 8 */,
	0       /* 9 */,
	0       /* 10 */,
	0       /* 11 */,
	0       /* 12 */,
	0       /* 13 */,
	1       /* 14 */,
	1       /* 15 */,
	1       /* 16 */,
	1       /* 17 */,
	2       /* 18/00-18/09 */,
	2       /* 18/10-18/19 */,
	2       /* 18/20-18/29 */,
	2       /* 18/30-18/39 */,
	2       /* 18/40-18/49 */,
	3       /* 18/50-18/59 */,
	3       /* 18/60-18/69 */,
	3       /* 18/70-18/79 */,
	3       /* 18/80-18/89 */,
	3       /* 18/90-18/99 */,
	4       /* 18/100-18/109 */,
	4       /* 18/110-18/119 */,
	5       /* 18/120-18/129 */,
	6       /* 18/130-18/139 */,
	6       /* 18/140-18/149 */,
	7       /* 18/150-18/159 */,
	7       /* 18/160-18/169 */,
	8       /* 18/170-18/179 */,
	8       /* 18/180-18/189 */,
	8       /* 18/190-18/199 */,
	9       /* 18/200-18/209 */,
	9       /* 18/210-18/219 */,
	9       /* 18/220+ */
	,10,10,10,11,11,12,12,13,14,15///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (CON) -- extra 1/4-hitpoints per level (plus 128)
 */
const byte adj_con_mhp[] =
{
	128 + -8        /* 3 */,
	128 + -6        /* 4 */,
	128 + -4        /* 5 */,
	128 + -2        /* 6 */,
	128 + -1 /* 7 */,
	128 + 0 /* 8 */,
	128 + 0 /* 9 */,
	128 + 0 /* 10 */,
	128 + 0 /* 11 */,
	128 + 0 /* 12 */,
	128 + 0 /* 13 */,
	128 + 1 /* 14 */,
	128 + 1 /* 15 */,
	128 + 2 /* 16 */,
	128 + 3 /* 17 */,
	128 + 4 /* 18/00-18/09 */,
	128 + 5 /* 18/10-18/19 */,
	128 + 6 /* 18/20-18/29 */,
	128 + 7 /* 18/30-18/39 */,
	128 + 8 /* 18/40-18/49 */,
	128 + 9 /* 18/50-18/59 */,
	128 + 10  /* 18/60-18/69 */,
	128 + 11 /* 18/70-18/79 */,
	128 + 12 /* 18/80-18/89 */,
	128 + 14 /* 18/90-18/99 */,
	128 + 17         /* 18/100-18/109 */,
	128 + 20        /* 18/110-18/119 */,
	128 + 23        /* 18/120-18/129 */,
	128 + 26        /* 18/130-18/139 */,
	128 + 29        /* 18/140-18/149 */,
	128 + 32        /* 18/150-18/159 */,
	128 + 35        /* 18/160-18/169 */,
	128 + 38        /* 18/170-18/179 */,
	128 + 40        /* 18/180-18/189 */,
	128 + 42        /* 18/190-18/199 */,
	128 + 44        /* 18/200-18/209 */,
	128 + 46        /* 18/210-18/219 */,
	128 + 48        /* 18/220+ */
	,128+51,128+54,128+58,128+62,128+67,128+72,128+78,128+84,128+90,128+96///mod140325 パラメータ上限を変更
};


/*
 * Stat Table (CHR) -- charm
 */
const byte adj_chr_chm[] =
{
	0       /* 3 */,
	0       /* 4 */,
	1       /* 5 */,
	2       /* 6 */,
	3       /* 7 */,
	4       /* 8 */,
	4       /* 9 */,
	5       /* 10 */,
	5       /* 11 */,
	6       /* 12 */,
	6       /* 13 */,
	7       /* 14 */,
	7       /* 15 */,
	8       /* 16 */,
	8       /* 17 */,
	9       /* 18/00-18/09 */,
	10      /* 18/10-18/19 */,
	12      /* 18/20-18/29 */,
	15      /* 18/30-18/39 */,
	18      /* 18/40-18/49 */,
	21      /* 18/50-18/59 */,
	24      /* 18/60-18/69 */,
	28      /* 18/70-18/79 */,
	32      /* 18/80-18/89 */,
	36      /* 18/90-18/99 */,
	39      /* 18/100-18/109 */,
	42      /* 18/110-18/119 */,
	45      /* 18/120-18/129 */,
	49      /* 18/130-18/139 */,
	53      /* 18/140-18/149 */,
	57      /* 18/150-18/159 */,
	61      /* 18/160-18/169 */,
	65      /* 18/170-18/179 */,
	69      /* 18/180-18/189 */,
	73      /* 18/190-18/199 */,
	77      /* 18/200-18/209 */,
	81      /* 18/210-18/219 */,
	85      /* 18/220+ */
	,90,95,101,107,113,120,127,134,142,150///mod140325 パラメータ上限を変更
};


/*
 * This table is used to help calculate the number of blows the player can
 * make in a single round of attacks (one player turn) with a normal weapon.
 *
 * This number ranges from a single blow/round for weak players to up to six
 * blows/round for powerful warriors.
 *
 * Note that certain artifacts and ego-items give "bonus" blows/round.
 *
 * First, from the player class, we extract some values:
 *
 * Warrior       num = 6; mul = 5; div = MAX(70, weapon_weight);
 * Berserker     num = 6; mul = 7; div = MAX(70, weapon_weight);
 * Mage          num = 3; mul = 2; div = MAX(100, weapon_weight);
 * Priest        num = 5; mul = 3; div = MAX(100, weapon_weight);
 * Mindcrafter   num = 5; mul = 3; div = MAX(100, weapon_weight);
 * Rogue         num = 5; mul = 3; div = MAX(40, weapon_weight);
 * Ranger        num = 5; mul = 4; div = MAX(70, weapon_weight);
 * Paladin       num = 5; mul = 4; div = MAX(70, weapon_weight);
 * Weaponsmith   num = 5; mul = 5; div = MAX(150, weapon_weight);
 * Warrior-Mage  num = 5; mul = 3; div = MAX(70, weapon_weight);
 * Chaos Warrior num = 5; mul = 4; div = MAX(70, weapon_weight);
 * Monk          num = 5; mul = 3; div = MAX(60, weapon_weight);
 * Tourist       num = 4; mul = 3; div = MAX(100, weapon_weight);
 * Imitator      num = 5; mul = 4; div = MAX(70, weapon_weight);
 * Beastmaster   num = 5; mul = 3; div = MAX(70, weapon_weight);
 * Cavalry(Ride) num = 5; mul = 4; div = MAX(70, weapon_weight);
 * Cavalry(Walk) num = 5; mul = 3; div = MAX(100, weapon_weight);
 * Sorcerer      num = 1; mul = 1; div = MAX(1, weapon_weight);
 * Archer        num = 4; mul = 2; div = MAX(70, weapon_weight);
 * Magic eater   num = 4; mul = 2; div = MAX(70, weapon_weight);
 * ForceTrainer  num = 4; mul = 2; div = MAX(60, weapon_weight);
 * Mirror Master num = 3; mul = 3; div = MAX(100, weapon_weight);
 * Ninja         num = 4; mul = 1; div = MAX(20, weapon_weight);
 *
 * To get "P", we look up the relevant "adj_str_blow[]" (see above),
 * multiply it by "mul", and then divide it by "div".
 * Increase P by 1 if you wield a weapon two-handed.
 * Decrease P by 1 if you are a Ninja.
 *
 * To get "D", we look up the relevant "adj_dex_blow[]" (see above),
 *
 * The player gets "blows_table[P][D]" blows/round, as shown below,
 * up to a maximum of "num" blows/round, plus any "bonus" blows/round.
 */
///mod40315 最大攻撃回数を6→7へ
const byte blows_table[12][12] =
{
	/* P/D */
	/*      0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11+ */
	/*      3   10   15  /10  /40  /60  /80 /100 /120 /140 /160 /180  */
/* 0 */{	1,   1,   1,   1,   1,   2,   2,   2,   2,   3,   3,   4 },
/* 1 */{	1,   1,   1,   2,   2,   2,   3,   3,   3,   4,   4,   4 },
/* 2 */{	1,   1,   2,   2,   3,   3,   4,   4,   4,   5,   5,   5 },
/* 3 */{	1,   1,   2,   3,   3,   4,   4,   4,   5,   5,   5,   5 },
/* 4 */{	1,   1,   2,   3,   3,   4,   4,   5,   5,   5,   5,   5 },
/* 5 */{	1,   1,   2,   3,   4,   4,   4,   5,   5,   5,   5,   6 },
/* 6 */{	1,   1,   2,   3,   4,   4,   4,   5,   5,   5,   5,   6 },
/* 7 */{	1,   2,   2,   3,   4,   4,   4,   5,   5,   5,   5,   6 },
/* 8 */{	1,   2,   3,   3,   4,   4,   4,   5,   5,   5,   6,   6 },
/* 9 */{	1,   2,   3,   4,   4,   4,   5,   5,   5,   6,   6,   7 },
/* 10*/{	2,   2,   3,   4,   4,   4,   5,   5,   6,   6,   7,   7 },
/*11+*/{	2,   2,   3,   4,   4,   4,   5,   5,   6,   7,   7,   7 },

};

///item mon アリーナのモンスターと商品のTVAL,SVAL
const arena_type arena_info[MAX_ARENA_MONS + 2] =
{
	{ MON_IMP,       TV_AMULET, SV_AMULET_RESIST_ELEC           },
	{ MON_IMP,    TV_FOOD,   SV_FOOD_SLIMEMOLD          },
	{ MON_IMP,           TV_POTION, SV_POTION_SPEED               },
	{ MON_NOV_PRIEST,    0,         0                             },
	{ MON_IMP,   TV_POTION, SV_POTION_CURING              },
	{ MON_SABRE_TIGER,   TV_WAND,   SV_WAND_STONE_TO_MUD          },
	{ MON_LIZARD_KING,   TV_WAND,   SV_WAND_TELEPORT_AWAY         },
	{ MON_WYVERN,        TV_POTION, SV_POTION_HEALING             },
	{ MON_ARCH_VILE,     TV_POTION, SV_POTION_RESISTANCE          },
	{ MON_ELF_LORD   ,   TV_POTION, SV_POTION_ENLIGHTENMENT       },
	{ MON_GHOUL_KING,    TV_MUSHROOM,   SV_MUSHROOM_RESTORING             },
	{ MON_COLBRAN,       TV_RING,   SV_RING_ELEC                  },
	{ MON_BICLOPS,       TV_WAND,   SV_WAND_ACID_BALL             },
	{ MON_M_MINDCRAFTER, TV_POTION, SV_POTION_SELF_KNOWLEDGE      },
	{ MON_GROO,          TV_SCROLL, SV_SCROLL_ACQUIREMENT         },
	{ MON_RAAL,          TV_SCROLL, SV_SCROLL_STAR_DESTRUCTION    },
	{ MON_DREADMASTER,   TV_WAND,   SV_WAND_DRAIN_LIFE            },
	{ MON_ULTRA_PALADIN, TV_STAFF,  SV_STAFF_DISPEL_EVIL          },
	{ MON_BARNEY,        TV_RING,   SV_RING_RES_CHAOS             },
	{ MON_TROLL_KING,    TV_SCROLL, SV_SCROLL_MASS_GENOCIDE       },
	{ MON_BARON_HELL,    TV_POTION, SV_POTION_AUGMENTATION        },
	{ MON_F_ANGEL,       TV_SCROLL, SV_SCROLL_RUNE_OF_PROTECTION  },
	{ MON_G_C_DRAKE,     TV_WAND,   SV_WAND_DRAGON_FIRE           },
	{ MON_IRON_LICH,     TV_STAFF,  SV_STAFF_DESTRUCTION          },
	{ MON_DROLEM,        TV_POTION, SV_POTION_STAR_HEALING        },
	{ MON_G_TITAN,       TV_WAND,   SV_WAND_GENOCIDE              },
	{ MON_G_BALROG,      TV_POTION, SV_POTION_EXPERIENCE          },
	{ MON_ELDER_VAMPIRE, TV_RING,   SV_RING_SUSTAIN               },
	{ MON_NIGHTWALKER,   TV_WAND,   SV_WAND_STRIKING              },
	{ MON_S_TYRANNO,     TV_SCROLL, SV_SCROLL_STAR_ACQUIREMENT    },
	{ MON_G_MASTER_MYS,  TV_ROD,    SV_ROD_IDENTIFY               },
	{ MON_LORD_CHAOS,    TV_POTION, SV_POTION_LIFE                },
	{ MON_SHADOWLORD,    TV_POTION, SV_POTION_STAR_ENLIGHTENMENT  },
	{ MON_ULT_BEHOLDER,  TV_AMULET, SV_AMULET_REFLECTION          },
	{ MON_JABBERWOCK,    TV_ROD,    SV_ROD_HEALING                },
	{ MON_LOCKE_CLONE,   TV_WAND,   SV_WAND_DISINTEGRATE          },
	{ MON_WYRM_SPACE,    TV_ROD,    SV_ROD_RESTORATION            },
	{ MON_SHAMBLER,      TV_SCROLL, SV_SCROLL_STAR_ACQUIREMENT    },
	{ MON_BLACK_REAVER,  TV_RING,   SV_RING_LORDLY                },
	{ MON_FENGHUANG,     TV_STAFF,  SV_STAFF_THE_MAGI             },
	{ MON_WYRM_POWER,    TV_SCROLL, SV_SCROLL_ARTIFACT            },
	{ 0,                 0,         0                             }, /* Victory prizing */
	{ MON_HAGURE,        TV_SCROLL, SV_SCROLL_ARTIFACT            },
};



///bldg131222 新店名一覧
const cptr new_store_name[TOWN_MAX][MAX_STORES] = {
	{"","","","","","","","","",""},//ダミー
#ifdef JP
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","故買屋","拠点","鈴奈庵","エントランス"},//人里
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","ガラクタ市","拠点","書店","エントランス"},//天狗の郷
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス"},//地下
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","図書館","エントランス"},
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス"},
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","骨董市","拠点","書店","エントランス"},//河童
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス"},
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","香霖堂","拠点","書店","エントランス"},//香霖堂
	{"屋台『河城雑貨』","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス"},//命蓮寺
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス"},
	{"地下雑貨店","地下防具店","地下武器店","地下薬店/酒屋","地下巻物店","地下魔法店","ブラックマーケット","拠点","地下書店","エントランス"},
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス"},
	{ "雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス" },
	{ "雑貨店","防具店","武器店","薬店/酒屋","巻物店","魔法店","泥棒市","拠点","書店","エントランス" },
#else
    {"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Pawn Shop","Exploration Base","Suzunaan","Entrance"},//人里
    {"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Junkyard","Exploration Base","Bookstore","Entrance"},//天狗の郷
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},//地下
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Library","Entrance"},
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Antique Market","Exploration Base","Bookstore","Entrance"},//河童
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Kourindo","Exploration Base","Bookstore","Entrance"},//香霖堂
	{"Kappa General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},//命蓮寺
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},
	{"Underground General Store","Underground Armoury","Underground Weapon Store","Underground Pharmacy/Liquor Store","Underground Scroll Store","Underground Magic Store","Black Market","Home","Underground Bookstore","Entrance"},
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance" },
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance" },
#endif

};

///bldg131222 新オーナー名一覧
const cptr new_store_owner_name[TOWN_MAX][MAX_STORES] = {
	{"","","","","","","","","",""},//ダミー
#ifdef JP
	{"雑貨店主","防具店主","里の鍛冶屋","杜氏さん","書家","魔法店","店主","拠点","本居　小鈴","エントランス"},//人里
	{"雑貨店","防具店","武器店","薬店/酒屋","天狗の書家","魔法店","店主","拠点","書店","エントランス"},//天狗の里
	{"雑貨店","防具店","武器店","薬店/酒屋","地底の書家","魔法店","泥棒市店主","拠点","書店","エントランス"},//旧地獄市街
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店主","魔法店","泥棒市","拠点","小悪魔","エントランス"},//紅魔館（書店のみ）
	{"雑貨店","防具店","武器店","薬店/酒屋","巻物店主","魔法店","泥棒市","拠点","書店","エントランス"},//神社（店なし）
	{"河童店主","河童の服屋","河童の金物屋","薬店/酒屋","河童の書家","魔法店","黒河童","拠点","書店","エントランス"},//河童のバザー
	{"雑貨店","防具店","武器店","薬店/酒屋","店","魔法店","泥棒市","拠点","書店","エントランス"},//永遠亭（店なし）
	{"雑貨店","防具店","武器店","薬店/酒屋","店","魔法店","森近　霖之助","拠点","書店","エントランス"},//香霖堂（BMのみ)
	{"雑貨店","防具店","武器店","薬店/酒屋","店","魔法店","泥棒市","拠点","書店","エントランス"},//命蓮寺(店なし)
	{"雑貨店","防具店","武器店","薬店/酒屋","店","魔法店","泥棒市","拠点","書店","エントランス"},//霧雨魔法店(店なし)
	{"ドワール","インドゥア","アコーラヒル","ホアルムラス","ウーヴァタ","アドナフェル","カムル","拠点","レン","エントランス"},//地下　廃洋館の街番号なので注意
	{"雑貨店","防具店","武器店","薬店/酒屋","店","魔法店","泥棒市","拠点","書店","エントランス"},//守矢神社(店なし)
	{ "雑貨店","防具店","武器店","薬店/酒屋","店","魔法店","泥棒市","拠点","書店","エントランス" },//彼岸(店なし)
	{ "雑貨店","防具店","武器店","薬店/酒屋","店","魔法店","泥棒市","拠点","書店","エントランス" },//偽天棚(店なし)
#else
    {"General Store Owner","Armoury Owner","Village Blacksmith","Mr Touji","Calligrapher","Magic Store","Shopkeeper","Exploration Base","Kosuzu Motoori","Entrance"},//人里
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Tengu Calligrapher","Magic Store","Shopkeeper","Exploration Base","Bookstore","Entrance"},//天狗の里
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Underground Calligrapher","Magic Store","Thieves Market Owner","Exploration Base","Bookstore","Entrance"},//旧地獄市街
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store Owner","Magic Store","Thieves Market","Exploration Base","Koakuma","Entrance"},//紅魔館（書店のみ）
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Scroll Store Owner","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},//神社（店なし）
	{"Kappa Shopkeeper","Kappa Clothing Store","Kappa Hardware Store","Pharmacy/Liquor Store","Kappa Calligrapher","Magic Store","Black Kappa","Exploration Base","Bookstore","Entrance"},//河童のバザー
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},//永遠亭（店なし）
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Store","Magic Store","Rinnosuke Morichika","Exploration Base","Bookstore","Entrance"},//香霖堂（BMのみ)
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},//命蓮寺(店なし)
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},//霧雨魔法店(店なし)
	{"Dwar","Indur","Akhorakhil","Hoarmurath","Uvatha","Adunaphel","Khamul","Exploration Base","Ren","Entrance"},//地下　廃洋館の街番号なので注意
	{"General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance"},//守矢神社(店なし)
	{ "General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","Store","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance" },//彼岸(店なし)
	{ "General Store","Armoury","Weapon Store","Pharmacy/Liquor Store","店","Magic Store","Thieves Market","Exploration Base","Bookstore","Entrance" },//偽天棚(店なし)
#endif

};
/*
 * Store owners (exactly four "possible" owners per store, chosen randomly)
 * { name, purse, max greed, min greed, haggle_per, tolerance, race, unused }
 *
 * Lifted extra shopkeepers from CthAngband (don't you just love open source
 * development? ;-)). Since this gave less than 32 unique names for some
 * shops, those have their first x names copied to reach 32.
 *
 * For the weapon and armour shops, several owners have a limit of 5k.
 *
 * I want to do 50k owners, but the purse is currently s16b. Perhaps
 * we should just store 1/10th of the purse?
 */

///del140105 ここにowner_type owners[][]があったが種族変更処理が面倒なので全部消した




/*
 * This table allows quick conversion from "speed" to "energy"
 * The basic function WAS ((S>=110) ? (S-110) : (100 / (120-S)))
 * Note that table access is *much* quicker than computation.
 *
 * Note that the table has been changed at high speeds.  From
 * "Slow (-40)" to "Fast (+30)" is pretty much unchanged, but
 * at speeds above "Fast (+30)", one approaches an asymptotic
 * effective limit of 50 energy per turn.  This means that it
 * is relatively easy to reach "Fast (+30)" and get about 40
 * energy per turn, but then speed becomes very "expensive",
 * and you must get all the way to "Fast (+50)" to reach the
 * point of getting 45 energy per turn.  After that point,
 * furthur increases in speed are more or less pointless,
 * except to balance out heavy inventory.
 *
 * Note that currently the fastest monster is "Fast (+30)".
 *
 * It should be possible to lower the energy threshhold from
 * 100 units to 50 units, though this may interact badly with
 * the (compiled out) small random energy boost code.  It may
 * also tend to cause more "clumping" at high speeds.
 */
const byte extract_energy[200] =
{
	/* Slow */     1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
	/* Slow */     1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
	/* Slow */     1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
	/* Slow */     1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
	/* Slow */     1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
	/* Slow */     1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
	/* S-50 */     1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
	/* S-40 */     2,  2,  2,  2,  2,  2,  2,  2,  2,  2,
	/* S-30 */     2,  2,  2,  2,  2,  2,  2,  3,  3,  3,
	/* S-20 */     3,  3,  3,  3,  3,  4,  4,  4,  4,  4,
	/* S-10 */     5,  5,  5,  5,  6,  6,  7,  7,  8,  9,
	/* Norm */    10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
	/* F+10 */    20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
	/* F+20 */    30, 31, 32, 33, 34, 35, 36, 36, 37, 37,
	/* F+30 */    38, 38, 39, 39, 40, 40, 40, 41, 41, 41,
	/* F+40 */    42, 42, 42, 43, 43, 43, 44, 44, 44, 44,
	/* F+50 */    45, 45, 45, 45, 45, 46, 46, 46, 46, 46,
	/* F+60 */    47, 47, 47, 47, 47, 48, 48, 48, 48, 48,
	/* F+70 */    49, 49, 49, 49, 49, 49, 49, 49, 49, 49,
	/* Fast */    49, 49, 49, 49, 49, 49, 49, 49, 49, 49,
};




/*
 * Base experience levels, may be adjusted up for race and/or class
 */
//v1.1.43 バランス調整のためにレベル20～40辺りを少なくした
#if 0
const s32b player_exp[PY_MAX_LEVEL] =
{
	10,
	25,
	45,
	70,
	100,
	140,
	200,
	280,
	380,/*10*/
	500,
	650,
	850,
	1100,
	1400,
	1800,
	2300,
	2900,
	3600,
	4400,/*20*/
	5400,
	6800,
	8400,
	10200,
	12500,
	17500,
	25000,
	35000L,
	50000L,
	75000L,/*30*/
	100000L,
	150000L,
	200000L,
	275000L,
	350000L,
	450000L,
	550000L,
	700000L,
	850000L,
	1000000L,/*40*/
	1250000L,
	1500000L,
	1800000L,
	2100000L,
	2400000L,
	2700000L,
	3000000L,
	3500000L,
	4000000L,
	4500000L,/*50*/
	5000000L
};
#endif

const s32b player_exp[PY_MAX_LEVEL] =
{
	10,
	25,
	45,
	70,
	100,
	140,
	200,
	280,
	380,/*10*/
	500,
	650,
	850,
	1100,
	1400,
	1800,
	2300,
	2900,
	3600,
	4400,/*20*/
	5400,
	6600,
	8000,
	9800,
	12000,
	15000,
	18500,
	23000L,
	29000L,
	38000L,/*30*/
	50000L,
	80000L,
	120000L,
	170000L,
	230000L,
	300000L,
	400000L,
	520000L,
	660000L,
	820000L,/*40*/
	1000000L,
	1200000L,
	1450000L,
	1750000L,
	2100000L,
	2500000L,
	3000000L,
	3500000L,
	4000000L,
	4500000L,/*50*/
	5000000L
};


const s32b player_exp_a[PY_MAX_LEVEL] =
{
	20,
	50,
	100,
	170,
	280,
	430,
	650,
	950,
	1400,/*10*/
	1850,
	2300,
	2900,
	3600,
	4400,
	5400,
	6800,
	8400,
	10400,
	12500,/*20*/
	17500,
	25000,
	35000,
	50000L,
	75000L,
	100000L,
	150000L,
	200000L,
	275000L,
	350000L,/*30*/
	450000L,
	550000L,
	650000L,
	800000L,
	950000L,
	1100000L,
	1250000L,
	1400000L,
	1550000L,
	1700000L,/*40*/
	1900000L,
	2100000L,
	2300000L,
	2550000L,
	2800000L,
	3050000L,
	3300000L,
	3700000L,
	4100000L,
	4500000L,/*50*/
	5000000L
};


/*
 * Player Sexes
 *
 *      Title,
 *      Winner
 */
const player_sex sex_info[MAX_SEXES] =
{
	{
#ifdef JP
		"女性",
		"クイーン",
#endif
		"Female",
		"Queen"
	},
	{
#ifdef JP
		"男性",
		"キング",
#endif
		"Male",
		"King"
	}
};


/*
 * Player Races
 *
 *      Title,
 *      {STR,INT,WIS,DEX,CON,CHR},
 *:::   r_dis, r_dev, r_sav, r_stl, r_srh, r_GRAZE, r_thn, r_thb,
 *      hitdie, exp base,
 *      Age (Base, Mod),
 *      Male (Hgt, Wgt),
 *      Female (Hgt, Wgt)
 *      infra,
 *      class-choices
 *:::   realm{元素、予見、付与、召喚、神秘、生命、破邪、自然、変容、暗黒、死霊、混沌}
 *:::   スコア倍率　基本100
 *:::	Flag 未実装、初期選択不可、特殊変容のみ、ユニークのみ
 */
const player_race race_info[MAX_RACES] =
{
	{
#ifdef JP
		"人間",
#endif
		"Human",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  10,  0,  0,  0,
		10,  100,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		///mod140105 種族変更（準備）暫定追加

		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 5, 5, 5, 5},//realm 怪異と異変に適性UP
		100,//scoremul
		FALSE,FALSE,FALSE,FALSE,//FLAG
		'p',(RF3_HUMAN),

	},
	{
#ifdef JP
		"妖怪",
#endif
		"Youkai",

		{ 2,  -2,  -3,  0, 2, -2 },
		-3,  -5,  0, 0, 10,  3, 10, -5,
		11,  125,
		24, 16,
		66,  6, 130, 15,
		62,  6, 100, 10,
		3,
		0xFFFFFFF,
		///mod140105 種族変更（準備）暫定追加

		{0,4,4,4,4,2,2,1,3,7,7,6,6, 5, 5, 5, 5, 5, 5, 5, 5},//realm
		100,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'y',(RF3_KWAI),

	},
	{
#ifdef JP
		"半妖",
#endif
		"Half-Youkai",

		{ 1, 0, -1, 0, 1, -1 },
		0, -1, 1, 0, 10, 1, 3, 0,
		10,  120,
		75, 75,
		60,  4, 100,  6,
		54,  4, 80,  6,
		0,
		0xFFFFFFF,
		{0,5,5,5,5,4,4,4,4,5,5,5,5,5,5,6, 6, 5, 5, 5, 5},//realm
		90,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG

		,'p',(RF3_HUMAN | RF3_KWAI),
	},
	{
#ifdef JP
		"仙人",
#endif
		"Hermit",

		{ -1, 2, 3, 0, 0, 2 },
		2, 10, 8, 1, 15, 5, 0, -10,
		10, 150,
		21, 12,
		36,  3, 60,  3,
		33,  3, 50,  3,
		2,
		0xFFFFFFF,
		{0,6,6,6,5,9,9,8,9,4,6,5,4,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_HUMAN),
	},
	{
#ifdef JP
		"天人",
#endif
		"Celestial",

		{  2, 3, 3, 2, 3, 3 },
		0,  12, 12, 0, 15, 5, 10, 10,
		12,  185,
		35, 15,
		48,  3, 150, 10,
		46,  3, 120, 10,
		2,
		0xFFFFFFF,

		{0,6,7,6,5,9,9,9,7,0,0,0,2,5,5,5, 5, 5, 5, 5, 5},//realm
		60,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_HUMAN),
	},
	{
#ifdef JP
		"妖精",
#endif
		"Fairy",

		{ -4,-4, -4, -2, -3, -2 },
		-5, -5, 10, 5, 10, 5, -20, -10,
		7,  150,
		35, 15,
		48,  3, 150, 10,
		46,  3, 120, 10,
		2,
		0xFFFFFFF,

		{0,3,1,1,1,2,6,1,7,1,1,1,1,5,5,5, 5, 5, 5, 5, 5},//realm
		200,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'F',(RF3_FAIRY),
	},


	{
#ifdef JP
		"河童",
#endif
		"Kappa",

		{  0, 1, -3,  2,  1, -1 },
		20, -4, 3, 2, 13, 2, 5, 10,
		11,  110,
		11,  4,
		66,  1, 150,  5,
		62,  1, 120,  5,
		0,
		0xFFFFFFF,
		{0,3,2,2,2,3,2,1,5,7,6,5,5,5,5,5, 5, 5, 5, 5, 5},//realm
		95,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'K',(RF3_KWAI),
	},
	{
#ifdef JP
		"魔法使い",
#endif
		"Magician",

		{ -2, 4, 3, -1, -1, 0 },
		5, 15, 10, 1, 15, -2, -10, -10,
		8,  130,
		20, 10,
		96, 10, 250, 50,
		84,  8, 225, 40,
		5,
		0xFFFFFFF,
		{0,9,9,9,9,7,6,6,7,7,7,8,8,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_DEMIHUMAN),
	},
	{
#ifdef JP
		"鴉天狗",
#endif
		"Crow-Tengu",

		{  1,  2, 0,  4,  2, 0 },
		5,  7, 6, 2, 15, 25, 10, 10,
		11,  140,
		50, 50,
		82, 5, 190, 20,
		78,  6, 180, 15,
		0,
		0xFFFFFFF,
		{0,4,5,4,3,5,3,2,8,6,7,6,5,5,5,5, 5, 5, 5, 5, 5},//realm
		70,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'t',(RF3_KWAI),
	},
	{
#ifdef JP
		"白狼天狗",
#endif
		"White-Wolf-Tengu",

		{  3,  -2,  -2, 2, 3, -2 },
		8, -3, 0, 2, 20, 12, 15, 5,
		12,  135,
		100, 30,
		90, 10, 190, 20,
		82, 10, 180, 15,
		8,
		0xFFFFFFF,
		{0,2,3,1,1,1,2,1,4,5,5,4,4,5,5,5, 5, 5, 5, 5, 5},//realm
		85,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'t',(RF3_KWAI),
	},
	{
#ifdef JP
		"鬼",
#endif
		"Oni",

		{ 7, -3, 1, 1, 4, 0 },
		-10, 5, 0, -3, 7, -10, 30, 0,
		18, 165,
		14, 8,
		82, 5, 200, 20,
		78,  6, 190, 15,
		0,
		0xFFFFFFF,
		{0,5,5,5,5,5,4,2,3,5,7,5,6,5,5,5, 5, 5, 5, 5, 5},//realm
		60,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'P',(RF3_KWAI),
	},
	{
#ifdef JP
		"死神",
#endif
		"Shinigami",

		{ 2, 1, 2, -1, 2, -3 },
		-3, 8, 25, 3, 10, -5, 15, -10,
		12,  160,
		40, 10,
		92, 10, 255, 60,
		80,  8, 235, 60,
		8,
		0xFFFFFFF,
		{0,5,5,5,5,3,0,2,2,4,7,9,6,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'W',(RF3_KWAI),
	},
	{
#ifdef JP
		"獣人",
#endif
		"Werebeast",

		{ 1, -1, -2, 2, 2, -2 },
		-2, -3, -3, 2, 14, 15, 10, -5,
		11, 140,
		30, 10,
		100,10, 255, 65,
		80, 10, 240, 64,
		10,
		0xFFFFFFF,
		{0,4,4,4,3,3,4,2,6,8,5,6,5,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'h',(RF3_KWAI | RF3_ANIMAL),
	},
	{
#ifdef JP
		"付喪神",
#endif
		"Tsukumogami",

		{ -1, -1, -1, 0, 1, -1},
		15, 16, 8, 1, 12, 0, 0, -5,
		9, 120,
		50, 24,
		92, 10, 255, 60,
		80,  8, 235, 60,
		2,
		0xFFFFFFF,

		{0,3,4,7,3,5,3,3,3,7,5,5,5,5,5,5, 5, 5, 5, 5, 5},//realm
		85,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'y',(RF3_KWAI | RF3_NONLIVING),
	},
	{
#ifdef JP
		"妖怪人形",
#endif
		"Youkai-Doll",

		{ 1, -1, -2, 0, 1, 0},
		0, 5, -5, 2, 8, 0, 5, 5,
		11, 200,
		100,30,
		111, 11, 255, 86,
		99, 11, 250, 86,
		0,
		0xFFFFFFF,
		{0,5,3,7,4,4,2,4,3,6,5,6,5,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'g',(RF3_KWAI | RF3_NONLIVING),
	},

	{
#ifdef JP
		"玉兎",
#endif
		"Moon-Rabbit",

		{ 0, 0, -1, 2, 1, 1},
		8, 8, 8, 2, 12, 12, 5, 15,
		10, 150,
		14, 3,
		50,  3, 90,  6,
		50,  3, 75,  3,
		7,
		0xFFFFFFF,
		{0,4,4,4,3,5,5,4,3,4,2,2,4,5,5,5, 5, 5, 5, 5, 5},//realm
		85,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'h',(RF3_KWAI | RF3_ANIMAL),
	},
	{
#ifdef JP
		"妖狐",
#endif
		"Youkai-Fox",

		{ -1, 3, 3, 2, 0, 1 },
		2, 10, 16, 3, 14, 7, -10, -10,
		9, 170,
		20, 3,
		60,  3, 80,  4,
		54,  3, 70,  4,
		7,
		0xFFFFFFF,

		{0,7,8,7,7,7,5,5,7,9,7,7,7,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'f',(RF3_KWAI | RF3_ANIMAL),
	},
	{
#ifdef JP
		"山童",
#endif
		"Yamawaro",

		{ 1, 0, -3, 1, 2, -1 },
		15, -6, 0, 2, 15, 4, 15, 10,
		11, 125,
		11,  3,
		60,  1, 130,  5,
		55,  1, 100,  5,
		0,
		0xFFFFFFF,
		{0,3,2,2,2,3,2,1,5,7,6,5,5,5,5,5, 5, 5, 5, 5, 5},//realm
		90,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'K',(RF3_KWAI),
	},
	{
#ifdef JP
		"化狸",
#endif
		"Bake-danuki",

		{ 1, 1, 1, -1, 1, -1 },
		2, 2, 3, 4, 10, 2, 7, 0,
		11, 140,
		40, 12,
		43,  3, 92,  6,
		40,  3, 78,  3,
		5,
		0xFFFFFFF,
		{0,5,4,4,5,3,4,2,5,8,6,5,7,5,5,5, 5, 5, 5, 5, 5},//realm
		80,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'h',(RF3_KWAI | RF3_ANIMAL),
	},
	{
#ifdef JP
		"人魚",
#endif
		"Merfolk",

		{ 0, 0, 0, 1, 1, 1 },
		0, 7, 7, 2, 12, 0, 0, -5,
		10, 110,
		75, 75,
		60,  4, 100,  6,
		54,  4, 80,  6,
		0,
		0xFFFFFFF,
		{0,6,6,7,5,5,5,3,4,8,6,7,6,5,5,5, 5, 5, 5, 5, 5},//realm
		90,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'h',(RF3_KWAI),
	},
	{
#ifdef JP
		"ホフゴブリン",
#endif
		"Hobgoblin",

		{ -1, -1, -2, 1, 2, -4 },
		7, 5, 3, 2, 12, 4, 5, 5,
		8, 110,
		75, 33,
		76,  1, 160,  5,
		72,  1, 130,  5,
		4,
		0xFFFFFFF,
		{0,5,5,5,5,3,3,2,4,5,5,5,5,5,5,5, 5, 5, 5, 5, 5},//realm
		100,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'o',(RF3_KWAI),
	},
	{
#ifdef JP
		"入道",
#endif
		"Nyuudou",

		{ 3, -1, -2, -3, 3, -1 },
		-4, -3, 0, 2, 12, 0, 20, 0,
		13, 150,
		100, 25,
		68,  6, 142, 15,
		63,  6, 112, 10,
		0,
		0xFFFFFFF,
		{0,2,3,2,2,2,1,1,3,8,4,4,3,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'P',(RF3_KWAI),
	},
	{
#ifdef JP
		"小悪魔",
#endif
		"Koakuma",

		{ -1, 2, -2, 1, 0, -2 },
		5, 10, 10, 2, 12, 3, 0, 0,
		9, 140,
		13,  4,
		68,  1, 150,  5,
		64,  1, 120,  5,
		6,
		0xFFFFFFF,
		{0,8,7,9,7,3,2,0,2,7,9,7,8,5,5,5, 5, 5, 5, 5, 5},//realm
		80,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'u',(RF3_DEMON),
	},
	{
#ifdef JP
		"ゴーレム",
#endif
		"Golem",

		{ 4, -5, -5, -3, 5, -2 },
		-10, -10, 20, -2, 7, -10, 20, 0,
		14, 160,
		1, 100,
		66,  1, 200,  6,
		62,  1, 180,  6,
		0,
		0xFFFFFFF,
		{0,6,2,6,3,2,1,1,1,5,4,4,3,5,5,5, 5, 5, 5, 5, 5},//realm
		80,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'g',(RF3_NONLIVING),
	},
	{
#ifdef JP
		"小人",
#endif
		"Inchling",

		{ -5, 0, 0, 0, -4, 0 },
		20, 12, 0, 20, 30, 50, -20, -5,
		5, 50,
		100, 35,
		72,  6, 50, 5,
		66,  4, 50, 5,
		0,
		0xFFFFFFF,
		{0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5, 5, 5, 5, 5, 5},//realm
		100,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_HUMAN),
	},
	{
#ifdef JP
		"キョンシー",
#endif
		"Jiangshi",

		{ 2, -4, -3, -2, 3, -3 },
		-5, -6, 5, 2, 8, -5, 10, -5,
		12, 150,
		100, 30,
		72, 6, 100, 25,
		66, 4, 100, 20,
		0,
		0xFFFFFFF,
		{0,3,2,3,2,1,1,1,1,3,3,8,3,5,5,5, 5, 5, 5, 5, 5},//realm
		80,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'z',(RF3_UNDEAD),
	},
	{
#ifdef JP
		"吸血鬼",
#endif
		"Vampire",

		{ 4, 2, 1, 2, 7, 2 },
		-2, 6, 10, 3, 11, 5, 20, 0,
		16, 175,
		100, 30,
		72,  6, 180, 25,
		66,  4, 150, 20,
		10,
		0xFFFFFFF,
		{0,7,7,7,7,1,0,0,1,8,8,9,6,5,5,5, 5, 5, 5, 5, 5},//realm
		65,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'V',(RF3_UNDEAD | RF3_DEMON),
	},
	{
#ifdef JP
		"幽霊",
#endif
		"Ghost",

		{ -3, 0, 0, -1, -2, -2 },
		3, 7, 5, 4, 11, 0, -10, -15,
		7, 170,
		100, 30,
		72, 6, 100, 25,
		66, 4, 100, 20,
		8,
		0xFFFFFFF,
		{0,5,5,5,5,1,0,1,1,5,7,9,5,5,5,5, 5, 5, 5, 5, 5},//realm
		50,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'G',(RF3_UNDEAD),
	},
	{
#ifdef JP
		"野良神様",
#endif
		"Stray-God",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  10,  0,  0,  0,
		11,  150,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5 ,5,5,5, 5, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'S',(RF3_DEITY),
	},


	{
#ifdef JP
		"大妖",
#endif
		"Great-Youkai",

		{ 4, 3, 1, 2, 4, 2 },
		2, 10, 20, 1, 18, 5, 15, 5,
		13, 200,
		14, 6,
		65,  6, 150, 20,
		61,  6, 120, 15,
		8,
		0xFFFFFFF,
		{0,7,6,6,7,4,3,0,3,7,9,6,7,5,5,5, 5, 5, 5, 5, 5},//realm
		60,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'Y',(RF3_KWAI),
	},


	{
#ifdef JP
		"現人神",
#endif
		"Arahitogami",

		{  1,  1,  1,  1,  1,  1 },
		0,  3,  3,  0,  13,  0,  3,  3,
		11,  125,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		{ 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 5, 7, 7, 5, 5, 5, 5},//realm
		75,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_HUMAN | RF3_DEITY),
	},

	{
#ifdef JP
		"月の民",
#endif
		"Lunarian",

		{  -2, 7, 5, 2, 1, 2 },
		10,  15, 12, 3, 20, 5, -30, 15,
		11, 190,
		35, 15,
		48,  3, 150, 10,
		46,  3, 120, 10,
		0,
		0xFFFFFFF,

		{0,8,8,8,8,9,2,9,2,4,0,0,4,5,5,5, 5, 5, 5, 5, 5},//realm
		70,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_DEMIHUMAN | RF3_DEITY),
	},
/*:::初期選択可能な種族はここまで。拡張するには色々パッチワークが必要。*/

	{
#ifdef JP
		"ニンジャ",
		"Ninja",
#else
		"Ninja",
#endif

		{  4,  2,  2,  7,  4,  -5 },
		20,  10, 10,  10, 20, 20, 20, 20,
		15,  150,
		255, 255,
		100,10, 255, 65,
		80, 10, 240, 64,
		10,
		0xFFFFFFF,

		{0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5, 5, 5, 5, 5, 5},//realm
		20,//scoremul
		FALSE,TRUE,TRUE,FALSE//FLAG
		,'p',(RF3_DEMIHUMAN),
	},
	{
#ifdef JP
		"半人半霊",
#endif
		"Half-Ghost",

		{  -1,  1,  1,  0,  -1,  -1 },
		2,  5,  3,  3,  12,  0,  -5,  -5,
		9,  150,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,

		{ 0, 5, 5, 5, 5, 5, 3, 3, 3, 7, 5, 8, 5, 5, 5, 6, 6, 5, 5, 5, 5},//realm
		90,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_HUMAN | RF3_UNDEAD),
	},
	{
#ifdef JP
		"小人(人間大)",
#endif
		"Inchling(Big)",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  10,  0,  0,  0,
		10,  100,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,//scoremul
		FALSE,FALSE,FALSE,TRUE//FLAG
		,'p',(RF3_HUMAN),
	},
	{
#ifdef JP
		"リッチ",
#endif
		"Lich",

		{ -4,  6,  5,  -3,  3,  -5},
		6, 24, 30,  3, 20,  -8, -35, -25,
		11,  200,
		14,  6,
		48,  6, 150, 25,
		44,  4, 130, 20,
		5,
		0xFFFFFFF,
		{0,8,8,8,8,0,0,0,0,9,9,9,9,5,5,5, 5, 5, 5, 5, 5},//realm
		33,//scoremul
		FALSE,TRUE,TRUE,FALSE//FLAG
		,'L',(RF3_UNDEAD),
	},
	{
#ifdef JP
		"究極生命体",
#endif
		"UltimateLifeform",

		{ 6, 6, 5, 5, 7, 3 },
		8, 10, 15, 4, 20, 15, 25, 25,
		20, 250,
		1, 100,
		72, 12, 240, 64,
		66, 12, 220, 64,
		10,
		0xFFFFFFF,
		{0,8,8,8,8,8,8,8,8,9,8,8,8,8,8,5, 5, 5, 5, 5, 5},//realm
		10,//scoremul
		FALSE,TRUE,FALSE,FALSE//FLAG
		,'H',(0L),
	},
	{
#ifdef JP
		"神格",
#endif
		"Deity",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  10,  0,  10,  10,
		12,  100,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		{ 0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 5, 5, 5, 5, 5, 5},
		100,//scoremul
		FALSE,FALSE,FALSE,TRUE//FLAG
		,'S',(RF3_DEITY),
	},
	{
#ifdef JP
		"女子高生",
#endif
		"Highschool-Girl",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  10,  0,  0,  0,
		10,  100,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,//scoremul
		FALSE,FALSE,FALSE,TRUE//FLAG
		,'p',(RF3_HUMAN),
	},
	{
#ifdef JP
		"蓬莱人",
#endif
		"Houraijin",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  10,  0,  0,  0,
		10,  100,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,//scoremul
		FALSE,FALSE,FALSE,TRUE//FLAG
		,'p',(RF3_DEMIHUMAN),
	},
	{
#ifdef JP
		"魔法地蔵",
#endif
		"Magic-Jizo",

		{  0,  1,  2,  -2,  1,  1 },
		-8,  6,  16,  2,  3,  0, -6, -6,
		12,  130,
		14,  6,
		72,  6, 180, 25,
		66,  4, 150, 20,
		0,
		0xFFFFFFF,
		{ 0, 7, 8, 8, 7, 8, 8, 7, 7, 3, 2, 3, 2, 5, 5, 5, 5, 5, 5, 5, 5},
		75,//scoremul
		FALSE,TRUE,FALSE,FALSE//FLAG
		,'g',(RF3_NONLIVING),
	},

	{
#ifdef JP
		"埴輪",
#endif
		"Haniwa",
		{ 1, -3, -2, -2, 1, -1 },
		-5, -3, 50, 2, 7, -3, 5, 5,
		10, 150,
		1, 100,
		66,  1, 200,  6,
		62,  1, 180,  6,
		0,
		0xFFFFFFF,
		{0,3,3,3,3,3,3,3,3,3,3,3,3,5,5,5, 5, 5, 5, 5, 5},
		70,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'g',(RF3_HANIWA),
	},
	{
#ifdef JP
		"動物霊",
#endif
		"Animal-Ghost",
		{ 1, -1, -2, 2, 2, -3 },
		-5, -3, 5, 3, 10, 5, 10, -5,
		11, 160,
		100, 30,
		72, 6, 100, 25,
		66, 4, 100, 20,
		12,
		0xFFFFFFF,
		{ 0,3,3,3,3,1,0,1,3,8,7,8,6,5,5,5, 5, 5, 5, 5, 5 },//realm
		70,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'G',(RF3_UNDEAD|RF3_ANIMAL),

	},
	{
#ifdef JP
		"座敷わらし",
#endif
		"Zashiki-Warashi",

		{ -3, 2, 1, 0, -3, 5 },
		16, 6, 6, 5, 20, 10, -30, -10,
		7, 110,
		100, 35,
		72,  6, 50, 5,
		66,  4, 50, 5,
		0,
		0xFFFFFFF,
		{ 0,5,9,6,5,6,6,4,5,4,5,5,3,5,5,5 , 5, 5, 5, 5, 5},//realm
		80,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(RF3_KWAI),
	},

};








/*
 * Player Classes
 *
 *      Title,
 *      {STR,INT,WIS,DEX,CON,CHR},
 *      c_dis, c_dev, c_sav, c_stl, c_srh, c_fos, c_thn, c_thb,
 *      x_dis, x_dev, x_sav, x_stl, x_srh, x_fos, x_thn, x_thb,
 *      HD, Exp, pet_upkeep_div
 */
const player_class class_info[MAX_CLASS] =
{
	{
#ifdef JP
		"戦士",
		"戦士",
		"Warrior",
#else
		"Warrior",
		"Warrior",
#endif
		{ 4, -2, -2, 2, 2, -1},
		25, 18, 31, 1,  14, 40, 70, 55,
		9, 7,  10, 0,  0,  12,  30, 30,
		9,  0, 60

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,5,70,
		{4,5,3,5,4,0,0,0,0,0
		,4,5,4,5,5,5,5,5,4,4
		,2}
		,100,0,5,1,
		FALSE,FALSE,FALSE
		,TRUE
		,1
		,0 //not unique;
	},

	{
#ifdef JP
		"メイジ",
		"メイジ",
		"Mage",
#else
		"Mage",
		"Mage",
#endif
		{-3, 3, 1, 0, -2, 1},
		30, 40, 40, 3,  21, 20, 34, 20,
		12,  15, 13,  0,  3,  7,  6, 7,
		0, 30, 30

		,{3,5,5,5,5,5,5,5,5,5,5,5,5,0,0,5,5,0,0,0,0}
		,A_INT
		,3,2,100,
		{1,1,1,1,3,0,0,0,0,0
		,3,2,1,2,3,1,1,1,1,1
		,2}
		,85,1,1,5,
		TRUE,FALSE,FALSE
		,TRUE
		,4
		,0 //not unique;
	},

	{
#ifdef JP
		"神官",
		"巫女",
		"Priest",
#else
		"Priest",
		"Shrine-Maiden",
#endif
		{0, 1, 3, -1, 0, 2},
		25, 35, 50, 2, 18, 25, 40, 40,
		7,  11, 15, 0,  1,  9, 13, 12,
		4, 65, 40

		,{3,0,0,0,0,4,5,5,4,4,5,5,4,0,0,0,0,0,0,0,0}
		,A_INT
		,5,3,100,
		{3,2,1,1,2,0,0,0,0,0
		,3,2,3,4,4,1,2,2,3,1
		,1}
		,80,4,2,4,
		TRUE,FALSE,FALSE
		,TRUE
		,4
		,0 //not unique;
	},

	{
#ifdef JP
		"探検家",
		"探検家",
		"Explorer",
#else
		"Explorer",
		"Explorer",
#endif
		{ 1, 1, -2, 2, 1, 0},
		45, 37, 36, 4, 40, 45, 48, 43,
		15, 12, 10, 1,  7, 15, 16, 18,
		4, 20, 55

		,{1,2,2,2,2,2,2,2,2,2,2,2,2,0,0,2,2,0,0,0,0}
		,A_INT
		,5,3,40,
		{3,2,2,4,4,0,0,0,0,0
		,5,3,3,2,2,2,1,1,2,4
		,3}
		,85,2,4,4,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;
	},

	{
#ifdef JP
		"レンジャー",
		"レンジャー",
		"Ranger",
#else
		"Ranger",
		"Ranger",
#endif
		{ 2, 0, -1, 3, 1, -1},
		30, 23, 36, 3, 35, 60, 60, 72,
		10,  9, 10, 2,  5, 18, 21, 32,
		5, 30, 40

		,{1,0,0,0,0,0,0,0,4,4,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{3,2,4,3,4,0,0,0,0,0
		,5,4,3,3,3,5,3,3,5,4
		,3}
		,70,2,3,2,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;

	},

	{
#ifdef JP
		"守護者",
		"守護者",
		"Guardian",
#else
		"Guardian",
		"Guardian",
#endif
		{ 1, -2, 2, -1, 2, 3},
		16, 20, 37, 1, 18, 35, 68, 40,
		 7,  10, 14, 0,  2, 10, 24, 15,
		8, 45, 40

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,5,70,
		{2,5,4,3,2,0,0,0,0,0
		,3,5,4,3,3,3,5,4,2,2
		,1}
		,75,0,4,3,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;

	},

	{
#ifdef JP
		"教師",
		"教師",
		"Teacher",
#else
		"Teacher",
		"Teacher",
#endif
		{ 0, 2, 0, 1, 0, 1},
		30, 35, 36, 2, 20, 40, 45, 45,
		 9, 10, 10, 0,  1, 10, 15, 15,
		3, 25, 45

		,{3,4,4,4,4,4,4,4,4,4,4,4,4,0,0,4,4,0,0,0,0}
		,A_INT
		,5,3,70,
		{3,3,3,3,3,0,0,0,0,0
		,3,3,3,3,3,3,3,3,3,3
		,3}
		,80,3,3,3,
		FALSE,FALSE,FALSE
		,TRUE
		,4
		,0 //not unique;
	},

	{
#ifdef JP
		"執事",
		"メイド",
		"Butler",
#else
		"Butler",
		"Maid",
#endif
		{ 0, 1, 1, 1, 1, 1},
		40, 30, 36, 3, 25, 40, 63, 50,
		12, 12, 12, 0,  3, 12, 22, 18,
		3, 25, 50

		,{1,3,3,3,3,3,3,3,3,3,3,3,3,0,0,3,3,0,0,0,0}
		,A_INT
		,5,4,60,
		{3,4,1,4,4,0,0,0,0,0
		,4,4,4,4,4,4,4,4,2,2
		,2}
		,85,1,4,4,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;
	},

	{
#ifdef JP
		"格闘家",
		"格闘家",
		"Martial-Artist",
#else
		"Martial-Artist",
		"Martial-Artist",
#endif
		{ 2, -2, 1, 3, 1, 1},
		20, 18, 26, 2, 22, 45, 55, 30,
		10,  7, 14,  1,  3,  15, 28, 12,
		4, 20, 80

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,90,
		{5,1,1,1,3,0,0,0,0,0
		,2,1,1,1,4,1,1,1,1,1
		,1}
		,75,1,2,1,
		FALSE,FALSE,FALSE
		,TRUE
		,1
			,0 //not unique;
	},

	{
#ifdef JP
		"超能力者",
		"超能力者",
		"Mindcrafter",
#else
		"Mindcrafter",
		"Mindcrafter",
#endif
		{0, -1, 3, 1, 0, 2},   /* note: spell stat is Wis */
		30, 33, 38, 3,  24, 16, 50, 45,
		12, 11, 12, 0,   4,  0, 18, 18,
		3, 20, 30

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_WIS
		,5,3,100,
		{4,2,1,1,4,0,0,0,0,0
		,4,4,2,3,3,3,3,3,2,2
		,1}
		,60,0,4,4,
		FALSE,FALSE,FALSE
		,TRUE
		,4
			,0 //not unique;
	},

	{
#ifdef JP
		"ハイ=メイジ",
		"ハイ=メイジ",
		"High-Mage",
#else
		"High-Mage",
		"High-Mage",
#endif
		{-4, 4, 2, -1, -2, 0},
		30, 40, 40, 3, 18, 18, 34, 20,
		7,  18, 13, 0,  2,  6,  6, 7,
		0, 10, 25

		,{1,6,6,6,6,6,6,6,6,6,6,6,6,0,0,6,6,0,0,0,0}
		,A_INT
		,3,2,100,
		{1,1,1,1,2,0,0,0,0,0
		,3,2,1,2,3,1,1,1,1,1
		,1}
		,90,1,1,5,
		TRUE,FALSE,FALSE
		,TRUE
		,5
			,0 //not unique;
	},

	{
#ifdef JP
		"普通の住人",
		"普通の住人",
		"Civilian",
#else
		"Civilian",
		"Civilian",
#endif
		{ 0, 0, 0, 0, 0, 0},
		25, 20, 30, 3, 20, 24, 43, 25,
		12,  9,  9, 0,  2,  8, 12, 10,
		3, 0, 80

		,{1,2,2,2,2,2,2,2,2,2,2,2,2,0,0,2,2,0,0,0,0}
		,A_INT
		,4,3,100,
		{3,3,3,3,3,0,0,0,0,0
		,3,3,3,3,3,3,3,3,3,3
		,3}
		,150,3,2,1,
		FALSE,FALSE,FALSE
		,TRUE
		,2
			,0 //not unique;
	},

	{
#ifdef JP
		"修験者",
		"修験者",
		"Shugenja",
#else
		"Shugenja",
		"Shugenja",
#endif
		{ 1, 0, 2, 1, 1, 0},
		25, 30, 36, 2, 24, 36, 60, 40,
		7,  10, 15, 0,  2,  15, 18, 16,
		4, 45, 55

		,{1,0,0,0,0,4,4,4,4,4,0,4,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{5,1,2,1,3,0,0,0,0,0
		,3,2,4,2,5,2,2,2,2,1
		,1}
		,75,2,3,3,
		FALSE,FALSE,FALSE
		,TRUE
		,4
			,0 //not unique;
	},

	{
#ifdef JP
		"魔法剣士",
		"魔法剣士",
		"Magic-Knight",
#else
		"Magic-Knight",
		"Magic-Knight",
#endif
		{ 1, 2, 0, 1, 0, 1},
		28, 40, 34, 2, 17, 24, 50, 33,
		9,  12, 11 ,0, 1,   7, 16, 10,
		4, 45, 50

		//追加値暫定
		,{1,4,4,4,4,0,0,0,0,0,4,0,4,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{2,3,2,4,2,0,0,0,0,0
		,4,5,4,1,1,1,1,1,1,1
		,1}
		,75,4,3,3,
		FALSE,FALSE,FALSE
		,TRUE
		,4
		,0 //not unique;
	},

		//v1.1.82 青魔再実装
	{
#ifdef JP
		"弾幕研究家",
		"弾幕研究家",
		"Danmakulogist",
#else
		"Danmakulogist",
		"Danmakulogist",
#endif
		{ -2, 3, 1, 1, 0, -2 },
		24, 32, 33, 2, 21, 20, 40, 20,
		10, 12, 11, 0,  3,  7, 10,  8,
		1, 45, 30

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,3,2,80,
			{ 2,1,2,1,2,0,0,0,0,0
			,3,2,1,2,2,1,1,1,1,1
			,2 }
			,70,1,1,4,
			TRUE,FALSE,FALSE
			,TRUE
			,3
			,0 //not unique;
	},

	{
#ifdef JP
		"射手",
		"射手",
		"Marksman",
#else
		"Marksman",
		"Marksman",
#endif
		{ 2, -1, -2, 3, 1, 0},
		40, 24, 35, 3,  30, 35, 45, 85,
		13, 10, 10, 0,  3,  10, 15, 40,
		4, 10, 60

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,80,
		{2,1,1,1,4,0,0,0,0,0
		,3,3,2,2,2,2,2,2,5,5
		,4}
		,80,0,4,2,
		FALSE,FALSE,FALSE
		,TRUE
		,1
		,0 //not unique;
	},

	{
#ifdef JP
		"魔道具使い",
		"魔道具使い",
		"Magic-Eater",
#else
		"Magic-Eater",
		"Magic-Eater",
#endif
		{-1, 3, 1, 1, -2, 0},
		30, 45, 36, 3,  22, 16, 45, 35,
		10, 22, 10, 0,  2,  0, 12, 10,
		2, 30, 50
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,90,
		{1,2,1,1,3,0,0,0,0,0
		,3,2,2,2,3,2,2,2,2,1
		,3}
		,80,0,2,5,
		TRUE,FALSE,FALSE
		,TRUE
		,3
			,0 //not unique;
	},

	{
#ifdef JP
		"エンジニア",
		"エンジニア",
		"Engineer",
#else
		"Engineer",
		"Engineer",
#endif
		{1, 3, -3, 2, 0, 0},
		40, 15, 20,  2, 25, 20, 47, 55,
		20,  6,   8,  0,  4,   8, 16, 24,
		2, 20, 80

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,90,
		{3,3,1,1,4,0,0,0,0,0
		,4,2,2,4,3,2,2,2,2,4
		,4}
		,82,0,4,1,
		FALSE,FALSE,FALSE
		,TRUE
		,2
			,0 //not unique;
	},

	{
#ifdef JP
		"司書",
		"司書",
		"Librarian",
#else
		"Librarian",
		"Librarian",
#endif
		{ 1, 2, -1, 1, 1, 0},
		20, 34, 34, 3, 16, 20, 55, 25,
		7,  11, 11, 0,   2, 10,  17, 11,
		4, 30, 60

		//追加値暫定
		,{2,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0}
		,A_INT
		,5,3,80,
		{2,3,2,2,3,0,0,0,0,0
		,4,4,3,4,2,2,1,1,2,3
		,2}
		,90,3,4,4,
		FALSE,FALSE,FALSE
		,TRUE
		,4
			,0 //not unique;
	},

	{
#ifdef JP
		"剣術家",
		"剣術家",
		"Samurai",
#else
		"Samurai",
		"Samurai",
#endif
		{ 3, -2, 1, 2, 1, 0},
		25, 18, 32, 2,  16, 6, 70, 40,
		12, 7,  10, 0,  1,  0,  23, 18,
		6,  30, 60

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{2,1,3,5,4,0,0,0,0,0
		,4,5,5,2,4,2,3,3,4,2
		,1}
		,90,0,5,1,
		FALSE,FALSE,FALSE
		,TRUE
		,1
		,0 //not unique;
	},


	{
#ifdef JP
		"兵士",
		"兵士",
		"Soldier",
#else
		"Soldier",
		"Soldier",
#endif
		{2, 1, -1, 2, 2, -3},
		32, 20, 20,  4, 28, 27, 55, 60,
		14,  8,  8,  0,  4, 10, 20, 25,
		4, 50, 120

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,100,
		{4,1,1,4,4,0,0,0,0,0
		,5,3,3,3,2,2,1,1,2,4
		,5}
		,80,0,3,1,
		FALSE,FALSE,FALSE
		,TRUE
		,2
		,0 //not unique;
	},


	{
#ifdef JP
		"薬師",
		"薬師",
		"Chemist",
#else
		"Chemist",
		"Chemist",
#endif
		{-1, 4, 0, 1, 0, 2},
		37, 32, 32, 4, 36, 25, 47, 52,
		11, 12, 10, 0,  5,  8, 18, 20,
		3, 30, 60

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,0,0,0,0,0,0}
		,A_INT
		,4,2,80,
		{3,2,1,1,4,0,0,0,0,0
		,4,2,2,3,3,2,2,1,2,3
		,2}
		,100,3,3,4,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;
	},

	{
#ifdef JP
		"騎兵",
		"騎兵",
		"Cavalry",
#else
		"Cavalry",
		"Cavalry",
#endif
		{ 2, -2, -2, 2, 2, 0},
		20, 18, 32, 1,  16, 35, 60, 66,
		10,  7, 10, 0,  0,  10, 22, 26,
		5, 20, 35

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{1,4,5,3,2,0,0,0,0,0
		,2,4,3,4,4,3,5,5,4,3
		,2}
		,90,0,5,1,
		FALSE,FALSE,FALSE
		,TRUE
		,1
		,0 //not unique;
	},
/*
	{
#ifdef JP
		"狂戦士",
		"狂戦士",
		"Berserker",
#else
		"Berserker",
		"Berserker",
#endif
		{ 8, -20, -20, 4, 4, -5},
		-100, -1000, -200, -100,  -100, -100, 120, -2000,
		0, 0,  0, 0,  0,  0,  50, 0,
		11,  60, 255

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,5,70,
		{4,4,4,4,4,0,0,0,0,0
		,3,3,3,3,3,3,3,3,3,3
		,3}
		,100,0,3,3,
		FALSE,TRUE,FALSE
		,TRUE
		,1
	},
*/

	{
#ifdef JP
		"付喪神使い",
		"付喪神使い",
		"Tsukumo-Master",
#else
		"Tsukumo-Master",
		"Tsukumo-Master",
#endif
		{1, 2, -1, 1, 1, -2},
		40, 36, 35, 2, 24, 25, 50, 45,
		13, 14, 12, 0,  3,  3, 18, 15,
		4, 35, 25

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,70,
		{2,2,2,2,5,0,0,0,0,0
		,4,3,3,4,3,4,3,3,1,2
		,1}
		,80,0,5,5,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;
	},

	{
#ifdef JP
		"古道具屋",
		"古道具屋",
		"SecondhandDealer",
#else
		"SecondhandDealer",
		"SecondhandDealer",
#endif
		{1, 2, 0, 1, 0, -1},
		40, 30, 30, 3, 35, 25, 48, 45,
		12, 12, 10, 0,  6,  8, 17, 18,
		4, 35, 70

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,100,
		{1,3,2,3,3,0,0,0,0,0
		,3,3,3,3,3,3,3,3,3,4
		,3}
		,80,0,5,5,
		FALSE,FALSE,FALSE
		,TRUE
		,2
		,0 //not unique;
	},

	{
#ifdef JP
		"宝飾師",
		"宝飾師",
		"Jeweler",
#else
		"Jeweler",
		"Jeweler",
#endif
		{ -1, 2, 1, 2, -2, 2},
		30, 40, 36, 2, 24, 16, 48,30,
		10, 17, 12, 0,  3,   3, 16,10,
		1, 50, 45

		//追加値暫定
		,{1,5,5,5,5,5,5,5,5,5,5,5,5,0,0,5,5,0,0,0,0}
		,A_INT
		,4,2,80,
		{1,2,1,1,3,0,0,0,0,0
		,4,3,2,3,2,2,2,2,2,2
		,1}
		,75,2,4,5,
		TRUE,FALSE,FALSE
		,TRUE
		,4
		,0 //not unique;
	},
	{
#ifdef JP
		"忍者",
		"忍者",
		"Ninja",
#else
		"Ninja",
		"Ninja",
#endif
		{ 0, 1, 0, 3, 0, -2},
		45, 27, 27, 5, 33, 48, 55,63,
		15, 12, 10, 2,  6, 16, 24,18,
		2,  45, 90

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,1,50,
		{5,1,1,4,5,0,0,0,0,0
		,5,2,3,2,1,1,1,1,3,3
		,1}
		,80,0,4,4,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;
	},
	//v1.1.87
	{
#ifdef JP
		"カード売人",
		"カード売人",
		"Card-Trader",
#else
		"Card-Trader",
		"Card-Trader",
#endif
		{ -1, 1, 0, 1, -1, 3 },
		30, 32, 30, 2, 27, 16, 48,45,
		10, 16, 10, 0,  3,  3, 16,16,
		1, 30, 75

		//追加値暫定
		,{ 1,4,4,4,4,4,4,4,4,4,4,4,4,0,0,4,0,0,0,0,0 }
		,A_INT
		,4,2,80,
		{ 2,2,1,1,3,0,0,0,0,0
		,3,3,2,3,3,2,2,2,2,2
		,3 }
		,70,2,2,4,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;
	},

	{
#ifdef JP
		"外来人",
		"外来人",
		"Outsider",
#else
		"Outsider",
		"Outsider",
#endif
		{ -3, -3, -3, -3, -3, -3},
		10, 10, 10, 1, 10, 10, 30, 30,
		10, 10, 10, 1,  1, 10, 12, 12,
		1, 30, 90

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,2,120,
		{2,2,2,2,2,0,0,0,0,0
		,2,2,2,2,2,2,2,2,2,2
		,2}
		,300,0,1,1,
		FALSE,FALSE,FALSE
		,TRUE
		,1
			,0 //not unique;
	},

		{
#ifdef JP
		"宵闇の妖怪",
		"宵闇の妖怪",
		"Rumia",
#else
		"Rumia",
		"Rumia",
#endif
		{1, -1, -1, -1, 0, -1},
		20,  7, 25, 2, 8, 20, 50, 20,
		 5, 10, 12, 2, 1,  5, 15, 10,
		3, 10, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,70,
		{4,1,1,3,2,0,0,0,0,0
		,4,3,2,3,2,2,1,1,1,1
		,1}
		,150,0,2,1,
		FALSE,FALSE,TRUE
		,TRUE
		,2
		,MON_RUMIA
	},

	{
#ifdef JP
		"半人半霊の庭師",
		"半人半霊の庭師",
		"Youmu",
#else
		"Youmu",
		"Youmu",
#endif
		{3, -2, -1, 3, 4, 3},
		23, 18, 30, -2,20, 40, 60, 45,
		 8, 12, 13, 1, 1,  18, 25, 15,
		7, 10, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{2,1,1,5,3,0,0,0,0,0
		,4,4,5,2,2,1,1,1,2,1
		,1}
		,55,0,4,2,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_YOUMU
	},

	{
#ifdef JP
		"幸運の素兎",
		"幸運の素兎",
		"Tewi",
#else
		"Tewi",
		"Tewi",
#endif
		{-2, 3, 2, 0, -1, 4},
		36, 22, 36, 3, 32, 42, 40, 40,
		12, 11, 12, 1,  5, 15, 15, 12,
		2, 30, 30

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,100,
		{1,1,1,1,2,0,0,0,0,0
		,3,2,2,4,4,3,2,2,2,1
		,1}
		,90,0,2,2,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_TEWI
	},



	{
#ifdef JP
		"狂気の月の兎",
		"狂気の月の兎",
		"Udonge",
#else
		"Udonge",
		"Udonge",
#endif
		{2, 3, -1, 0, 2, 0},
		36, 27, 40, 2, 30, 40, 52, 60,
		12, 12, 16, 3,  4, 14, 22, 30,
		5, 40, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{4,3,1,3,3,0,0,0,0,0
		,4,4,4,3,3,3,4,4,3,4
		,5}
		,57,0,4,2,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_UDONGE
	},
	{
#ifdef JP
		"美しき緋の衣",
		"美しき緋の衣",
		"Iku",
#else
		"Iku",
		"Iku",
#endif
		{0, 3, 3, 2, 0, 3},
		25, 36, 40, 3, 30, 45, 52, 36,
		14, 12, 15, 0,  4, 18, 18, 18,
		4, 30, 50

		,{1,4,4,3,3,3,3,3,4,0,0,0,0,0,0,3,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{4,3,3,3,3,0,0,0,0,0
		,3,3,3,3,3,3,3,3,3,3
		,3}
		,65,2,5,5,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_IKU
	},
	{
#ifdef JP
		"三途の水先案内人",
		"三途の水先案内人",
		"Komachi",
#else
		"Komachi",
		"Komachi",
#endif
		{0, 0, -2, 3, 2, 2},
		20, 30, 50, 1, 28, 25, 60, 35,
		 9, 12, 18, 0,  3, 10, 27, 20,
		6, 40, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,5,90,
		{2,2,3,2,4,0,0,0,0,0
		,2,2,2,2,5,3,4,5,1,1
		,1}
		,60,0,3,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_KOMACHI
	},
	{
#ifdef JP
		"愉快な忘れ傘",
		"愉快な忘れ傘",
		"Kogasa",
#else
		"Kogasa",
		"Kogasa",
#endif
		{2, 0, -1, 0, 1, 2},
		25, 30, 36, 1, 25, 25, 45, 10,
		10, 10, 12, 0,  2,  5, 16,  1,
		4, 0, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,100,
		{1,2,1,1,1,0,0,0,0,0
		,1,1,1,1,5,1,1,1,1,1
		,1}
		,130,0,5,5,
		FALSE,FALSE,TRUE
		,TRUE
		,2
		,MON_KOGASA
	},

	{
#ifdef JP
		"片腕有角の仙人",
		"片腕有角の仙人",
		"Kasen",
#else
		"Kasen",
		"Kasen",
#endif
		{6, 0, 0, 2, 6, 2},
		23, 40, 45, 4, 22, 30, 72, 35,
		12, 16, 18, 0,  1, 12, 25, 12,
		7, 60, 20

		,{1,0,0,0,5,5,5,0,5,0,5,6,5,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{5,1,5,1,3,0,0,0,0,0
		,3,2,2,5,4,3,2,2,2,2
		,1}
		,36,5,3,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_KASEN
	},
	{
#ifdef JP
		"小さな百鬼夜行",
		"小さな百鬼夜行",
		"Suika",
#else
		"Suika",
		"Suika",
#endif
		{2, 2, 1, 2, 2, 2},
		16, 20, 36, 1, 18, 24, 80, 50,
		16, 10, 14, 0,  4, 12, 32, 24,
		10, 30, 30

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,9,50,
		{5,1,1,1,4,0,0,0,0,0
		,2,1,2,4,1,3,1,2,1,1
		,1}
		,40,0,2,2,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_SUIKA
	},


	{
#ifdef JP
		"普通の黒魔術師",
		"普通の黒魔術師",
		"Marisa",
#else
		"Marisa",
		"Marisa",
#endif
		{-1, 4, 4, 5, 1, 4},
		40, 47, 32, 5, 45, 50, 50, 50,
		15, 16, 12, 0,  8, 30, 18, 18,
		4, 0, 30

		,{3,5,5,5,5,5,5,5,5,5,5,5,5,0,0,5,5,0,0,0,0}
		,A_INT
		,4,3,100,
		{4,3,4,1,3,0,0,0,0,0
		,3,2,2,2,4,2,2,3,2,2
		,4}
		,10,3,1,5,
		TRUE,TRUE,TRUE
		,FALSE
		,5
		,MON_MARISA
	},

	{
#ifdef JP
		"淡水に棲む人魚",
		"淡水に棲む人魚",
		"Wakasagi",
#else
		"Wakasagi",
		"Wakasagi",
#endif
		{ -2, 0, 1, 1, -1, 1},
		20, 24, 32, 4, 30, 25, 44, 55,
		 9, 12, 16, 1,  4,  8, 12, 16,
		2, 0, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,100,
		{3,3,1,1,4,0,0,0,0,0
		,3,3,2,3,3,1,4,1,3,3
		,1}
		,150,0,2,2,
		FALSE,FALSE,TRUE
		,TRUE
		,2
		,MON_WAKASAGI
	},
	{
#ifdef JP
		"閉じた恋の瞳",
		"閉じた恋の瞳",
		"Koishi",
#else
		"Koishi",
		"Koishi",
#endif
		{ -2, -7, -3, 3, 1, 2},
		 1, 16, 75,  0,  1, 80, 30,  1,
		 1, 10, 15,  5,  0,  0, 30,  1,
		2, 60, 200

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,4,100,
		{4,2,1,5,1,0,0,0,0,0
		,3,2,2,2,2,2,2,2,1,1
		,1}
		,25,0,1,1,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_KOISHI
	},
	{
#ifdef JP
		"下っ端哨戒天狗",
		"下っ端哨戒天狗",
		"Momiji",
#else
		"Momiji",
		"Momiji",
#endif
		{ 1, 3, 0, 1, 0, 0},
		36, 21, 32, 2, 60, 45, 54, 50,
		12,  9, 10, 0, 10, 12, 18, 20,
		3, 30, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{3,5,1,1,3,0,0,0,0,0
		,4,5,4,3,3,3,3,3,4,4
		,2}
		,95,0,4,1,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_MOMIZI
	},

	{
#ifdef JP
		"壁抜けの邪仙",
		"壁抜けの邪仙",
		"Seiga",
#else
		"Seiga",
		"Seiga",
#endif
		{ -1, 3, -1, 2, 1, -3},
		24, 40, 40, 3, 32, 30, 36, 36,
		15, 15, 15, 0,  3, 12,  8,  8,
		1, 40, 50

		,{3,4,4,5,4,3,4,2,2,2,5,5,5,0,0,4,0,0,0,0,0}
		,A_INT
		,3,2,100,
		{1,1,1,1,3,0,0,0,0,0
		,3,2,1,1,4,1,1,1,1,1
		,2}
		,50,2,2,5,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_SEIGA
	},
	{
#ifdef JP
		"氷の妖精",
		"氷の妖精",
		"Cirno",
#else
		"Cirno",
		"Cirno",
#endif
		{ 3, 1, 2, 3, 3, 3},
		10, 14, 30, 1, 12, 25, 40, 18,
		 2,  9, 12, 0,  1,  8, 23,  9,
		5, -20, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,100,
		{4,2,1,2,3,0,0,0,0,0
		,3,4,2,3,2,2,2,2,1,1
		,1}
		,75,0,1,1,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_CIRNO
	},
	{
#ifdef JP
		"地獄の輪禍",
		"地獄の輪禍",
		"Orin",
#else
		"Orin",
		"Orin",
#endif
		{ 1, 4, 3, 1, 1, -3},
		30, 30, 36, 4, 32, 55, 55, 36,
		12, 13, 15, 1,  4, 20,  20,  8,
		4, 45, 30

		,{1,0,0,0,0,0,0,0,0,3,4,5,4,0,0,4,0,0,0,0,0}
		,A_INT
		,4,3,90,
		{4,2,1,1,3,0,0,0,0,0
		,3,2,2,3,3,2,2,2,1,1
		,2}
		,70,3,3,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_ORIN
	},

	{
#ifdef JP
		"小人の末裔",
		"小人の末裔",
		"Shinmyoumaru",
#else
		"Shinmyoumaru",
		"Shinmyoumaru",
#endif
		{1, 0, 3, 2, 1, 3},
		36, 48, 32, 3, 32, 45, 55, 32,
		12, 24, 12, 1,  3, 16, 20, 16,
		5, 20, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,3,100,
		{3,3,4,2,4,0,0,0,0,0
		,5,5,5,4,3,2,3,3,3,3
		,2}
		,27,0,5,5,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_SHINMYOUMARU
	},
	{
#ifdef JP
		"ダウザーの小さな大将",
		"ダウザーの小さな大将",
		"Nazrin",
#else
		"Nazrin",
		"Nazrin",
#endif
		{ -2, 3, 3, 0, -2, 1},
		40, 40, 38, 3, 40, 36, 37, 40,
		14, 14, 12, 1,  8, 11, 12, 10,
		2, 25, 40

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,5,100,
		{1,2,2,2,3,0,0,0,0,0
		,3,3,2,2,4,2,3,2,2,3
		,2}
		,165,0,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_NAZRIN
	},
	{
#ifdef JP
		"冬の忘れ物",
		"冬の忘れ物",
		"Letty",
#else
		"Letty",
		"Letty",
#endif
		{ -1, 1, 2, -2, 0, 1},
		25, 20, 30, 4, 15, 20, 45, 30,
		12, 10, 10, 1,  1,  7,  15, 15,
		2, 20, 50

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,100,
		{2,3,1,1,2,0,0,0,0,0
		,3,3,2,3,3,2,3,2,2,2
		,1}
		,120,0,2,3,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_LETTY
	},
	{
#ifdef JP
		"忠実な死体",
		"忠実な死体",
		"Yoshika",
#else
		"Yoshika",
		"Yoshika",
#endif
		{ 1, 2, 1, 0, 2, 2},
		10, 14, 30, 3,  8, 20, 65, 10,
		 6,   6,  8, 0,  0,  4,  20,  5,
		10, 30, 50

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,5,70,
		{4,3,1,1,1,0,0,0,0,0
		,2,2,1,4,3,4,1,3,1,1
		,1}
		,75,0,1,1,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_YOSHIKA
	},

	{
#ifdef JP
		"動かない大図書館",
		"動かない大図書館",
		"Patchouli",
#else
		"Patchouli",
		"Patchouli",
#endif
		{ -2, 5, 3, -2, -4, 1},
		15, 30, 35, 4, 20, 10, 15, 10,
		10, 18, 15, 0,  3,  2,   5,  5,
		0, 40, 15

		//追加値暫定
		,{2,5,5,5,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,1,100,
		{1,1,1,1,2,0,0,0,0,0
		,2,1,1,1,2,1,1,1,1,1
		,1}
		,54,1,1,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_PATCHOULI
	},
	{
#ifdef JP
		"伝統の幻想ブン屋",
		"伝統の幻想ブン屋",
		"Aya",
#else
		"Aya",
		"Aya",
#endif
		{ 1, 1, 2, 5, 2, 1},
		25, 26, 32, 3, 30, 30, 55, 40,
		15, 13, 12, 0,  5, 15, 22, 12,
		4, 90, 50

		//追加値暫定
		,{1,0,0,0,0,3,0,0,4,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,3,60,
		{4,1,1,3,3,0,0,0,0,0
		,5,4,5,2,4,2,4,4,1,1
		,1}
		,55,1,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_AYA
	},
	{
#ifdef JP
		"ろくろ首の怪奇",
		"ろくろ首の怪奇",
		"Sekibanki",
#else
		"Sekibanki",
		"Sekibanki",
#endif
		{0, 1, 0, 1, 1, 1},
		23, 20, 22, 4, 22, 30, 50, 50,
		12, 11, 15, 0,  2, 10, 18, 21,
		3, 15, 50

		,{1,4,4,4,4,0,0,0,0,4,4,4,4,0,0,4,0,0,0,0,0}//専用性格以外は魔法習得できない
		,A_INT
		,5,3,90,
		{3,4,4,2,3,0,0,0,0,0
		,3,4,2,3,2,3,4,4,2,4
		,3}
		,110,0,3,2,
		FALSE,FALSE,TRUE
		,TRUE
		,2
		,MON_SEKIBANKI
	},
	{
#ifdef JP
		"夜雀の怪",
		"夜雀の怪",
		"Mystia",
#else
		"Mystia",
		"Mystia",
#endif
		{-1, -2, 0, 2, 0, 3},
		26, 20, 32, 5, 24, 32, 45, 15,
		12,  9, 10, 1,  3, 10, 21, 10,
		3, 25, 40

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,90,
		{4,2,1,1,2,0,0,0,0,0
		,4,3,3,2,2,2,4,3,1,2
		,1}
		,100,0,2,2,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_MYSTIA
	},
	{
#ifdef JP
		"悪魔の妹",
		"悪魔の妹",
		"Flandre",
#else
		"Flandre",
		"Flandre",
#endif
		{5, 3, -8, 1, 3, 0},
		1,  1, 60, 1,  10, 32, 72, 60,
		1, 16, 12, 0,  0, 10, 26, 25,
		7, 35, 100
		,{1,4,0,0,0,0,0,0,0,0,4,0,4,0,0,4,0,0,0,0,0}
		,A_INT
		,6,6,80,
		{3,1,1,4,4,0,0,0,0,0
		,2,5,2,4,5,4,3,3,4,3
		,1}
		,25,4,2,2,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_FLAN
	},
	{
#ifdef JP
		"毘沙門天の弟子",
		"毘沙門天の弟子",
		"Shou",
#else
		"Shou",
		"Shou",
#endif
		{3, 2, 5, -1, 2, 5},
		20, 30, 38, 2, 24, 24, 16, 16,
		10, 12, 16, 0,  2, 12, 40, 30,
		6, 40, 30

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,5,100,
		{4,3,4,4,4,0,0,0,0,0
		,3,4,4,3,5,3,5,4,3,2
		,1}
		,65,0,4,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_SHOU
	},
	{
#ifdef JP
		"小さなスイートポイズン",
		"小さなスイートポイズン",
		"Medicine",
#else
		"Medicine",
		"Medicine",
#endif
		{ 0, 1, 1, 1, 0, 1},
		21, 24, 30, 4, 16, 20, 40, 40,
		12, 12, 11, 0,  1,  4,  21, 18,
		3, 30, 50
		,{1,4,4,4,4,0,0,0,0,4,4,4,4,0,0,4,0,0,0,0,0}
		,A_INT
		,4,2,100,
		{3,3,1,3,3,0,0,0,0,0
		,3,3,3,3,3,3,3,3,3,3
		,2}
		,85,2,4,4,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_MEDICINE
	},

	{
#ifdef JP
		"華胥の亡霊",
		"華胥の亡霊",
		"Yuyuko",
#else
		"Yuyuko",
		"Yuyuko",
#endif
		{ 4, 4, 3, 2, 3, 5},
		22, 45, 45, 5, 35, 30, 55, 40,
		10, 16, 18, 1,  3, 10, 24, 16,
		5, 50, 20

		,{1,0,0,0,0,0,0,0,0,0,0,5,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,3,90,
		{4,3,3,3,3,0,0,0,0,0
		,4,3,4,2,3,2,4,4,3,2
		,1}
		,35,3,3,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_YUYUKO
	},
	{
#ifdef JP
		"怨霊も恐れ怯む少女",
		"怨霊も恐れ怯む少女",
		"Satori",
#else
		"Satori",
		"Satori",
#endif
		{ -3, 8, 8, -2, -3, -4},
		16, 30, 36, 4, 23, 40, 37, 45,
		12, 12, 12, 0,  1, 12, 12,  20,
		3, 25, 20

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,3,100,
		{1,2,2,1,2,0,0,0,0,0
		,3,2,2,2,2,2,2,2,2,2
		,1}
		,72,2,3,3,
		FALSE,FALSE,TRUE
		,FALSE
		,5
		,MON_SATORI
	},
	{
#ifdef JP
		"読経するヤマビコ",
		"読経するヤマビコ",
		"Kyouko",
#else
		"Kyouko",
		"Kyouko",
#endif
		{-1, 0, 2, -1, -1, 1},
		24, 20, 28, 2, 18, 24, 43, 15,
		10, 11, 10, 0,  2,  8, 18, 10,
		3, 10, 60

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,80,
		{2,2,1,1,3,0,0,0,0,0
		,2,2,2,3,4,2,3,3,1,2
		,1}
		,120,0,2,2,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_KYOUKO
	},
	{
#ifdef JP
		"神の末裔の亡霊",
		"神の末裔の亡霊",
		"Tojiko",
#else
		"Tojiko",
		"Tojiko",
#endif
		{2, 1, 0, 1, 2, 0},
		20, 22, 30, 3, 18, 36, 45, 50,
		10, 12, 11, 0,  1, 15, 16, 23,
		3, 30, 60

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,3,100,
		{4,2,1,1,3,0,0,0,0,0
		,3,3,3,2,2,2,2,2,4,3
		,1}
		,115,1,3,2,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_TOZIKO
	},
	{
#ifdef JP
		"春を運ぶ妖精",
		"春を運ぶ妖精",
		"Lilywhite",
#else
		"Lilywhite",
		"Lilywhite",
#endif
		{3, 3, 3, 3, 3, 3},
		20, 21, 35, 1, 21, 26, 50, 20,
		 5,  12, 12, 0, 2,  12, 20, 10,
		3, 0, 80

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,80,
		{1,1,1,2,1,0,0,0,0,0
		,2,2,2,2,2,2,2,2,1,1
		,1}
		,120,1,2,2,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_LILY_WHITE
	},

	{
#ifdef JP
		"恐るべき井戸の怪",
		"恐るべき井戸の怪",
		"Kisume",
#else
		"Kisume",
		"Kisume",
#endif
		{ -1, -1, 1, -2, 2, -2},
		18, 20, 28, 5, 20, 25, 60, 48,
		10,  9, 11, 1,  3, 10, 25, 24,
		3, 15, 70

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,3,80,
		{4,3,1,1,4,0,0,0,0,0
		,1,2,2,4,2,4,2,2,1,2
		,1}
		,180,0,4,1,
		FALSE,FALSE,TRUE
		,TRUE
		,2
		,MON_KISUME
	},

	{
#ifdef JP
		"今どきの念写記者",
		"今どきの念写記者",
		"Hatate",
#else
		"Hatate",
		"Hatate",
#endif
		{ 0, 2, 1, -1, 1, 1},
		24, 32, 30, 3, 27, 25, 50, 68,
		11, 12, 10, 1,  4, 12, 20, 27,
		4, 40, 75

		,{1,0,4,0,0,0,3,0,0,0,3,0,0,0,0,4,0,0,0,0,0}
		,A_INT
		,4,2,90,
		{2,2,1,1,4,0,0,0,0,0
		,3,2,3,1,2,1,3,2,4,5
		,4}
		,68,3,3,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_HATATE
	},

	{
#ifdef JP
		"聖徳道士",
		"聖徳道士",
		"Miko",
#else
		"Miko",
		"Miko",
#endif
		{ 3, 5, 5, 2, 2, 5},
		30, 48, 40, 4, 32, 36, 55, 48,
		18, 22, 18, 0,  5,  18, 25, 21,
		5, 30, 25

		//追加値暫定
		,{2,0,0,0,0,5,5,5,5,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{4,3,4,4,4,0,0,0,0,0
		,4,5,5,4,4,4,4,4,4,3
		,3}
		,16,2,5,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_MIKO
	},

	{
#ifdef JP
		"表情豊かなポーカーフェイス",
		"表情豊かなポーカーフェイス",
		"Kokoro",
#else
		"Kokoro",
		"Kokoro",
#endif
		{2, 3, 3, 2, 2, 3},
		26, 36, 32, 3, 24, 30, 58, 45,
		13, 16, 13, 0,  3, 12, 25, 20,
		5, 55, 60

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{4,2,1,1,3,0,0,0,0,0
		,3,3,4,3,3,3,4,5,3,3
		,2}
		,36,0,4,5,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_KOKORO
	},
	{
#ifdef JP
		"闇に蠢く光の蟲",
		"闇に蠢く光の蟲",
		"Wriggle",
#else
		"Wriggle",
		"Wriggle",
#endif
		{ -1, -2, -1, 0, 1, 1},
		24, 20, 32, 3, 27, 30, 43, 36,
		12, 10, 12, 0,  3,   8, 16, 14,
		2, 30, 30

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,100,
		{4,2,2,2,2,0,0,0,0,0
		,3,3,2,2,2,2,3,3,2,2
		,1}
		,160,0,2,1,
		FALSE,FALSE,TRUE
		,TRUE
		,3
		,MON_WRIGGLE
	},
	{
#ifdef JP
		"四季のフラワーマスター",
		"四季のフラワーマスター",
		"Yuuka",
#else
		"Yuuka",
		"Yuuka",
#endif
		{ 3, 2, 2, 1, 3, 3},
		33, 30, 36, 4,  30, 30, 75, 45,
		11, 13, 14, 0,  4,  10,  32, 16,
		9, 140, 40

		,{1,5,0,0,0,0,0,0,5,0,0,0,5,0,0,0,0,0,0,0,0}
		,A_INT
		,6,3,70,
		{3,2,2,2,3,0,0,0,0,0
		,3,3,3,3,4,3,4,4,2,1
		,1}
		,35,0,4,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_YUUKA
	},
	{
#ifdef JP
		"凶兆の黒猫",
		"凶兆の黒猫",
		"Chen",
#else
		"Chen",
		"Chen",
#endif
		{1, 2, 1, 3, 1, 2},
		20, 24, 30, 4, 18, 36, 55, 20,
		10, 12, 11, 1, 3,  15, 24, 10,
		3, 10, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,80,
		{4,1,1,2,2,0,0,0,0,0
		,4,2,2,2,2,2,2,2,1,1
		,1}
		,140,1,2,3,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_CHEN
	},
	{
#ifdef JP
		"水難事故の念縛霊",
		"水難事故の念縛霊",
		"Minamitsu",
#else
		"Minamitsu",
		"Minamitsu",
#endif
		{ 1, 1, 3, 1, 0, -2},
		36, 30, 38, 4, 20, 32, 50, 40,
		13, 12, 11, 0,  3, 10, 20, 10,
		5, 25, 40

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,5,100,
		{4,1,1,1,4,0,0,0,0,0
		,2,2,2,4,4,2,2,2,2,2
		,1}
		,65,0,3,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_MURASA
	},
	{
#ifdef JP
		"知識と歴史の半獣",
		"知識と歴史の半獣",
		"Keine",
#else
		"Keine",
		"Keine",
#endif
		{ -2, 6, 4, -2, 0, 4},
		32, 36, 30, 2, 27, 26, 55, 45,
		16, 14, 13, 0,  4, 10, 24, 15,
		5, 45, 40

		,{1,0,0,0,0,5,5,5,5,4,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,3,80,
		{3,3,2,2,3,0,0,0,0,0
		,3,4,4,3,3,2,2,2,2,2
		,2}
		,75,4,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_KEINE
	},

	{
#ifdef JP
		"博麗の巫女",
		"博麗の巫女",
		"Reimu",
#else
		"Reimu",
		"Reimu",
#endif
		{0, 0, 0, 0, 0, 0},
		25, 30, 27, 2, 25, 65, 50, 50,
		12, 12, 12, 0,  5, 25, 20, 20,
		6, 30, 40

		,{1,0,0,0,0,4,4,5,4,0,0,0,0,0,0,4,4,0,0,0,0}
		,A_INT
		,4,4,80,
		{4,4,4,4,5,0,0,0,0,0
		,4,4,4,4,5,4,4,4,4,4
		,4}
		,10,1,4,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_REIMU
	},

	{
#ifdef JP
		"語られる怪力乱神",
		"語られる怪力乱神",
		"Yugi",
#else
		"Yuugi",
		"Yuugi",
#endif
		{4, 1, 2, -1, 3, 1},
		10, 24, 29, 1, 16, 20, 90, 40,
		10, 10, 11, 0,  2, 12, 30, 18,
		7, 35, 55
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,9,50,
		{4,1,1,1,2,0,0,0,0,0
		,2,2,2,3,3,3,2,2,1,1
		,1}
		,75,0,3,2,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_YUGI
	},
	{
#ifdef JP
		"竹林のルーガルー",
		"竹林のルーガルー",
		"Kagerou",
#else
		"Kagerou",
		"Kagerou",
#endif
		{1, 0, 0, 1, 1, 1},
		25, 20, 30, 4,20, 40, 55, 30,
		 8, 12, 12, 0, 3, 18, 24, 12,
		4, 20, 50

		,{1,0,0,0,0,0,0,0,0,2,2,0,0,0,0,2,0,0,0,0,0}
		,A_INT
		,5,3,80,
		{4,1,1,3,2,0,0,0,0,0
		,3,2,2,2,2,2,2,2,1,1
		,1}
		,100,0,1,3,
		FALSE,FALSE,TRUE
		,TRUE
		,3
		,MON_KAGEROU
	},
	{
#ifdef JP
		"寂しさと終焉の象徴",
		"寂しさと終焉の象徴",
		"Shizuha",
#else
		"Shizuha",
		"Shizuha",
#endif
		{2, -1, 0, 2, -1, -2},
		24, 22, 27, 3,16, 20, 50, 20,
		12, 12, 12, 0, 3,  5, 22, 10,
		2, 0, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,70,
		{4,1,1,1,2,0,0,0,0,0
		,2,2,2,3,2,3,1,1,1,1
		,1}
		,200,0,2,1,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_SHIZUHA
	},


	{
#ifdef JP
		"祀られる風の人間",
		"祀られる風の人間",
		"Sanae",
#else
		"Sanae",
		"Sanae",
#endif
		{-1, 1, 3, -1, -1, 2},
		26, 32, 32, 3, 21, 25, 43, 38,
		12, 12, 16, 0,  2,  9, 16, 12,
		3, 40, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,90,
		{3,2,1,1,3,0,0,0,0,0
		,3,2,2,3,4,2,2,2,1,1
		,2}
		,85,1,2,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_SANAE
	},
	{
#ifdef JP
		"豊かさと稔りの象徴",
		"豊かさと稔りの象徴",
		"Minoriko",
#else
		"Minoriko",
		"Minoriko",
#endif
		{ 0, 0, 2, -1, 0, 1},
		22, 24, 32, 2, 20, 23, 45, 25,
		10, 12, 10, 0,  3,  7, 12, 10,
		2, 25, 60

		,{1,0,0,0,0,0,0,0,5,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,2,100,
		{1,2,2,2,3,0,0,0,0,0
		,2,2,2,3,2,2,2,3,1,1
		,1}
		,160,3,2,2,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_MINORIKO
	},
	{
#ifdef JP
		"永遠に紅い幼き月",
		"永遠に紅い幼き月",
		"Remilia",
#else
		"Remilia",
		"Remilia",
#endif
		{3, 2, 2, 3, 3, 3},
		36, 45, 40, 4, 36, 36, 80, 60,
		12, 12, 12, 1,  5, 15, 30, 27,
		8, 80, 30

		,{1,4,5,4,4,0,0,0,0,4,5,4,4,0,0,4,0,0,0,0,0}
		,A_INT
		,6,5,70,
		{5,2,2,2,5,0,0,0,0,0
		,4,4,4,4,4,4,5,5,3,3
		,1}
		,25,1,3,2,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_REMY
	},
	{
#ifdef JP
		"超妖怪弾頭",
		"超妖怪弾頭",
		"Nitori",
#else
		"Nitori",
		"Nitori",
#endif
		{1, 1, 1, 2, 0, 1},
		55, 21, 27, 3, 23, 20, 50, 60,
		32,  9, 10, 0,  2,  8, 22, 24,
		4, 40, 80

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,80,
		{4,3,1,1,3,0,0,0,0,0
		,2,1,1,4,3,2,1,1,1,4
		,5}
		,67,0,4,2,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_NITORI
	},
	{
#ifdef JP
		"封印された大魔法使い",
		"封印された大魔法使い",
		"Byakuren",
#else
		"Byakuren",
		"Byakuren",
#endif
		{ -1, 3, 7, -1, -2, 6},
		27, 45, 36, 2, 21, 30, 40, 40,
		16, 18, 15, 0,  4, 12, 15, 18,
		0, 70, 30

		,{1,5,5,5,5,5,5,0,5,0,5,0,0,0,0,5,0,0,0,0,0}
		,A_INT
		,5,3,100,
		{5,3,2,2,4,0,0,0,0,0
		,2,4,3,3,4,3,3,3,2,2
		,1}
		,30,3,3,5,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_BYAKUREN
	},
	{
#ifdef JP
		"土着神の頂点",
		"土着神の頂点",
		"Suwako",
#else
		"Suwako",
		"Suwako",
#endif
		{ 1, 4, 7, 2, 3, 2},
		30, 40, 40, 3, 28, 30, 50, 45,
		18, 18, 18, 1,  5, 12, 18, 16,
		6, 120, 20

		//追加値暫定
		,{2,0,0,0,0,0,0,0,0,5,5,5,5,0,0,0,0,0,0,0,0}
		,A_INT
		,5,3,100,
		{4,1,1,2,3,0,0,0,0,0
		,4,3,4,3,3,2,3,3,2,2
		,1}
		,20,1,3,5,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_SUWAKO
	},

	{
#ifdef JP
		"未確認幻想飛行少女",
		"未確認幻想飛行少女",
		"Nue",
#else
		"Nue",
		"Nue",
#endif
		{ 0, 2, 0, 1, 0, 0},
		27, 34, 32, 5, 24, 27, 55, 45,
		16, 16, 12, 1,  3, 18, 27, 15,
		5, 40, 40

		//追加値暫定
		,{1,0,0,0,0,0,0,0,0,5,5,5,5,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{4,2,2,2,3,0,0,0,0,0
		,3,3,3,3,3,4,5,4,1,1
		,1}
		,40,3,3,5,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_NUE
	},
	{
#ifdef JP
		"逆襲のあまのじゃく",
		"逆襲のあまのじゃく",
		"Seija",
#else
		"Seija",
		"Seija",
#endif
		{-3, 5, 5, 2, -2, -7},
		32, 48, 25, 5, 28, 32, 35, 50,
		18, 20,  8, 1,  5, 10,  12, 25,
		0, 35, 80

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,2,120,
		{1,1,1,1,3,0,0,0,0,0
		,2,1,1,2,1,1,1,1,1,2
		,2}
		,125,0,5,5,
		TRUE,FALSE,TRUE
		,FALSE
		,3
		,MON_SEIJA
	},
	{
#ifdef JP
		"熱かい悩む神の火",
		"熱かい悩む神の火",
		"Utsuho",
#else
		"Utsuho",
		"Utsuho",
#endif
		{ 2, -3, 1, 0, 4, 2},
		14, 15, 36, 1, 15, 18, 55, 45,
		10, 10, 16, 0,  1,   6, 24, 16,
		7, 50, 90
		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{4,1,1,1,1,0,0,0,0,0
		,1,1,1,3,3,1,1,1,1,1
		,4}
		,25,0,1,1,
		FALSE,FALSE,TRUE
		,FALSE
		,5
		,MON_UTSUHO
	},
	{
#ifdef JP
		"暗い洞窟の明るい網",
		"暗い洞窟の明るい網",
		"Yamame",
#else
		"Yamame",
		"Yamame",
#endif
		{1, -1, 0, 1, 0, -2},
		32, 20, 25, 4, 28, 20, 45, 20,
		10,  8, 12, 1, 1,  5, 18, 10,
		3, 20, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,80,
		{3,2,1,2,2,0,0,0,0,0
		,3,2,2,3,2,3,2,2,1,1
		,1}
		,120,0,2,2,
		FALSE,FALSE,TRUE
		,TRUE
		,3
		,MON_YAMAME
	},
	{
#ifdef JP
		"すきま妖怪の式",
		"すきま妖怪の式",
		"Ran",
#else
		"Ran",
		"Ran",
#endif
		{4, 4, 4, 4, 4, 4},
		30, 36, 40, 4, 32, 40, 60, 60,
		10, 15, 12, 0,  3,  12, 20, 20,
		7, 30, 25

		,{3,4,4,4,4,4,4,4,4,4,4,4,4,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{4,4,4,4,4,0,0,0,0,0
		,4,4,4,4,4,4,4,4,4,4
		,4}
		,65,4,4,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_RAN
	},
	{
#ifdef JP
		"楽園の最高裁判長",
		"楽園の最高裁判長",
		"Yamaxanadu",
#else
		"Yamaxanadu",
		"Yamaxanadu",
#endif
		{ 2, 5, 9, 1, 5, 3},
		20, 38, 45, 2, 32, 20, 45, 40,
		12, 15, 20, 0,  9,  7,  16, 18,
		7, 100, 30

		,{1,0,0,0,0,4,4,4,4,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,100,
		{1,2,1,1,2,0,0,0,0,0
		,3,3,3,3,3,3,3,3,1,1
		,1}
		,18,0,5,5,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_EIKI
	},
	{
#ifdef JP
		"非想非非想天の娘",
		"非想非非想天の娘",
		"Tenshi",
#else
		"Tenshi",
		"Tenshi",
#endif
		{ 1, 0, 0, 1, 1, -1},
		40, 40, 36, 1, 20, 24, 45, 40,
		18, 21, 13 ,0, 2,   7, 26, 15,
		5, 30, 40

		//追加値暫定
		,{1,0,0,0,0,4,4,4,4,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{4,2,2,2,2,0,0,0,0,0
		,4,5,4,3,3,3,2,2,2,2
		,2}
		,45,3,2,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_TENSHI
	},
	{
#ifdef JP
		"華人小娘",
		"華人小娘",
		"Meiling",
#else
		"Meiling",
		"Meiling",
#endif
		{ 1, -1, 2, 2, 2, 1},
		22, 22, 30, 3, 24, 32, 55, 47,
		6,  11, 12, 0,  2,  12, 23, 17,
		6, 30, 65

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,4,80,
		{5,3,1,1,4,0,0,0,0,0
		,3,3,3,3,4,3,3,3,2,1
		,1}
		,65,0,3,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_MEIRIN
	},
	{
#ifdef JP
		"地殻の下の嫉妬心",
		"地殻の下の嫉妬心",
		"Parsee",
#else
		"Parsee",
		"Parsee",
#endif
		{ 0, 1, 2, 0, -1, -2},
		20, 24, 28, 2, 16, 20, 45, 30,
		12, 10,  9, 0,  4,   5,  15, 15,
		1, 20, 70

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,2,90,
		{2,1,1,2,2,0,0,0,0,0
		,3,3,3,3,3,3,2,2,2,2
		,1}
		,110,0,2,2,
		FALSE,FALSE,TRUE
		,TRUE
		,3
		,MON_PARSEE
	},
	{
#ifdef JP
		"小人の末裔",
		"小人の末裔",
		"Shinmyoumaru2",
#else
		"Shinmyoumaru2",
		"Shinmyoumaru2",
#endif
		{1, 0, 3, 2, 1, 3},
		36, 48, 32, 3, 32, 45, 55, 32,
		12, 24, 12, 1,  3, 16, 20, 16,
		5, 30, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,3,100,
		{4,1,4,2,4,0,0,0,0,0
		,5,5,5,4,3,2,3,3,3,3
		,1}
		,67,0,5,5,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_SHINMYOUMARU
	},

	{
#ifdef JP
		"秘封倶楽部初代会長",
		"秘封倶楽部初代会長",
		"Sumireko",
#else
		"Sumireko",
		"Sumireko",
#endif
		{-2, 3, 3, 1, -1, 2},
		30, 20, 35, 4, 28, 16, 45, 55,
		12, 15, 11, 0,  5,  0, 22, 24,
		3, 40, 60

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,1,100,
		{4,2,2,1,5,0,0,0,0,0
		,2,1,1,2,2,2,2,2,1,2
		,3}
		,40,0,2,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_SUMIREKO
	},
	{
#ifdef JP
		"守り守られし大輪",
		"守り守られし大輪",
		"Ichirin",
#else
		"Ichirin",
		"Ichirin",
#endif
		{ -1, 3, 5, 0, 0, 3},
		25, 26, 30, 1, 24, 36, 70, 24,
		7,  12, 11, 0,  2,  15, 16, 10,
		3, 45, 70

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,2,80,
		{4,1,1,1,2,0,0,0,0,0
		,1,1,1,2,2,1,1,1,1,1
		,1}
		,67,2,2,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_ICHIRIN
	},

	{
#ifdef JP
		"蓬莱の人の形",
		"蓬莱の人の形",
		"Mokou",
#else
		"Mokou",
		"Mokou",
#endif
		{-1, 1, 3, 1, -2, 0},
		39, 36, 30, 3, 30, 35, 64, 55,
		11, 10, 10, 0,  2, 12, 18, 18,
		0, 180, 70
		,{1,4,4,4,4,4,4,4,4,0,4,4,4,0,0,4,0,0,0,0,0}
		,A_INT
		,5,1,100,
		{4,4,4,4,4,0,0,0,0,0
		,4,4,4,4,4,4,4,4,4,4
		,1}
		,100,2,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_MOKOU
	},
	{
#ifdef JP
		"山坂と湖の権化",
		"山坂と湖の権化",
		"Kanako",
#else
		"Kanako",
		"Kanako",
#endif
		{ 1, 0, 2, -1, 2, 1},
		24, 25, 36, 2, 20, 24, 40, 40,
		10, 10, 12 ,0,  2,   7, 15, 12,
		3, 120, 20

		,{1,0,0,0,0,4,4,4,4,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{4,3,3,3,4,0,0,0,0,0
		,3,4,4,5,5,3,4,4,3,2
		,1}
		,20,4,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_KANAKO
	},

	{
#ifdef JP
		"古代日本の尸解仙",
		"古代日本の尸解仙",
		"Futo",
#else
		"Futo",
		"Futo",
#endif
		{ -1, 2, 0, 2, -1, 1},
		22, 34, 30, 1, 20, 24, 48, 56,
		15, 12, 14, 1,  5,  8,  18,  22,
		3, 30, 55

		,{1,3,3,0,0,3,0,0,4,0,0,0,0,0,0,3,0,0,0,0,0}
		,A_INT
		,3,2,100,
		{4,1,3,2,4,0,0,0,0,0
		,2,2,2,2,2,1,1,1,4,3
		,1}
		,80,1,1,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_FUTO
	},
	{
#ifdef JP
		"輝ける日の光",
		"輝ける日の光",
		"Sunnymilk",
#else
		"Sunnymilk",
		"Sunnymilk",
#endif
		{ 2, 2, 1, 1, 1, 1},
		25, 20, 28, 0, 20, 24, 45, 25,
		9,  9,  8, 1,  2,  8, 16, 10,
		4, 10, 80

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,100,
		{3,3,1,1,2,0,0,0,0,0
		,2,3,2,3,3,3,2,2,1,1
		,1}
		,110,0,1,2,
		FALSE,FALSE,TRUE
		,TRUE
		,2
		,MON_3FAIRIES
	},
	{
#ifdef JP
		"静かなる月の光",
		"静かなる月の光",
		"Lunachild",
#else
		"Lunachild",
		"Lunachild",
#endif
		{ 0, 3, 1, -2, 0, 1},
		20, 22, 30, 2, 30, 24, 40, 25,
		7,  11,  12, 1,  4,  8, 15, 10,
		3, 30, 60

		,{1,2,2,0,0,0,2,0,2,0,2,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,100,
		{1,2,1,1,1,0,0,0,0,0
		,3,2,2,2,1,1,2,1,1,2
		,1}
		,100,3,2,3,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_3FAIRIES
	},

	{
#ifdef JP
		"降り注ぐ星の光",
		"降り注ぐ星の光",
		"Starsapphire",
#else
		"Starsapphire",
		"Starsapphire",
#endif
		{ 0, 2, 1, 2, -1, 1},
		28, 24, 30, 5, 23, 24, 37, 40,
		15, 12, 10, 0,  3,  8, 12, 16,
		2, 20, 70

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,1,100,
		{1,1,1,2,3,0,0,0,0,0
		,2,2,2,2,1,1,2,2,2,3
		,1}
		,120,0,3,2,
		FALSE,FALSE,TRUE
		,TRUE
		,3
		,MON_3FAIRIES
	},
	{
#ifdef JP
		"七色の人形遣い",
		"七色の人形遣い",
		"Alice",
#else
		"Alice",
		"Alice",
#endif
		{-1, 2, 1, 5, -1, 2},
		40, 42, 28, 3, 27, 18, 50, 20,
		16, 15, 12, 0,  3, 10, 21, 10,
		4, 45, 20

		,{1,4,4,4,4,0,0,0,0,0,4,4,0,0,0,4,0,0,0,0,0}
		,A_INT
		,1,1,100,
		{2,1,1,1,4,0,0,0,0,0
		,4,4,4,4,4,4,4,4,1,1
		,1}
		,65,1,4,5,
		TRUE,FALSE,TRUE
		,TRUE
		,4
		,MON_ALICE
	},

	{
#ifdef JP
		"騒霊ヴァイオリスト",
		"騒霊ヴァイオリスト",
		"Lunasa",
#else
		"Lunasa",
		"Lunasa",
#endif
		{2, 4, 3, 2, 2, 3},
		20, 24, 32, 3, 18, 30, 47, 40,
		10, 12, 12, 0,  1, 12, 16, 16,
		3, 20, 40

		,{3,4,4,4,4,0,0,0,0,0,4,4,4,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,100,
		{2,2,2,2,2,0,0,0,0,0
		,3,3,2,2,4,3,4,2,2,2
		,1}
		,100,2,3,3,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_LUNASA
	},
	{
#ifdef JP
		"騒霊トランペッター",
		"騒霊トランペッター",
		"Merlin",
#else
		"Merlin",
		"Merlin",
#endif
		{3, 0, 2, 2, 4, 4},
		12, 20, 28, 1, 16, 32, 60, 36,
		10, 10, 10, 0,  0, 13, 27, 15,
		3, 20, 80 //HD7相当に補正

		,{3,4,4,4,4,0,0,0,0,0,4,4,4,0,0,0,0,0,0,0,0}
		,A_INT
		,5,3,80,
		{4,2,1,1,2,0,0,0,0,0
		,3,3,2,4,4,4,3,3,1,1
		,1}
		,100,0,1,1,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_MERLIN
	},
	{
#ifdef JP
		"騒霊キーボーディスト",
		"騒霊キーボーディスト",
		"Lyrica",
#else
		"Lyrica",
		"Lyrica",
#endif
		{2, 3, 1, 5, 2, 3},
		30, 28, 30, 3, 24, 38, 50, 50,
		18, 15, 11, 1,  4, 15, 23, 20,
		3, 20, 50

		,{3,4,4,4,4,0,0,0,0,0,4,4,4,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,100,
		{3,3,3,4,4,0,0,0,0,0
		,5,4,4,4,4,4,4,4,4,4
		,3}
		,100,0,4,4,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_LYRICA
	},

	{
#ifdef JP
		"地獄の妖精",
		"地獄の妖精",
		"Clownpiece",
#else
		"Clownpiece",
		"Clownpiece",
#endif
		{10, 0, 10, 10, 10, 10},
		30, 30, 36, 1, 24, 38, 65, 50,
		18, 15, 15, 0,  4, 15, 30, 20,
		1, 0, 20

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,2,100,
		{2,1,1,1,2,0,0,0,0,0
		,3,3,2,4,4,3,3,4,1,1
		,1}
		,75,0,1,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_CLOWNPIECE
	},
	{
#ifdef JP
		"夢の支配者",
		"夢の支配者",
		"Doremy",
#else
		"Doremy",
		"Doremy",
#endif
		{ -2, 5, 6, 1, -1, 2},
		24, 32, 36, 5, 27, 40, 48, 40,
		15, 16, 13, 0,  2, 12, 18, 14,
		3, 50, 30

		,{1,4,4,4,5,0,0,0,0,4,4,4,4,0,0,4,0,0,0,0,0}
		,A_INT
		,4,3,100,
		{3,2,3,1,3,0,0,0,0,0
		,3,3,2,3,3,2,2,2,1,2
		,1}
		,45,2,3,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_DOREMY
	},
	{
#ifdef JP
		"古びた琵琶の付喪神",
		"古びた琵琶の付喪神",
		"Benben",
#else
		"Benben",
		"Benben",
#endif
		{ 1, 3, 2, -1, 0, 1},
		23, 28, 31, 2, 21, 32, 48, 36,
		12, 16, 12, 0,  2,  10, 20,  8,
		5, 20, 70

		,{1,5,4,4,4,3,3,3,4,4,5,5,4,0,0,4,0,0,0,0,0}
		,A_INT
		,4,3,90,
		{4,2,1,1,2,0,0,0,0,0
		,4,3,4,4,3,2,2,2,3,1
		,2}
		,67,3,4,3,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_BENBEN
	},

	{
#ifdef JP
		"古びた琴の付喪神",
		"古びた琴の付喪神",
		"Yatsuhashi",
#else
		"Yatsuhashi",
		"Yatsuhashi",
#endif
		{ 0, 4, 2, 0, -1, 1},
		28, 32, 31, 4, 24, 32, 42, 36,
		15, 15, 12, 0,  3,  10, 14,  8,
		2, 20, 70

		,{3,5,5,5,5,4,4,3,4,4,5,5,5,0,0,4,0,0,0,0,0}
		,A_INT
		,3,2,90,
		{2,1,1,1,2,0,0,0,0,0
		,4,2,3,2,2,2,1,1,1,1
		,2}
		,67,3,4,4,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_YATSUHASHI
	},

	{
#ifdef JP
		"秘神流し雛",
		"秘神流し雛",
		"Hina",
#else
		"Hina",
		"Hina",
#endif
		{-1, 1, 3, -2, 2, -16},
		24, 24, 36, 6, 23, 10, 47, 20,
		16, 12, 16, 0, 3,  5, 18, 10,
		5, 80, 100

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,2,70,
		{3,1,1,1,1,0,0,0,0,0
		,3,2,2,3,2,2,2,4,1,1
		,1}
		,125,0,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_HINA
	},
	{
#ifdef JP
		"紅魔館のメイド",
		"紅魔館のメイド",
		"Sakuya",
#else
		"Sakuya",
		"Sakuya",
#endif
		{ 0, 4, 2, 3, 2, 3},
		45, 25, 30, 5, 28, 40, 55, 64,
		16, 14, 11, 0,  6, 12, 24, 24,
		4, 75, 30

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,2,70,
		{4,1,1,5,5,0,0,0,0,0
		,5,4,3,2,2,2,2,2,2,2
		,2}
		,38,1,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_SAKUYA
	},
	{
#ifdef JP
		"光の三妖精",
		"光の三妖精",
		"Three-fairies",
#else
		"Three-fairies",
		"Three-fairies",
#endif
		{ 3, 2, 1, 0, 2, 3},
		25, 24, 31, 2, 25, 24, 50, 45,
		9,  11, 10, 1,  5,  8, 20, 18,
		6, 90, 60

		,{1,2,2,0,0,0,2,0,2,0,2,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,4,100,
		{3,2,2,1,2,0,0,0,0,0
		,3,3,2,3,3,3,3,3,2,2
		,1}
		,50,1,2,3,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_3FAIRIES
	},
	{
#ifdef JP
		"夢幻のパーカッショニスト",
		"夢幻のパーカッショニスト",
		"Raiko",
#else
		"Raiko",
		"Raiko",
#endif
		{4, 4, 2, 3, 3, 2},
		35, 36, 32, 2, 30, 30, 55, 40,
		14, 13, 12, 0,  3, 12, 27, 18,
		8, 40, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{4,1,1,5,3,0,0,0,0,0
		,4,3,3,5,5,4,3,4,2,2
		,3}
		,24,3,4,4,
		FALSE,FALSE,TRUE
		,TRUE
		,4
		,MON_RAIKO
	},


	{
#ifdef JP
		"化け狸十変化",
		"化け狸十変化",
		"Mamizou",
#else
		"Mamizou",
		"Mamizou",
#endif
		{ 2, 4, 4, 2, 3, 3},
		36, 35, 32, 5, 32, 25, 55, 48,
		15, 14, 12, 0,  4, 10, 21, 21,
		6, 100, 20

		,{1,0,0,0,0,0,0,0,0,5,5,5,5,0,0,5,0,0,0,0,0}
		,A_INT
		,5,2,80,
		{4,3,4,2,4,0,0,0,0,0
		,3,3,4,4,3,3,3,3,3,2
		,2}
		,30,0,4,5,
		TRUE,FALSE,TRUE
		,TRUE
		,5
		,MON_MAMIZOU
	},
	{
#ifdef JP
		"神隠しの主犯",
		"神隠しの主犯",
		"Yukari",
#else
		"Yukari",
		"Yukari",
#endif
		{ 0, 4, 4, 1, 2, 3},
		27, 38, 36, 5, 30, 27, 50, 45,
		16, 16, 14, 1,  4, 18, 18, 15,
		7, 80, 30

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,80,
		{4,3,2,2,4,0,0,0,0,0
		,3,3,3,4,4,3,3,4,3,3
		,3}
		,14,3,4,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_YUKARI
	},
	{
#ifdef JP
		"橘色のイーグルラヴィ",
		"橘色のイーグルラヴィ",
		"Ringo",
#else
		"Ringo",
		"Ringo",
#endif
		{ -1, 4, 2, -1, -1, 1},
		48, 27, 30, 4, 32, 28, 50, 50,
		20, 12, 10, 0,  5, 10, 22, 22,
		3, 10, 40

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,3,70,
		{4,2,2,2,3,0,0,0,0,0
		,4,3,3,3,3,2,3,3,2,3
		,4}
		,75,0,4,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_RINGO
	},
	{
#ifdef JP
		"浅葱色のイーグルラヴィ",
		"浅葱色のイーグルラヴィ",
		"Seiran",
#else
		"Seiran",
		"Seiran",
#endif
		{ 1, 0, -1, 2, 1, -1},
		40, 20, 28, 3, 28, 28, 48, 60,
		15, 10, 10, 0,  3, 12, 20, 27,
		4, 25, 75

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,4,70,
		{3,2,1,1,3,0,0,0,0,0
		,3,3,2,4,3,3,2,3,2,4
		,5}
		,110,0,4,2,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_SEIRAN
	},
	{
#ifdef JP
		"月の頭脳",
		"月の頭脳",
		"Eirin",
#else
		"Eirin",
		"Eirin",
#endif
		{3, 9, 8, 4, 5, 4},
		45, 48, 45, 5, 40, 35, 60, 85,
		16, 20, 16, 0,  5, 12, 24, 30,
		7, 60, 15
		,{2,5,5,5,5,5,5,5,5,5,5,5,5,0,5,0,0,0,0,0,0}
		,A_INT
		,5,4,80,
		{3,4,4,4,4,0,0,0,0,0
		,4,4,4,4,4,4,4,4,5,4
		,4}
		,50,2,5,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_EIRIN
	},
	{
#ifdef JP
		"永遠と須臾の罪人",
		"永遠と須臾の罪人",
		"Kaguya",
#else
		"Kaguya",
		"Kaguya",
#endif
		{2, 2, 3, -2, 0, 9},
		24, 40, 36, 2, 27, 20, 45, 45,
		8, 20, 12, 0,  2, 6, 16, 16,
		5, 100, 30
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,1,100,
		{1,2,2,2,4,0,0,0,0,0
		,2,2,2,3,3,2,3,3,3,2
		,2}
		,100,1,4,5,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_KAGUYA
	},
	{
#ifdef JP
		"舌禍をもたらす女神",
		"舌禍をもたらす女神",
		"Sagume",
#else
		"Sagume",
		"Sagume",
#endif
		{ 0, 3, 2, -2, -1, 2},
		23, 48, 30, 5, 27, 30, 16, 45,
		13, 18, 12, 0,  4, 12, 8, 18,
		0, 30, 20

		//追加値暫定
		,{1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,0,0}
		,A_INT
		,3,1,100,
		{1,3,1,1,3,0,0,0,0,0
		,1,1,1,1,1,1,1,1,2,2
		,3}
		,50,1,4,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_SAGUME
	},
	///v1.1.12
	{
//二つ名あったっけ？
#ifdef JP
		"月の防衛隊員",
		"月の防衛隊員",
		"Reisen2",
#else
		"Reisen2",
		"Reisen2",
#endif
		{0, 1, -1, 2, 0, -1},
		22, 20, 27, 3, 24, 30, 45, 50,
		11, 10, 10, 0,  2, 10, 16, 21,
		4, 20, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,2,80,
		{2,2,1,2,3,0,0,0,0,0
		,3,2,2,4,3,3,3,2,2,3
		,4}
		,142,0,2,2,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_REISEN2
	},
	///v1.1.13
	{
#ifdef JP
		"海と山を繋ぐ月の姫",
		"海と山を繋ぐ月の姫",
		"Toyohime",
#else
		"Toyohime",
		"Toyohime",
#endif
		{ 0, 4, 3, 0, 1, 3},
		28, 40, 32, 5,  32, 30, 45, 45,
		10, 18, 11, 0,   4, 10, 16, 18,
		4, 70, 3

		,{3,4,4,4,4,4,4,4,4,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,1,70,
		{2,2,1,1,3,0,0,0,0,0
		,2,2,2,2,2,2,2,2,2,2
		,2}
		,16,0,3,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_TOYOHIME
	},
	//v1.1.14
	{
#ifdef JP
		"神霊の依り憑く月の姫",
		"神霊の依り憑く月の姫",
		"Yorihime",
#else
		"Yorihime",
		"Yorihime",
#endif
		{ 2, 4, 2, 2, 2, 1},
		33, 36, 33, 3,  30, 30, 80, 45,
		11, 15, 12, 0,   3, 10, 27, 18,
		7, 70, 30

		,{1,0,0,0,0,4,4,5,4,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,6,2,70,
		{4,3,3,3,3,0,0,0,0,0
		,4,4,5,3,3,3,3,3,3,3
		,4}
		,16,0,5,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_YORIHIME
	},
	//v1.1.15
	{
#ifdef JP
		"(無名の存在)",
		"(無名の存在)",
		"Junko",
#else
		"Junko",
		"Junko",
#endif
		{ 2, 6, 9, 1, 4, 2},
		80, 32, 60, 2, 15, 30, 45, 45,
		30, 16, 20, 0,  2, 12, 24, 24,
		7, 120, 20

		//追加値暫定
		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,3,100,
		{3,1,1,3,2,0,0,0,0,0
		,3,3,3,3,3,3,3,3,2,2
		,1}
		,18,1,4,4,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_JUNKO
	},
	{
#ifdef JP
		"地獄の女神",
		"地獄の女神",
		"Hecatia",
#else
		"Hecatia",
		"Hecatia",
#endif
		{ 1, 9, 9, 2, 3, 4},
		30, 50, 50, 3, 27, 24, 48, 50,
		23, 20, 18, 0,  5, 12, 23, 23,
		7, 120, 20

		//追加値暫定
		,{2,5,5,5,5,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0}
		,A_INT
		,5,2,100,
		{3,3,3,3,3,0,0,0,0,0
		,3,3,2,4,4,2,2,2,3,3
		,1}
		,6,3,4,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_HECATIA1
	},
	///v1.1.33
	{
#ifdef JP
		"浮世の関を超える山姥",
		"浮世の関を超える山姥",
		"Nemuno",
#else
		"Nemuno",
		"Nemuno",
#endif
		{0, 2, 2, 1, 0, 1},
		20, 20, 27, 2, 28, 26, 50, 48,
		10, 11, 10, 0,  4, 10, 16, 18,
		3, 30, 40

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,4,4,80,
		{3,2,1,2,3,0,0,0,0,0
		,4,3,4,4,4,5,2,2,2,2
		,1}
		,80,0,4,4,
		FALSE,TRUE,TRUE
		,FALSE
		,3
		,MON_NEMUNO
	},
	//v1.1.33
	{
#ifdef JP
		"神仏に心酔する守護神獣",
		"神仏に心酔する守護神獣",
		"Aunn",
#else
		"Aunn",
		"Aunn",
#endif
		{1, 2, 4, -1, 1, 2},
		18, 22, 36, 5, 32, 26, 55, 45,
		10, 12, 12, 0,  5, 10, 22, 16,
		6, 35, 60

		,{1,0,0,0,0,2,2,2,2,0,0,0,0,0,0,2,0,0,0,0,0}
		,A_INT
		,4,3,80,
		{4,3,1,2,3,0,0,0,0,0
		,3,2,2,3,3,2,2,2,2,2
		,1}
		,80,0,2,3,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_AUNN
	},

	//v1.1.34
	{
#ifdef JP
		"森で垂迹した魔法地蔵",
		"森で垂迹した魔法地蔵",
		"Narumi",
#else
		"Narumi",
		"Narumi",
#endif
		{ -2, 2, 3, -1, 0, 1},
		21, 27, 32, 1, 26, 25, 36, 30,
		10, 12, 15, 0,  3,  7, 12, 10,
		2, 50, 40

		,{3,5,5,5,5,5,6,5,5,0,0,0,0,0,0,5,0,0,0,0,0}
		,A_INT
		,3,2,100,
		{1,2,1,1,1,0,0,0,0,0
		,1,1,2,3,4,1,1,1,1,1
		,1}
		,80,3,4,5,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_NARUMI
	},
	//小鈴
	{
#ifdef JP
		"判読眼のビブロフィリア",
		"判読眼のビブロフィリア",
		"Kosuzu",
#else
		"Kosuzu",
		"Kosuzu",
#endif
		{ -2, 1, 0, 0, -1, 2},
		16, 10, 20, 3, 27, 20, 30, 24,
		 5, 16, 10, 0,  4,  7, 15, 12,
		2, 20, 50

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,1,100,
		{1,2,1,1,1,0,0,0,0,0
		,2,1,1,2,3,1,1,2,1,1
		,1}
		,200,3,1,4,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_KOSUZU
	},
	{
#ifdef JP
		"神に近づく蝶の妖精",
		"神に近づく蝶の妖精",
		"Eternitylarva",
#else
		"Eternitylarva",
		"Eternitylarva",
#endif
		{ -2, -2, -1, -1, 0, 0 },
		12, 10, 20, 0, 15, 16, 20, 20,
		16, 14, 14, 1,  5, 12, 20, 20,
		2, -50, 60

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,3,1,100,
			{ 2,1,1,1,3,0,0,0,0,0
			,3,2,2,2,2,2,2,2,2,2
			,1 }
			,135,0,1,2,
			FALSE,FALSE,TRUE
			,TRUE
			,2
			,MON_LARVA
	},

	{
#ifdef JP
		"危険すぎるバックダンサー",
		"危険すぎるバックダンサー",
		"Mai",
#else
		"Mai",
		"Mai",
#endif
		{ 1, 0, 0, 0, 1, 1 },
		23, 27, 30, 1, 25, 40, 50, 45,
		15, 12, 12, 0,  3, 12, 25, 15,
		3, 55, 25

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,4,2,100,
			{ 2,2,1,1,1,0,0,0,0,0
			,2,2,2,2,4,2,5,4,1,1
			,1 }
			,70,2,4,3,
			FALSE,FALSE,TRUE
			,FALSE
			,3
			,MON_MAI
	},
	{
#ifdef JP
		"危険すぎるバックダンサー",
		"危険すぎるバックダンサー",
		"Satono",
#else
		"Satono",
		"Satono",
#endif
		{ 0, 1, 1, 0, 0, 1 },
		23, 40, 30, 4, 25, 40, 45, 45,
		15, 12, 12, 0,  3, 12, 15, 15,
		3, 55, 25

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,3,2,100,
			{ 2,2,1,1,1,0,0,0,0,0
			,3,2,2,2,2,3,2,3,1,1
			,1 }
			,70,2,4,3,
			FALSE,FALSE,TRUE
			,FALSE
			,4
			,MON_SATONO
	},
	{
#ifdef JP
		"狂気なる地獄の妖精",
		"狂気なる地獄の妖精",
		"VFS_Clownpiece",
#else
		"VFS-Clownpiece",
		"VFS-Clownpiece",
#endif
		{ 4, 1, 1, 4, 4, 1},
		16, 20, 32, 3, 20, 32, 45, 40,
		10, 12, 12, 0,  2, 10, 20, 16,
		5, 0, 70

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,4,2,100,
			{ 2,1,1,1,2,0,0,0,0,0
			,3,3,2,4,4,3,3,4,1,1
			,1 }
			,75,0,1,3,
			FALSE,FALSE,TRUE
			,TRUE
			,3
			,MON_CLOWNPIECE
	},

	{
#ifdef JP
		"最凶最悪の双子の妹",
		"最凶最悪の双子の妹",
		"Jyoon",
#else
		"Jyoon",
		"Jyoon",
#endif
		{ 3, 2, -1, 2, 2, -4 },
		32, 27, 40, 3, 32, 40, 60, 45,
		12, 12, 15, 0,  5, 14, 25, 18,
		6, 45, 40

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,4,2,70,
			{ 5,1,1,1,4,0,0,0,0,0
			,2,2,2,3,2,2,2,2,2,2
			,2 }
			,35,0,4,4,
			FALSE,FALSE,TRUE
			,FALSE
			,3
			,MON_JYOON
	},
	{
#ifdef JP
		"最凶最悪の双子の姉",
		"最凶最悪の双子の姉",
		"Shion",
#else
		"Shion",
		"Shion",
#endif
		{ 0, 0, 0, 0, 0, -9 },
		10, 22, 44, 1, 10, 20, 45, 45,
		10, 10, 18, 1,  1, 10, 15, 15,
		2, 80, 90

		,{ 1,0,3,0,0,3,0,0,0,3,3,3,3,0,0,0,0,0,0,0,0 }
			,A_INT
			,3,1,70,
			{ 3,2,1,1,3,0,0,0,0,0
			,2,2,2,2,2,2,2,2,2,2
			,2 }
			,160,0,4,4,
			FALSE,FALSE,TRUE
			,FALSE
			,5
			,MON_SHION_1
	},
	{
#ifdef JP
		"究極の絶対秘神",
		"究極の絶対秘神",
		"Okina",
#else
		"Okina",
		"Okina",
#endif
		{ 1, 8, 8, 4, 3, 5 },
		45, 45, 35, 5, 47, 35, 40, 45,
		27, 18, 14, 1,  6, 20, 20, 20,
		8, 125, 25

			,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,4,2,80,
			{ 2,2,2,2,2,0,0,0,0,0
			,2,2,2,2,2,2,2,2,2,2
			,2 }
			,12,4,5,5,
			TRUE,FALSE,TRUE
			,FALSE
			,5
			,MON_OKINA
	},

	{
#ifdef JP
		"河原のアイドル水子",
		"河原のアイドル水子",
		"Eika",
#else
		"Eika",
		"Eika",
#endif
		{ -1, 0, 2, 2, -2, 2 },
		42, 20, 30, 3, 27, 25, 25, 45,
		24, 12,  8, 0,  4, 16, 15, 24,
		2, 10, 30

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
				,A_INT
				,3,1,100,
				{ 1,2,1,1,4,0,0,0,0,0
				,2,1,1,2,1,1,1,1,2,2
				,2 }
				,260,4,1,3,
				FALSE,FALSE,TRUE
				,TRUE
				,3
				,MON_EIKA
	},
	{
#ifdef JP
		"古代魚の子連れ番人",
		"古代魚の子連れ番人",
		"Urumi",
#else
		"Urumi",
		"Urumi",
#endif
		{ 3, 1, 1, 1, 2, 1 },
		25, 25, 24, 2, 25, 25, 55, 40,
		10, 12, 11, 0,  1, 12, 24, 16,
		6, 25, 40

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
				,A_INT
				,5,6,70,
				{ 4,2,2,2,3,0,0,0,0,0
				,3,2,3,4,3,4,3,4,2,2
				,1 }
				,75,0,4,2,
				FALSE,FALSE,TRUE
				,TRUE
				,3
				,MON_URUMI
	},
	{
#ifdef JP
		"地獄関所の番頭神",
		"地獄関所の番頭神",
		"Kutaka",
#else
		"Kutaka",
		"Kutaka",
#endif
		{ 0, 4, 4, 2, 2, 4 },
		32, 36, 30, 2, 32, 35, 45, 35,
		12, 12, 15, 0,  6, 20, 23, 14,
		3, 55, 50

		,{ 1,0,5,0,0,5,5,5,5,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,4,2,60,
			{ 2,2,1,2,2,0,0,0,0,0
			,4,3,3,2,2,2,2,2,2,1
			,1 }
			,55,4,3,4,
			FALSE,FALSE,TRUE
			,FALSE
			,4
			,MON_KUTAKA
	},
	{
#ifdef JP
		"鬼傑組組長",
		"鬼傑組組長",
		"Yachie",
#else
		"Yachie",
		"Yachie",
#endif
		{ -1, 6, 4, -3, 1, 3 },
		30, 30, 30, 3, 30, 25, 60, 32,
		16, 15, 12, 0,  4, 10, 16, 16,
		4, 40, 25

		,{ 1,0,0,0,0,0,0,0,0,5,5,5,5,0,0,5,0,0,0,0,0 }
			,A_INT
			,4,2,80,
			{ 4,3,2,2,3,0,0,0,0,0
			,3,2,2,3,3,3,2,2,2,2
			,2 }
			,50,3,3,4,
			FALSE,FALSE,TRUE
			,FALSE
			,4
			,MON_YACHIE
	},
	{
#ifdef JP
		"埴輪兵長",
		"埴輪兵長",
		"Mayumi",
#else
		"Mayumi",
		"Mayumi",
#endif
		{ 3, 3, 4, 2, 3, 4 },
		32, 24, 50, 3, 30, 30, 70, 55,
		12, 12, 20, 0,  3, 16, 30, 30,
		8, 40, 20

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,6,2,80,
			{ 4,4,5,4,4,0,0,0,0,0
			,4,5,5,5,4,4,5,4,5,4
			,2 }
			,60,4,5,3,
			FALSE,FALSE,TRUE
			,FALSE
			,3
			,MON_MAYUMI
	},
	{
#ifdef JP
		"孤立無援が誂えた造形神",
		"孤立無援が誂えた造形神",
		"Keiki",
#else
		"Keiki",
		"Keiki",
#endif
		{ 2, 5, 5, 7, 2, 5 },
		50, 50, 45, 3, 30, 30, 60, 48,
		30, 20, 15, 0,  3, 20, 25, 24,
		6, 80, 25

		,{ 1,5,5,5,5,5,5,5,5,0,0,0,5,0,0,0,0,0,0,0,0 }
			,A_INT
			,5,3,80,
			{3,3,3,5,4,0,0,0,0,0
			,5,4,4,3,3,3,4,4,2,2
			,2 }
			,16,3,5,5,
			TRUE,FALSE,TRUE
			,FALSE
			,4
			,MON_KEIKI
	},
	{
#ifdef JP
		"勁牙組組長",
		"勁牙組組長",
		"Saki",
#else
		"Saki",
		"Saki",
#endif
		{ 6, -2, 3, 6, 4, 4 },
		25, 24, 30, 3, 20, 35, 80, 50,
		 8, 12, 12, 0,  1, 20, 32, 25,
		12, 40, 30

		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,5,2,80,
			{ 5,2,5,1,3,0,0,0,0,0
			,4,4,3,3,3,3,4,4,3,4
			,5 }
			,20,4,5,3,
			FALSE,FALSE,TRUE
			,FALSE
			,4
			,MON_SAKI
	},

	//v1.1.78
	{
#ifdef JP
		"鯢呑亭の看板娘",
		"鯢呑亭の看板娘",
		"Miyoi",
#else
		"Miyoi",
		"Miyoi",
#endif
		{ 1, 0, 0, 1, 1, 1 },
		30, 30, 32, 4, 16, 20, 45, 30,
		15, 12, 11, 0,  4,  5, 15, 15,
		2, 20, 90

		//追加値暫定
		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
		,A_INT
		,3,2,90,
		{2,2,1,1,2,0,0,0,0,0
		,4,2,1,2,2,2,1,1,1,1
		,1 }
		,150,0,2,2,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_MIYOI
	},

	//v1.1.86
	{
#ifdef JP
		"商売繁盛の縁起物",
		"商売繁盛の縁起物",
		"Mike",
#else
		"Mike",
		"Mike",
#endif
		{ -1, 3, 0, 1, -1, 2 },
		28, 30, 36, 2, 27, 16, 48,40,
		12, 10, 12, 0,  3,  3, 16,15,
		3, 30, 75

		//追加値暫定
		,{ 1,2,2,2,2,2,2,2,2,2,2,2,2,0,0,2,0,0,0,0,0 }
		,A_INT
		,4,2,80,
		{3,2,1,1,3,0,0,0,0,0
		,3,2,2,4,2,2,2,2,2,2
		,1 }
		,140,2,3,4,
		FALSE,FALSE,TRUE
		,TRUE
		,3
		,MON_MIKE
	},
	{
#ifdef JP
		"山奥のビジネス妖怪",
		"山奥のビジネス妖怪",
		"Takane",
#else
		"Takane",
		"Takane",
#endif
		{ -2, 4, 1, 1, -2, 4 },
		27, 40, 28, 2, 30, 20, 45, 40,
		10, 15,  9, 0,  4,  5, 15, 12,
		1, 20, 45

		//追加値暫定
		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
		,A_INT
		,4,2,70,
		{2,3,1,1,3,0,0,0,0,0
		,3,3,3,2,2,2,2,2,2,2
		,2 }
		,80,0,3,4,
		FALSE,FALSE,TRUE
		,FALSE
		,2
		,MON_TAKANE
	},
	{
#ifdef JP
		"高地に棲む山女郎",
		"高地に棲む山女郎",
		"Sannyo",
#else
		"Sannyo",
		"Sannyo",
#endif
		{ 0, 3, 3, 2, 0, 4 },
		25, 36, 35, 3, 25, 20, 60, 50,
		16, 12, 10, 0,  3,  5, 24, 18,
		4, 20, 70

		//追加値暫定
			,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
			,A_INT
			,5,3,80,
			{3,3,2,3,3,0,0,0,0,0
			,4,3,4,4,4,4,3,3,2,2,2 }
			,58,0,3,3,
			FALSE,FALSE,TRUE
			,FALSE
			,3
			,MON_SANNYO
	},

	{
#ifdef JP
		"本物の勾玉制作職人",
		"本物の勾玉制作職人",
		"Misumaru",
#else
		"Misumaru",
		"Misumaru",
#endif
		{ -2, 5, 4, 3, -2, 4 },
		32, 45, 40, 3, 35, 20, 32, 32,
		10, 18, 14, 0,  6,  5, 10, 10,
		2, 75, 70

		//追加値暫定
				,{ 1,5,5,5,5,5,5,5,5,0,0,0,0,0,0,5,5,0,0,0,0 }
				,A_INT
				,3,1,80,
				{ 1,1,1,1,3,0,0,0,0,0
				,3,1,1,2,2,1,1,1,1,1
				,1 }
				,40,2,2,5,
				FALSE,FALSE,TRUE
				,FALSE
				,4
				,MON_MISUMARU
	},

	{
#ifdef JP
		"耳元で囁く邪悪な白狐",
		"耳元で囁く邪悪な白狐",
		"Tsukasa",
#else
		"Tsukasa",
		"Tsukasa",
#endif
		{ -3, 2, 1, 0, -2, 2 },
		20, 30, 35, 4, 16, 20, 35, 40,
		12, 12, 12, 0,  3,  5, 12, 15,
		2, 30, 40

		//追加値暫定
		,{ 1,5,5,5,5,0,0,0,0,4,5,5,5,0,0,5,0,0,0,0,0 }
		,A_INT
		,3,2,100,

		{ 2,2,1,1,2,0,0,0,0,0
		,3,2,2,2,2,2,2,2,2,2
		,1 }
		,80,1,2,4,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_TSUKASA
	},
	{
#ifdef JP
		"鴉天狗の大将",
		"鴉天狗の大将",
		"Megumu",
#else
		"Megumu",
		"Megumu",
#endif
		{ 1, 3, 4, 1, 1, 3 },
		25, 30, 32, 2, 30, 30, 60, 45,
		16, 15, 12, 0,  4, 15, 23, 20,
		4, 110, 30

		//追加値暫定
		,{ 1,5,5,5,5,5,5,5,5,5,5,5,5,0,0,5,0,0,0,0,0 }
		,A_INT
		,5,2,90,
		{3,3,3,3,3,0,0,0,0,0
		,4,5,5,3,4,3,3,3,3,3
		,2 }
		,46,3,4,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_MEGUMU
	},

	{
#ifdef JP
		"無主物の神",
		"無主物の神",
		"Chimata",
#else
		"Chimata",
		"Chimata",
#endif
		{ -2, 2, 2, 0, -2, 2 },//流通ランクによって全+4
		40, 20, 18, 16, 16, 20, 40, 40,
		24, 18, 15,  0,  8, 10, 12, 12,
		0, 90, 70
		//追加値暫定
		,{ 1,4,3,4,3,4,3,3,3,3,3,3,4,0,0,3,0,0,0,0,0 }
		,A_INT
		,3,1,100,
		{ 1,2,1,1,2,0,0,0,0,0
		,2,2,2,2,2,2,2,2,2,2
		,2 }
		,20,1,5,5,
		FALSE,FALSE,TRUE
		,FALSE
		,3
		,MON_CHIMATA
	},
	{
#ifdef JP
		"黒きドラゴンイーター",
		"黒きドラゴンイーター",
		"Momoyo",
#else
		"Momoyo",
		"Momoyo",
#endif
		{ 5, -2, 2, 3, 5, -5 },
		23, 24, 40, 2, 24, 25, 90, 50,
		12, 12, 15, 0,  4, 15, 36, 20,
		12, 80, 40

		//追加値暫定
		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
		,A_INT
		,6,5,60,
		{ 5,3,1,5,3,0,0,0,0,0
		,5,4,4,4,4,5,4,4,2,2
		,1 }
		,25,5,5,3,
		FALSE,FALSE,TRUE
		,FALSE
		,5
		,MON_MOMOYO
	},

	{
#ifdef JP
		"無敗の剛欲同盟長",
		"無敗の剛欲同盟長",
		"Yuma",
#else
		"Yuuma",
		"Yuuma",
#endif // JP
		{ 2, 4, 3, 1, 7, -3 },
		20, 32, 60, 4, 30, 25, 65, 40,
		13, 12, 20, 0,  5, 15, 27, 18,
		14, 125, 50

		//追加値暫定
		,{ 1,4,4,0,0,4,0,0,4,4,4,4,4,0,0,4,0,0,0,0,0 }
		,A_INT
		,5,4,80,
		{ 3,3,2,2,3,0,0,0,0,0
		,3,3,3,4,4,5,4,5,2,2
		,2 }
		,14,0,5,5,
		FALSE,FALSE,TRUE
		,FALSE
		,4
		,MON_YUMA
	},

	{
#ifdef JP
		"小さな聖域の大聖",
		"小さな聖域の大聖",
		"Biten",
#else
        "Biten",
        "Biten",
#endif
		{ 2, 3, 2, 0, 1, 2 },
		32, 24, 32, 3, 22, 20, 60, 60,
		12, 11, 10, 0,  2,  5, 20, 24,
		3, 40, 40

		//追加値暫定
		,{ 1,0,0,0,0,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0 }
		,A_INT
		,5,4,80,

			{ 3,2,2,1,4,0,0,0,0,0
			,2,2,2,3,5,3,3,4,2,2
			,1 }
			,55,4,2,2,
			FALSE,FALSE,TRUE
			,FALSE
			,3
			,MON_BITEN
	},
	{
#ifdef JP
		"森閑のケルベロス",
		"森閑のケルベロス",
		"Enoko",
#else
        "Enoko",
        "Enoko",
#endif
		{ 1, -2, -2, 2, 4, 0 },
		45, 30, 30, 4, 16, 20, 55, 24,
		18, 12, 10, 0,  2,  5, 18,  8,
		8, 30, 40

		//追加値暫定
		,{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }
		,A_INT
		,3,2,100,

		{ 4,1,1,1,1,0,0,0,0,0
			,3,2,2,2,2,2,2,1,1,1
			,1 }
			,80,1,3,2,
			FALSE,FALSE,TRUE
			,FALSE
			,3
			,MON_ENOKO
	},
	{
#ifdef JP
		"穢れた有機物の怪物",
		"穢れた有機物の怪物",
		"Chiyari",
#else
        "Chiyari",
        "Chiyari",
#endif

		{ -1, 4, 4, 2, 1, -2 },
		32, 35, 30, 4, 27, 30, 50, 55,
		12, 10, 10, 0,  4, 12, 18, 23,
		5, 45, 60

		,{ 1,4,4,4,4,0,0,0,0,5,5,5,5,0,0,5,0,0,0,0,0 }
			,A_INT
			,4,2,90,
			{ 3,2,2,2,3,0,0,0,0,0
			,4,3,2,2,2,2,4,3,3,3
			,1 }
			,50,3,3,4,
			FALSE,FALSE,TRUE
			,FALSE
			,4
			,MON_CHIYARI

	},
	{
#ifdef JP
		"地獄の美しきストーカー",
		"地獄の美しきストーカー",
		"Hisami",
#else
        "Hisami",
        "Hisami",
#endif
		{ -2, 3, 2, -2, 1, 4 },
		36, 40, 35, 4, 35, 20, 35, 27,
		18, 15, 12, 0,  5,  7, 10,  8,
		4, 50, 60

		,{ 3,5,5,5,5,4,0,4,4,5,5,5,5,0,0,5,0,0,0,0,0 }
			,A_INT
			,3,2,100,
			{ 1,1,1,1,2,0,0,0,0,0
			,2,1,1,2,2,2,1,1,1,1
			,1 }
			,60,3,3,4,
			TRUE,FALSE,TRUE
			,FALSE
			,4
			,MON_HISAMI
	},
	{
#ifdef JP
		"寂滅為楽の王",
		"寂滅為楽の王",
		"Zanmu",
#else
        "Zanmu",
        "Zanmu",
#endif

		{ -3, 11, 8, 1, -2, 6 },
		27, 45, 45, 3, 32, 30, 40, 60,
		20, 24, 15, 0,  7, 15, 18, 25,
		2, 80, 10

		//追加値暫定
		,{ 3,5,6,5,5,6,5,5,5,5,5,6,5,0,0,5,0,0,0,0,0 }
		,A_INT
		,4,2,70,
		{ 2,3,2,2,4,0,0,0,0,0
		,2,2,4,3,4,2,4,3,3,3
		,2 }
		,20,5,5,5,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_ZANMU

	},

	{
#ifdef JP
		"大結界の犠牲者",
		"大結界の犠牲者",
		"Mizuchi",
#else
        "Mizuchi",
        "Mizuchi",
#endif
		{ 5, 3, 5, 3, 5, -5 },
		24, 45, 50, 5, 20, 30, 65, 55,
		16, 16, 18, 2,  3,  5, 24, 18,
		6, 30, 30

		//追加値暫定
		,{ 3,0,0,0,0,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0 }
		,A_INT
		,5,3,80,

		{ 4,2,1,2,3,0,0,0,0,0
		,4,3,4,4,5,3,3,3,2,2
		,1 }
		,40,5,4,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_MIZUCHI
	},

	{
#ifdef JP
		"養蜂家",
		"養蜂家",
		"Beekeeper",
#else
        "Beekeeper",
        "Beekeeper",
#endif
		{ 0, 2, -1, 1, 0, 1 },
		30, 36, 30, 3, 24, 24, 48, 40,
		10, 12, 10, 0,  3,  4, 18, 12,
		3, 30, 40

		//追加値暫定
		,{ 1,4,4,4,4,4,4,4,4,4,4,4,4,0,0,4,0,0,0,0,0}
		,A_INT
		,4,2,90,
		{ 2,2,2,2,3,0,0,0,0,0
		,4,2,2,2,3,4,2,2,2,2
		,1 }
		,85,3,3,3,
		FALSE,FALSE,FALSE
		,TRUE
		,3
		,0 //not unique;
	},

	{
#ifdef JP
		"霧の中で見つかる妖精",
		"霧の中で見つかる妖精",
		"Daiyousei",
#else
        "Greater-Fairy",
        "Greater-Fairy",
#endif
		{ -1, 3, 1, -1, 0, 1 },
		24, 24, 30, 5, 20, 24, 40, 35,
		12, 10, 10, 0,  3,  8, 10, 10,
		3, 0, 50

		,{ 1,2,2,2,2,2,2,2,2,2,2,2,2,0,0,2,0,0,0,0,0 }
		,A_INT
		,3,2,100,
		{ 2,1,1,1,3,0,0,0,0,0
		,2,2,1,2,2,1,1,1,1,1
		,1 }
		,140,2,1,3,
		FALSE,FALSE,TRUE
		,TRUE
		,3
		,0 //ユニークだが対応ユニークモンスターなし
	},


	{
#ifdef JP
		"聖域に棲む山姥の長",
		"聖域に棲む山姥の長",
		"Ubame",
#else
		"Ubame",
		"Ubame",
#endif
		{2, 3, 3, 1, 2, 4},
		32, 24, 34, 2, 30, 26, 50, 44,
		16, 12, 13, 0,  3, 10, 18, 15,
		5, 70, 30

		,{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,5,5,100,
		{4,2,2,2,2,0,0,0,0,0
		,3,2,2,4,3,4,2,2,2,2
		,1}
		,90,0,3,3,
		FALSE,TRUE,TRUE
		,FALSE
		,3
		,MON_UBAME

	},

		{
#ifdef JP
		"正体不明の順わぬ妖獣",
		"正体不明の順わぬ妖獣",
		"Chimi",
#else
        "Chimi",
        "Chimi",
#endif
		{ -3, 2, 2, 0, -2, -2},
		12, 20, 35, 4, 16, 20, 40, 20,
		 6,  8, 12, 1,  4,  5, 14, 10,
		2,  0, 90

		//追加値暫定
		,{1,5,5,0,0,5,0,0,5,5,5,5,5,0,0,0,0,0,0,0}
		,A_INT
		,3,2,90,
		{3,1,1,2,2,0,0,0,0,0
		,2,1,1,2,2,2,1,1,1,1
		,1}
		,140,1,1,4,
		TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_CHIMI

		},
	{
#ifdef JP
		"逼塞した聖地の道祖神",
		"逼塞した聖地の道祖神",
		"Nareko",
#else
		"Nareko",
		"Nareko",
#endif
		{ 1, 4, 3, 1, 1, 2 },
		40, 36, 32, 2, 30, 20, 45, 33,
		15, 15, 11, 0,  3,  5, 18, 12,
		3, 45, 50

		//追加値暫定
		,{ 1,5,5,5,5,0,0,0,0,0,5,5,0,0,0,0,0,0,0 }
		,A_INT
		,4,2,90,
		{ 2,3,1,4,3,0,0,0,0,0
		,3,2,2,4,3,3,3,2,2,2
		,1 }
		,70,3,3,3,
		TRUE,FALSE,TRUE
		,TRUE
		,4
		,MON_NAREKO
	},

	{
#ifdef JP
		"錦上の京の急所",
		"錦上の京の急所",
		"Yuiman",
#else
		"Yuiman",
		"Yuiman",
#endif
		{ 0, 6, 4, 3, 1, 3},
		40, 36, 48, 4, 30, 40, 36, 60,
		24, 15, 16, 0,  3, 16, 12, 24,
		3, 60, 40

		,{1,4,4,4,4,4,4,4,4,4,4,4,4,0,0,0}
		,A_INT
		,3,3,80,
		{2,2,4,2,5,0,0,0,0,0
		,4,2,2,2,2,3,2,2,5,4
		,4}
		,40,2,3,2,
		 TRUE,FALSE,TRUE
		,FALSE
		,4
		,MON_YUIMAN
	},

	{
#ifdef JP
		"恒久の姫",
		"恒久の姫",
		"Ariya",
#else
		"Ariya",
		"Ariya",
#endif
		{ 1, 8, 10, 1, 9, 2},
		24, 45, 80, 3, 24, 24, 40, 40,
		10, 12, 20 ,0,  2,  7, 15, 12,
		15, 300, 100

		,{3,5,5,5,5,5,5,5,5,0,0,0,0,0,0,0,0,0,0,0,0}
		,A_INT
		,3,3,80,
		{2,3,1,1,3,0,0,0,0,0
		,3,2,2,3,3,2,2,2,2,2
		,1}
		,7,0,3,4,
		TRUE,FALSE,TRUE
		,FALSE
		,5
		,MON_ARIYA
	},

	{
#ifdef JP
		"虚構の都市を創る怪",
		"虚構の都市を創る怪",
		"Nina",
#else
		"Nina",
		"Nina",
#endif

		{ -2, 6, 4, 0, 4, 3 },
		32, 45, 36, 4, 32, 30, 40, 45,
		12, 15, 15, 0,  5, 12, 15, 16,
		6, 33, 40

		,{ 1,5,5,5,5,5,5,5,5,5,5,5,5,0,0,5,0,0,0,0,0 }
			,A_INT
			,3,2,90,
			{ 2,4,1,2,2,0,0,0,0,0
			,3,2,2,2,2,2,2,2,2,2
			,2 }
			,25,3,3,4,
			TRUE,FALSE,TRUE
			,TRUE
			,4
			,MON_NINA

	},


};

///seikaku
const player_seikaku seikaku_info[MAX_SEIKAKU] =
{
	{
#ifdef JP
		"極めて普通",
		"極めて普通",
		"Ordinary",
#else
		"Ordinary",
		"Ordinary",
#endif
		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  0,  0,  0,  0,
		0, 1
		,FALSE
		,FALSE
	},

	{
#ifdef JP
		"力自慢の",
		"力自慢の",
		"Mighty",
#else
		"Mighty",
		"Mighty",
#endif
		{  2,  -2,  -1,  0,  1,  0 },
		-5,  -5,  -3,  -1,  -2,  -2,  10,  0,
		1, 0
		,FALSE
		,FALSE
	},

	{
#ifdef JP
		"切れ者の",
		"聡明な",
		"Shrewd",
#else
		"Shrewd",
		"Clever",
#endif
		{  -2,  2,  1,  0,  -1,  0 },
		3,  8,  2,  0,  3,  5,  -8,  -5,
		-1, 0
		,FALSE
		,FALSE
	},

	{
#ifdef JP
		"のんきな",
		"のんきな",
		"Easygoing",
#else
		"Easygoing",
		"Easygoing",
#endif
		{  0,  -1,  2,  -1,  1,  1 },
		-5,  2,  6,  -1,  0,  -2,  -3,  -6,
		0, 0
		,FALSE
		,FALSE
	},

	{
#ifdef JP
		"すばしっこい",
		"すばしっこい",
		"Nimble",
#else
		"Nimble",
		"Nimble",
#endif
		{  -1,  1,  -1,  2,  -1,  -1 },
		7,  2,  -1,  1,  5,  5,  0,  10,
		0, 0
		,FALSE
		,FALSE
	},

	{
#ifdef JP
		"命知らずな",
		"おてんば",
		"Fearless",
#else
		"Fearless",
		"Tomboy",
#endif
		{  2,  1,  1,  -1,  -1,  0 },
		-5,  5,  -2,  0,  2,  -2,  10,  10,
		-1, 0
		,FALSE
		,FALSE
	},

	{
#ifdef JP
		"トリガーハッピー",
		"トリガーハッピー",
		"Trigger-happy",
#else
		"Trigger-happy",
		"Trigger-happy",
#endif
		{  0,  4,  4,  2,  -4,  5 },
		-10,  10, -10,  -3,  -5,  10,  5, 50,
		-3, 0
		,FALSE
		,TRUE
	},

	{
#ifdef JP
		"ダンディな",
		"瀟洒な",
		"Dandy",
#else
		"Dandy",
		"Elegant",
#endif
		{ -1,  1,  0,  1,  -1,  3 },
		3,  3, 0, -1, 3, 3, -5, 5,
		0, 0
		,FALSE
		,FALSE
	},

	{
#ifdef JP
		"キャノンボーラー",
		"キャノンボーラー",
		"Cannonballer",
#else
		"Cannonballer",
		"Cannonballer",
#endif
		{  1,  1,  1,  1,  1,  3 },
		10,  5,  3,  0,  4,  2,  10,  10,
		0, 0
		,FALSE
		,TRUE
	},

	{
#ifdef JP
		"ラッキーマン",
		"ラッキーガール",
		"Lucky",
#else
		"Lucky",
		"Lucky",
#endif
		{  -2,  -2,  -2,  -2,  -2,  2 },
		10,  7,  3,  2, 10,  8,  15,  15,
		0, 1
		,FALSE
		,TRUE
	},

	{
#ifdef JP
		"がまんづよい",
		"がまんづよい",
		"Patient",
#else
		"Patient",
		"Patient",
#endif
		{  -1,  -1,  1,  -2,  2,  0 },
		-5,  -3,  3,  1,  0,  -3,  -6,  -6,
		1, 0
		,FALSE
		,FALSE
	},


	{
#ifdef JP
		"いかさま",
		"いかさま",
		"Munchkin",
#else
		"Munchkin",
		"Munchkin",
#endif
		{ 10,  10,  10,  10,  10,  10 },
		 20, 40, 30, 10, 40, 40,  80, 80,
		 15, 1
		,FALSE
		,TRUE
	},
	//v1.1.32 ここにはチルノの「日焼けした」などの特殊な性格を設定する。
	//p_ptr->pseikakuがSEIKAKU_SPECIAL(12)のとき、ap_ptrに対してseikaku_info[]でなくseikaku_info_special[]へのポインタが入る。
	{
#ifdef JP
		"[特殊性格]",
		"[特殊性格]",
		"Special",
#else
		"Special",
		"Special",
#endif
		{ 0, 0, 0, 0, 0, 0 },
		3, 3, -3, -1, 3, 0, 0, 0,
		0, 1
		,TRUE
		,TRUE
	},

	{
#ifdef JP
		"狂気の",
		"狂気の",
		"Berserk",
#else
		"Berserk",
		"Berserk",
#endif
		{ 5, -5, -5, 5, 5, -5 },
		-50, -50, -50, -10, -50, 10, 150, 0,
		10, 0
		,FALSE
		,TRUE
	},


};



/*:::魔法による一時的種族変容用種族テーブル*/
///mod140325 変数ダミー値を追加　巨大化追加
const player_race mimic_info[] =
{
	{
#ifdef JP
		"[標準形態]",
#endif
		"Default",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  0,  10,  0,  0,
		10,  100,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x000000, //←この数値はMIMIC_FLAGとして使われているらしい
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[悪魔]",
#endif
		"[Demon]",

		{  5,  3,  2,  3,  4,  -6 },
		-5,  18, 20, -2,  3,  10, 40, 20,
		//v1.1.32 HD12→15
		15,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		5,
		0x000003,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[魔王]",
#endif
		"[Demonlord]",

		{  20,  20,  20,  20,  20,  20 },
		20,  20, 25, -2,  3,  10, 70, 40,
		//v1.1.32 HD14→18
		18,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		20,
		0x000003,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[吸血鬼]",
#endif
		"[Vampire]",

		{ 4, 4, 1, 1, 2, 3 },
		6, 12, 8, 6, 2, 12, 30, 20,
		//v1.1.32 HD11→15
		15,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		5,
		0x000005,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[巨大化]",
#endif
		"[Giant]",

		{ 20, 0, 0, -5, 20, 0 },
		-30, 0, 20, -20, -10, -20, 70, 0,
		36,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x0004D8,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[獣変化]",
#endif
		"[Beast]",

		{ 10, -10, -10, 10, 10, -10 },
		-80, -50, 10, 3, 10, 20, 50, -20,
		27,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		20,
		0x0004F8,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[スライム]",
#endif
		"[Slime]",

		{ 0, -15, -15, 0, 20, -10 },
		30, -50, 30, 10, -20, -20, 30, -30,
		20,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x0005F0,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[魔理沙？]",
#endif
		"[Marisa?]",

		{ 0, 0, 0, 0, 0, 0 },
		10, 5, 5, 0, 10, 10, 0, 0,
		10,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x000080,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},

	{
#ifdef JP
		"[霧変化]",
#endif
		"[Mist]",

		{ -5, 0, 0, -2, -2, -2 },
		30, -10,  0, 15, -5, 20, -30, -15,
		7,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x000080,//騎乗以外制限なし
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[竜変化]",
#endif
		"[Dragon]",

		{ 20, 5, 5, 5, 20,  0 },
		-50, -50, 30, -10, -10, 10, 70, -20,
		0,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		25,
		0x0006F8,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[猫形態]",
#endif
		"[Cat]",

		{ -3, -2, -2, 5, -2,  2 },
		-20, -20, 0, 15, 10, 20, 10, -30,
		7,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		10,
		0x0005F0,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},

	{
#ifdef JP
		"[正体不明]",
#endif
		"[Undefined]",

		{ 8, 3, 1, 6, 8, 2 },
		2, 10, 30, 3, 18, 10, 60, 20,
		20,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		20,
		0x000000,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	{
#ifdef JP
		"[小型化]",
#endif
		"[Kobito]",

		{ -5, 0, 0, 0, -4, 0 },
		20, 12, 0, 30, 30, 50, -20, -5,
		5, 50,
		100, 35,
		72,  6, 50, 5,
		66,  4, 50, 5,
		0,
		0x000000,
		{0,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5, 5, 5, 5, 5, 5},//realm
		100,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(0L),
	},
	//変身1 射撃、投擲、発動、装備変更、騎乗、追加攻撃不可
	{
#ifdef JP
		"[変身(人型)]",
#endif
		"[ChngHuman]",

		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  0,  10,  0,  0,
		10,  100,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x0001B0,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	//変身2 1に加え魔法と魔道具不可
	{
#ifdef JP
		"[変身(怪物)]",
#endif
		"[ChngMonster]",

		{  0, -4, -2,  0,  0,  -3 },
		-10, -10,  0,  0, -5,  10,  0,  0,
		10,  100,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x0005F0,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	//変身3 2に加え巨大化フラグ付与
	{
#ifdef JP
		"[変身(巨大)]",
#endif
		"[ChngGiant]",

		{ 10, -2, 0,  0,  5, -5 },
		-30, -30,  0,  0,  -10,  10,  0,  0,
		10,  100,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		0,
		0x0005F8,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},

	{
#ifdef JP
		"[艶書の怨霊]",
#endif
		"[Ghost]",

		{ 2, 2, 2, 2, 2, 7 },
		6, 12, 8, 5, 10, 12, 20, 20,
		12,  0,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		7,
		0x000005,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},
	//騎乗、追加攻撃不可
	{
#ifdef JP
		"[絵巻物の邪鬼]",
#endif
		"[Scroll Oni]",

		{  6,  0,  0,  6,  6,  -20 },
		0, 10, 30, -10, 0,  10, 50, 30,
		18,  100,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		7,
		0x000182,
		{ 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
		100,
		FALSE,FALSE,FALSE,FALSE
		,'p',(0L),
	},

	{
#ifdef JP
		"[新世界の神？]",
#endif
		"[New World God?]",

		{ 0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  10,  0,  10,  10,
		12,  100,
		0,  0,
		0,  0, 0, 0,
		0,  0, 0, 0,
		8,
		0x000000,
		{ 0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 5, 5, 5, 5, 5, 5 },
		100,//scoremul
		FALSE,FALSE,FALSE,FALSE//FLAG
		,'p',(0L),
	},


};


//魔法書の内容
//一番左は司書(赤魔)専用で、check_book_realm()のところで3冊目以降が読めない処理がある

magic_type spell_base_info[MAX_BASIC_MAGIC_REALM][32][6] =
{
	{
	/*:::元素1*/
	{{ 3,  2,22,  0},{ 7,  2,25,  5},{ 5,  2,25,  5},{ 3,  2,23,  5},{ 1,  1,20,  5},{ 1,  1,15,  5},},//マジックミサイル
	{{ 4,  3,25,  0},{ 8,  4,27,  5},{ 6,  3,27,  5},{ 3,  3,25,  5},{ 2,  3,22,  5},{ 1,  1,18,  5},},//閃光
	{{ 8,  6,30,  0},{11,  9,30,  5},{ 8,  8,30,  5},{ 5,  5,30,  5},{ 4,  3,25,  5},{ 3,  3,20,  5},},//サンダー・ボルト
	{{10,  8,35,  0},{12, 12,35,  6},{10, 10,35,  6},{ 6,  6,34,  6},{ 5,  4,30,  6},{ 4,  3,25,  6},},//アイス・ボルト
	{{13, 10,40,  0},{99,  0, 0,  0},{12, 11,40,  8},{ 9,  7,37,  8},{ 7,  5,35,  8},{ 6,  4,30,  8},},//アシッド・ボルト
	{{15, 12,45,  0},{18, 18,45, 10},{15, 13,45, 10},{12,  9,43, 10},{ 9,  7,40, 10},{ 8,  6,35, 10},},//ファイア・ボルト
	{{18, 16,45,  0},{20, 20,48, 20},{18, 17,48, 20},{15, 12,48, 20},{12, 10,40, 20},{11,  8,35, 20},},//浮遊
	{{22, 20,50,  0},{24, 22,50, 40},{22, 20,50, 40},{19, 18,50, 40},{16, 15,43, 40},{13, 10,38, 40},},//温度遮断
	/*:::元素2*/
	{{19, 12,40,  0},{20, 18,45, 20},{18, 15,45, 20},{16, 12,40, 20},{12, 11,37, 20},{11,  9,32, 20},},//耐電
	{{22, 12,40,  0},{22, 18,45, 20},{20, 15,45, 20},{18, 12,40, 20},{13, 11,37, 20},{12,  9,32, 20},},//耐酸
	{{27, 20,55,  0},{99,  0, 0,  0},{25, 23,58, 50},{21, 19,55, 50},{16, 16,65, 50},{14, 13,60, 50},},//ウィンドカッター
	{{30, 27,60,  0},{28, 32,65, 60},{26, 29,60, 60},{24, 26,60, 60},{18, 20,55, 60},{16, 18,45, 60},},//トンネル生成
	{{32, 18,55,  0},{32, 24,55, 60},{28, 21,55, 60},{26, 18,50, 60},{20, 14,45, 60},{18, 12,40, 60},},//サンダー・ボール
	{{34, 21,55,  0},{34, 27,60, 65},{30, 24,60, 65},{28, 20,55, 65},{22, 16,50, 65},{20, 14,45, 65},},//アイス・ボール
	{{36, 22,60,  0},{99,  0, 0,  0},{32, 25,65, 70},{30, 21,60, 70},{24, 18,55, 70},{22, 16,50, 70},},//アシッド・ボール
	{{40, 25,70,  0},{40, 32,75, 80},{37, 28,75, 80},{35, 24,70, 80},{28, 22,65, 80},{25, 20,60, 80},},//ファイア・ボール
	/*:::元素3*/
	{{99,  0, 0,  0},{99,  0, 0,  0},{26, 32,75, 80},{23, 28,70, 80},{20, 25,65, 80},{18, 21,60, 80},},//水の鎧
	{{99,  0, 0,  0},{33, 36,60,100},{29, 33,50,100},{25, 29,45,100},{23, 25,40,100},{20, 22,30,100},},//落とし穴
	{{99,  0, 0,  0},{36, 41,75,100},{32, 38,70,100},{28, 36,65,100},{25, 32,55,100},{23, 27,40,100},},//エレメンタル召喚
	{{99,  0, 0,  0},{99,  0, 0,  0},{35, 36,70,120},{30, 35,65,120},{27, 30,60,120},{25, 25,50,120},},//元素耐性
	{{99,  0, 0,  0},{38, 40,70,100},{35, 35,65,100},{32, 31,60,100},{30, 27,55,100},{28, 24,50,100},},//氷の槍
	{{99,  0, 0,  0},{99,  0, 0,  0},{38, 48,75,120},{35, 45,70,120},{33, 40,65,120},{30, 34,60,120},},//酸の雨
	{{99,  0, 0,  0},{44, 45,85,140},{42, 39,80,140},{40, 36,75,140},{36, 32,70,140},{32, 25,65,140},},//炎の嵐
	{{99,  0, 0,  0},{46, 48,75,180},{45, 40,70,180},{42, 35,65,180},{40, 30,60,180},{37, 26,50,180},},//雷の拳
	/*:::元素4*/
	{{99,  0, 0,  0},{35, 30,80, 75},{30, 25,70, 75},{24, 21,55, 75},{20, 18,50, 75},{16, 15,40, 75},},//魔力消去
	{{99,  0, 0,  0},{99,  0, 0,  0},{37, 32,80,120},{32, 28,75,120},{28, 25,70,120},{25, 23,60,120},},//原子分解
	{{99,  0, 0,  0},{48, 70,85,150},{45, 60,80,150},{40, 55,70,150},{36, 50,60,150},{33, 43,55,150},},//石壁生成
	{{99,  0, 0,  0},{50, 80,90,150},{47, 75,88,150},{43, 67,85,150},{40, 60,80,150},{37, 55,75,150},},//絶対零度
	{{99,  0, 0,  0},{99,  0, 0,  0},{50,100,95,180},{46, 90,85,180},{43, 75,75,180},{40, 68,70,180},},//アトミックレイ
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{48, 50,99,250},{45, 40,99,250},{41, 35,85,250},},//エリクサー
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{49,145,85,200},{46,130,80,200},{43,115,70,200},},//四元素免疫
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{50, 80,90,250},{48, 75,85,250},{45, 65,72,250},},//エーテルストライク
	},
	{
	/*:::予見1*/
	{{ 3,  3,25,  0},{ 7,  3,25,  5},{ 5,  2,25,  5},{ 3,  2,20,  5},{ 1,  1,20,  5},{ 1,  1,20,  5},},//鉱物探知
	{{ 4,  5,25,  0},{ 8,  6,25,  5},{ 6,  4,25,  5},{ 4,  3,20,  5},{ 1,  2,20,  5},{ 1,  1,20,  5},},//トラップ感知
	{{ 5,  8,25,  0},{10,  8,35,  5},{ 7,  6,30,  5},{ 5,  5,25,  5},{ 2,  3,20,  5},{ 1,  2,20,  5},},//モンスター感知
	{{ 8, 10,35,  0},{11, 10,40,  8},{ 9,  8,35,  8},{ 7,  7,30,  8},{ 3,  5,30,  8},{ 3,  4,25,  8},},//恐怖治癒
	{{11, 12,25,  0},{13, 12,30, 10},{10, 10,25, 10},{ 8,  9,20, 10},{ 5,  7,20, 10},{ 4,  6,20, 10},},//ドア・階段感知
	{{16, 18,30,  0},{15, 18,35, 12},{12, 16,30, 12},{10, 14,25, 12},{ 6, 10,20, 12},{ 5,  9,20, 12},},//アイテム感知
	{{20, 18,40,  0},{16, 20,45, 18},{14, 17,40, 18},{12, 15,40, 18},{ 9, 12,35, 18},{ 7, 10,30, 18},},//恐怖のビジョン
	{{22, 18,40,  0},{19, 19,40, 20},{17, 17,35, 20},{15, 15,35, 20},{12, 12,30, 20},{10, 10,25, 20},},//鑑定
	/*:::予見2*/
	{{25, 16,55,  0},{18, 21,55, 25},{15, 19,55, 25},{13, 17,50, 25},{10, 14,45, 25},{ 8, 12,40, 25},},//周辺感知
	{{27, 20,50,  0},{20, 26,50, 25},{18, 23,45, 25},{16, 20,40, 25},{13, 15,35, 25},{10, 13,30, 25},},//調査
	{{30, 27,60,  0},{24, 36,55, 45},{21, 32,55, 45},{18, 28,50, 45},{16, 24,45, 45},{14, 20,40, 45},},//匠の輝き発見
	{{32, 25,80,  0},{28, 34,80, 35},{26, 30,80, 35},{24, 27,80, 35},{20, 23,70, 35},{17, 20,60, 35},},//精神感応
	{{33, 20,50,  0},{30, 18,50, 45},{28, 16,50, 45},{26, 14,45, 45},{23, 12,40, 45},{20, 10,35, 45},},//幻覚治癒
	{{35, 45,50,  0},{33, 43,50, 55},{30, 40,50, 55},{28, 35,45, 55},{25, 32,40, 55},{23, 30,35, 55},},//空気感知
	{{39, 25,70,  0},{36, 29,75, 35},{33, 27,70, 35},{30, 24,65, 35},{27, 21,60, 35},{25, 18,50, 35},},//破滅のビジョン
	{{44, 28,70,  0},{39, 36,70, 65},{37, 30,70, 65},{35, 27,65, 65},{31, 24,60, 65},{27, 21,55, 65},},//全感知
	/*:::予見3*/
	{{99,  1,20,  5},{32, 50,50, 60},{30, 45,45, 60},{26, 40,40, 60},{23, 30,30, 60},{20, 27,26, 60},},//タロット占い
	{{99,  1,20,  5},{99, 0,  0,  0},{32, 60,50, 70},{30, 55,45, 70},{27, 50,40, 70},{24, 44,33, 70},},//特別な強敵感知
	{{99,  1,20,  5},{38, 41,60, 70},{35, 38,60, 70},{32, 35,60, 70},{30, 30,55, 70},{26, 25,47, 70},},//*鑑定*
	{{99,  1,20,  5},{40, 35,80, 85},{38, 33,75, 85},{36, 30,70, 85},{33, 25,60, 85},{30, 20,54, 85},},//自己分析
	{{99,  1,20,  5},{42, 40,75, 90},{39, 35,75, 90},{37, 32,70, 90},{35, 28,65, 90},{32, 25,59, 90},},//カオス耐性
	{{99,  1,20,  5},{99,  0, 0,  0},{43, 47,75,100},{40, 41,70,100},{38, 36,60,100},{35, 32,54,100},},//*モンスター感知*
	{{99,  1,20,  5},{99,  0, 0,  0},{46, 65,85,125},{44, 57,80,125},{41, 50,70,125},{38, 45,65,125},},//未来予知
	{{99,  1,20,  5},{50, 95,95,175},{48, 90,95,175},{46, 85,90,175},{43, 72,80,175},{40, 64,72,175},},//伝説の品感知
	/*:::予見4*/
	{{99,  1,20,  5},{34, 40,70, 75},{32, 37,70, 70},{29, 32,65, 70},{27, 27,60, 70},{24, 24,55, 70},},//ヒロインの特権
	{{99,  1,20,  5},{45, 72,90, 90},{42, 60,85, 90},{38, 52,80, 90},{33, 45,75, 90},{30, 38,65, 90},},//*千里眼*
	{{99,  1,20,  5},{48, 43,90,100},{45, 40,90,100},{40, 35,90,100},{38, 30,85,100},{35, 27,80,100},},//因果混乱
	{{99,  1,20,  5},{99,  1,20,  5},{99,  0, 0,  0},{43, 32,65,120},{40, 27,50,120},{36, 24,45,120},},//シャドウシフト
	{{99,  1,20,  5},{99,  1,20,  5},{47, 90,90,160},{45, 80,85,160},{42, 72,75,160},{40, 64,65,160},},//破滅の宣告
	{{99,  1,20,  5},{99,  1,20,  5},{50, 86,85,200},{47, 77,85,200},{45, 65,80,200},{43, 58,70,200},},//幸運のメカニズム
	{{99,  1,20,  5},{99,  1,20,  5},{99,  0, 0,  0},{50, 85,90,230},{47, 76,85,230},{45, 67,80,230},},//因果修復
	{{99,  1,20,  5},{99,  1,20,  5},{99,  0, 0,  0},{50,150,99,250},{49,120,99,250},{46,105,75,250},},//アカシックレコード直結
	},
	{
	/*:::付与1*/
	{{ 3,  3,25,  0},{ 7,  4,30,  5},{ 5,  3,30,  5},{ 3,  3,25,  5},{ 1,  2,20,  5},{ 1,  2,20,  5},},//魔法の施錠　
	{{ 6,  4,35,  0},{ 9,  6,40,  5},{ 6,  5,40,  5},{ 4,  4,35,  5},{ 1,  3,30,  5},{ 1,  2,25,  5},},//魔法の弩　
	{{ 9,  6,30,  0},{10,  9,35,  5},{ 7,  7,35,  5},{ 5,  5,30,  5},{ 3,  3,25,  5},{ 2,  2,20,  5},},//回復力強化
	{{12,  7,35,  0},{12, 10,40,  8},{ 9,  8,40,  8},{ 7,  7,35,  8},{ 5,  5,30,  8},{ 4,  4,25,  8},},//トラップ/ドア破壊
	{{15, 11,40,  0},{99,  1,20, 10},{12, 12,45, 10},{ 9, 10,40, 10},{ 7,  8,35, 10},{ 6,  7,30, 10},},//視力強化　
	{{18, 15,35,  0},{15, 20,40, 15},{13, 17,40, 15},{10, 14,35, 15},{ 8, 12,30, 15},{ 7, 10,25, 15},},//空腹充足　
	{{20, 13,55,  0},{18, 18,60, 20},{15, 16,60, 20},{12, 12,55, 20},{10, 10,50, 20},{ 8,  8,45, 20},},//耐熱耐寒　
	{{24, 20,60,  0},{21, 22,65, 20},{18, 20,65, 20},{15, 17,60, 20},{13, 15,55, 20},{10, 12,50, 20},},//筋力増幅　
	/*:::付与2*/
	{{24, 24,60,  0},{18, 30,60, 25},{16, 27,60, 25},{14, 24,58, 25},{12, 21,55, 25},{10, 18,50, 25},},//魔法陣設置　
	{{30, 12,45,  0},{20, 18,50, 20},{18, 15,45, 20},{16, 12,45, 20},{14, 10,40, 20},{12,  9,35, 20},},//耐電　
	{{30, 12,45,  0},{20, 18,50, 20},{18, 15,45, 20},{16, 12,45, 20},{14, 10,40, 20},{12,  9,35, 20},},//耐酸
	{{35, 25,55,  0},{24, 30,70, 35},{21, 27,60, 35},{18, 24,55, 35},{16, 20,50, 35},{14, 18,45, 35},},//狂戦士化
	{{38, 22,75,  0},{27, 30,90, 50},{25, 26,80, 50},{22, 23,75, 50},{18, 18,70, 50},{16, 16,65, 50},},//魔力充填
	{{42, 26,65,  0},{99,  1,20,  5},{30, 30,70, 40},{26, 27,65, 40},{22, 24,60, 40},{20, 22,55, 40},},//代謝急加速　
	{{45, 74,85,  0},{36, 90,90, 80},{33, 80,90, 80},{30, 72,85, 80},{25, 60,80, 80},{23, 54,70, 80},},//武器強化　
	{{45, 79,85,  0},{36,100,90, 80},{33, 88,90, 80},{30, 80,85, 80},{25, 70,80, 80},{23, 72,70, 80},},//防具強化
	/*:::付与3*/
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{24, 60,85, 60},{22, 51,80, 60},{20, 43,75, 60},},//ゴーレム作成
	{{99,  1,20,  5},{34, 30,67, 85},{31, 25,63, 85},{28, 21,60, 85},{25, 18,55, 85},{23, 15,50, 85},},//皮膚硬化
	{{99,  1,20,  5},{36, 36,80, 85},{32, 30,77, 85},{30, 27,75, 85},{27, 24,70, 85},{25, 20,65, 85},},//全耐性　
	{{99,  1,20,  5},{99,  1,20,  5},{35, 25,80,120},{32, 23,80,120},{30, 20,75,120},{27, 18,70,120},},//身体加速　
	{{99,  1,20,  5},{39, 30,20,  5},{37, 26,70, 85},{35, 24,65, 85},{32, 21,60, 85},{30, 16,55, 85},},//爆発のルーン
	{{99,  1,20,  5},{45, 48,65, 95},{43, 45,60, 95},{39, 41,55, 95},{36, 38,50, 95},{33, 32,45, 95},},//完全なる知識
	{{99,  1,20,  5},{48, 76,85,125},{45, 70,80,125},{43, 66,75,125},{40, 60,70,125},{37, 58,65,125},},//魔法剣
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{45, 74,85,200},{43, 68,80,200},{39, 60,75,200},},//魔法の鎧
	/*:::付与4*/
	{{99,  1,20,  0},{28, 28,60, 55},{26, 25,55, 55},{24, 23,55, 55},{20, 20,50, 55},{18, 18,45, 55},},//呪縛消去
	{{99,  1,20,  5},{99,  1,20,  5},{35, 72,90,100},{30, 64,85,100},{25, 55,80,100},{23, 48,75,100},},//飛刀作成
	{{99,  1,20,  5},{42, 52,90,100},{38, 45,90,100},{35, 40,85,100},{32, 32,80,100},{30, 27,75,100},},//装備無力化
	{{99,  1,20,  5},{45,100,90,150},{43, 95,88,150},{40, 90,85,150},{37, 85,80,150},{35, 78,75,150},},//匠の技
	{{99,  1,20,  5},{48, 94,95,180},{45, 85,95,180},{42, 77,95,180},{40, 72,90,180},{38, 66,85,180},},//属性への免疫
	{{99,  1,20,  5},{50,100,95,  5},{48, 90,95,  5},{45, 85,95,200},{43, 77,90,200},{40, 70,85,200},},//無生物破壊
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{47, 45,85,220},{45, 37,80,220},{42, 30,75,220},},//*魔力充填*
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{50,180,99,240},{48,150,95,240},{45,125,90,240},},//超人化
	},

	{
	/*:::召喚1*/
	{{ 3,  3,20,  0},{ 7,  3,25,  5},{ 5,  3,25,  5},{ 3,  2,23,  5},{ 1,  2,20,  5},{ 1,  1,18,  5},},//蛇召喚
	{{ 5,  3,25,  0},{ 8,  4,32,  5},{ 6,  4,30,  5},{ 4,  3,28,  5},{ 2,  2,25,  5},{ 1,  1,22,  5},},//ショート・テレポート
	{{ 8,  6,30,  0},{10,  8,40,  5},{ 8,  7,40,  5},{ 6,  6,35,  5},{ 4,  5,30,  5},{ 3,  3,25,  5},},//虫召喚
	{{10,  6,40,  0},{11,  7,50, 10},{10,  6,46, 10},{ 8,  6,43, 10},{ 6,  5,40, 10},{ 4,  3,35, 10},},//サモンマテリアル
	{{14, 12,35,  0},{14, 13,45, 15},{12, 12,40, 15},{10, 11,35, 15},{ 8, 10,30, 15},{ 7,  9,25, 15},},//妖精召喚
	{{15, 14,35,  0},{16, 16,40, 20},{14, 15,35, 20},{12, 14,33, 20},{10, 12,30, 20},{ 9, 10,25, 20},},//テレポート
	{{17, 17,40,  0},{20, 23,50, 25},{17, 20,45, 25},{15, 18,40, 25},{13, 16,35, 25},{11, 14,30, 25},},//動物召喚
	{{20, 16,70,  0},{22, 24,70, 30},{18, 21,67, 30},{16, 17,65, 30},{15, 14,63, 30},{13, 12,60, 30},},//アイテムテレポート
	/*:::召喚2*/
	{{23, 14,45,  0},{24, 20,50, 40},{20, 18,47, 40},{18, 16,43, 40},{16, 13,40, 40},{15, 10,35, 40},},//テレポート・アウェイ
	{{27, 23,50,  0},{30, 28,55, 45},{26, 26,52, 45},{23, 24,48, 45},{20, 21,45, 45},{18, 18,40, 45},},//モンスター一体召喚
	{{32, 27,45,  0},{31, 35,55, 40},{27, 32,48, 40},{25, 28,43, 40},{22, 25,40, 40},{20, 20,35, 40},},//テレポート・レベル
	{{35, 33,50,  0},{35, 42,60, 50},{32, 38,55, 50},{28, 35,50, 50},{25, 30,45, 50},{23, 27,40, 50},},//悪魔召喚
	{{38, 28,60,  0},{99,  1,20,  0},{33, 41,65, 70},{30, 38,60, 70},{27, 35,55, 70},{25, 32,50, 70},},//転送陣
	{{41, 32,55,  0},{38, 40,65, 80},{36, 36,60, 80},{32, 32,55, 80},{30, 30,50, 80},{28, 27,45, 80},},//エレメンタル召喚
	{{44, 37,35,  0},{41, 32,40, 70},{38, 30,36, 70},{36, 28,33, 70},{34, 26,30, 70},{31, 22,27, 70},},//傭兵呼集
	{{48, 34,55,  0},{99,  1,20,  0},{43, 40,60, 90},{39, 37,55, 90},{36, 32,50, 90},{32, 27,45, 90},},//次元の扉
	/*:::召喚3*/
	{{99,  1,20,  5},{30, 55,60, 50},{27, 50,57, 50},{24, 45,53, 50},{20, 40,50, 50},{18, 35,47, 50},},//タウン・テレポート
	{{99,  1,20,  5},{99,  1,20,  5},{35, 55,95, 65},{30, 50,90, 65},{26, 45,85, 65},{24, 42,80, 65},},//ゼファーハウンド召喚
	{{99,  1,20,  5},{99,  1,20,  5},{37, 42,77, 80},{32, 38,73, 80},{29, 35,70, 80},{27, 30,66, 80},},//位置交換
	{{99,  1,20,  5},{40, 45,80,100},{38, 42,75,100},{34, 40,70,100},{32, 38,65,100},{29, 35,60,100},},//神格召喚
	{{99,  1,20,  5},{43, 48,65, 70},{40, 43,57, 70},{36, 40,53, 70},{34, 36,50, 70},{30, 32,45, 70},},//ダンジョンテレポート
	{{99,  1,20,  5},{46, 50,45, 85},{42, 40,38, 85},{38, 35,35, 85},{36, 30,30, 85},{32, 25,27, 85},},//ドラゴン召喚
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{40, 40,55, 90},{38, 36,50, 90},{35, 31,45, 90},},//召集
	{{99,  1,20,  5},{49, 72,99,120},{45, 68,97,120},{42, 64,93,120},{40, 60,90,120},{38, 54,86,120},},//モンスター複数召喚
	/*:::召喚4*/
	{{99,  1,20,  5},{99,  1,20,  5},{35, 38,70, 90},{27, 32,64, 90},{24, 30,60, 90},{22, 27,55, 90},},//時空耐性
	{{99,  1,20,  5},{40, 47,78,100},{35, 44,73,100},{32, 40,69,100},{30, 36,65,100},{26, 32,60,100},},//*テレポート・アウェイ*
	{{99,  1,20,  5},{99,  1,20,  5},{42, 56,80,120},{40, 50,75,120},{38, 45,70,120},{35, 40,65,120},},//電車召喚
	{{99,  1,20,  5},{50,100,75,180},{47, 90,70,180},{44, 82,65,180},{42, 75,60,180},{40, 70,55,180},},//上位悪魔召喚
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  0},{45, 50,90,150},{43, 45,85,150},{41, 40,80,150},},//送還術
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  0},{48,140,99,200},{45,130,95,200},{44,115,90,200},},//サイバーデーモン召喚
	{{99,  1,20,  5},{99,  1,20,  5},{50, 90,70,200},{50, 75,55,200},{48, 70,50,200},{46, 64,45,200},},//古代ドラゴン召喚
	{{99,  1,20,  5},{50,100,20,250},{50, 95,20,250},{50, 84,20,250},{50, 77,20,250},{49, 70,20,250},},//宴会開催
	},
	{
	/*:::神秘1*/
	{{ 3,  1,20,  0},{ 7,  3,30,  5},{ 5,  2,25,  5},{ 3,  2,23,  5},{ 1,  1,20,  5},{ 1,  1,20,  5},},//浮遊
	{{ 5,  2,30,  0},{ 7,  4,40,  5},{ 6,  3,36,  5},{ 4,  3,34,  5},{ 1,  2,30,  5},{ 1,  1,25,  5},},//モンスター感知
	{{ 8,  3,25,  0},{ 8,  5,35, 10},{ 7,  4,32, 10},{ 5,  3,28, 10},{ 2,  2,25, 10},{ 1,  1,20, 10},},//ショート・テレポート
	{{10,  4,25,  0},{ 9,  6,40,  5},{ 8,  5,35,  5},{ 6,  4,30,  5},{ 3,  3,25,  5},{ 2,  2,20,  5},},//光球生成
	{{12,  4,25,  0},{11,  8,40, 10},{10,  6,35, 10},{ 8,  5,30, 10},{ 4,  4,25, 10},{ 2,  2,20, 10},},//催眠術
	{{16,  8,30,  0},{12, 10,40, 15},{11,  9,35, 15},{ 9,  8,33, 15},{ 5,  7,30, 15},{ 4,  6,25, 15},},//テレポート
	{{20, 10,50,  0},{14, 60,60, 25},{12, 13,58, 25},{10, 12,55, 25},{ 7, 10,50, 25},{ 6,  8,40, 25},},//地形感知
	{{24, 22,70,  0},{16, 35,90, 30},{14, 30,85, 30},{12, 25,80, 30},{ 9, 20,70, 30},{ 8, 15,60, 30},},//魔力充填
	/*:::神秘2*/
	{{28, 16,50,  0},{19, 25,60, 30},{16, 21,57, 30},{14, 18,54, 30},{10, 15,50, 30},{ 9, 12,45, 30},},//韋駄天の術
	{{30, 16,45,  0},{21, 23,50, 35},{18, 20,46, 35},{16, 18,43, 35},{12, 16,40, 35},{11, 13,35, 35},},//鑑定
	{{32, 15,45,  0},{99,  1,20, 35},{20, 18,50, 35},{18, 16,45, 35},{15, 14,40, 35},{13, 12,35, 35},},//テレポート・モンスター
	{{34, 18,55,  0},{26, 27,60, 40},{23, 23,57, 40},{20, 19,55, 40},{18, 16,50, 40},{16, 14,45, 40},},//心頭滅却
	{{36, 20,63,  0},{30, 29,70, 45},{27, 25,66, 45},{24, 22,63, 45},{20, 19,60, 45},{18, 16,55, 45},},//身体加速
	{{38, 72,80,  0},{33, 90,90, 55},{30, 85,86, 55},{27, 80,83, 55},{24, 70,80, 55},{21, 60,75, 55},},//霊酒醸成
	{{42, 22,70,  0},{36, 33,80, 80},{35, 28,75, 80},{33, 25,70, 80},{30, 20,65, 80},{27, 18,60, 80},},//全感知
	{{45, 75,70,  0},{99,  1,20,  5},{42, 80,80,120},{39, 76,75,120},{36, 70,70,120},{32, 65,60,120},},//神格召喚
	/*:::神秘3*/
	{{99,  1,20,  5},{99,  1,20,  5},{20, 25,50, 40},{18, 20,45, 40},{15, 16,40, 40},{13, 12,35, 40},},//看破
	{{99,  1,20,  5},{30, 80,60, 50},{27, 75,50, 50},{24, 70,45, 50},{20, 60,40, 50},{18, 50,35, 50},},//飛燕の術
	{{99,  1,20,  5},{99,  1,20,  5},{30, 26,70, 55},{27, 23,65, 55},{24, 20,60, 55},{22, 18,55, 55},},//幻術
	{{99,  1,20,  5},{38, 40,85,  5},{35, 36,83, 70},{33, 34,80, 70},{30, 30,75, 70},{28, 27,70, 70},},//*鑑定*
	{{99,  1,20,  5},{43, 50,80, 80},{38, 43,70, 80},{36, 40,65, 80},{32, 36,60, 80},{30, 30,55, 80},},//金丹の術
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1, 0,  0},{40, 64,85,110},{36, 60,80,110},{32, 55,75,110},},//壁抜け
	{{99,  1,20,  5},{46, 36,80,100},{44, 33,70,100},{42, 28,65,100},{38, 25,60,100},{35, 23,55,100},},//帰還
	{{99,  1,20,  5},{99,  1,20,  5},{48, 48,90,120},{45, 42,85,120},{42, 36,80,120},{38, 32,75,120},},//次元の扉　
	/*:::神秘4*/
	{{99,  1,20,  5},{30, 40,80, 75},{26, 38,80, 75},{24, 35,75, 75},{22, 30,70, 75},{20, 24,65, 75},},//ミダス王の手
	{{99,  1,20,  5},{35, 50,80, 85},{30, 48,77, 85},{27, 45,73, 85},{24, 40,70, 85},{22, 36,65, 85},},//気配遮断
	{{99,  1,20,  5},{99,  1,20,  5},{34, 32,68, 95},{31, 28,64, 95},{28, 24,60, 95},{25, 21,55, 95},},//剛力招来
	{{99,  1,20,  5},{99,  1,20,  5},{43, 60,95,140},{40, 50,90,140},{35, 40,80,140},{32, 35,75,140},},//千里眼
	{{99,  1,20,  5},{47, 48,90,165},{45, 42,86,165},{42, 48,83,165},{40, 45,80,165},{36, 40,75,165},},//矢返し
	{{99,  1,20,  5},{50, 72,80,175},{46, 63,80,175},{44, 57,75,175},{42, 50,70,175},{40, 43,65,175},},//鹿角の術
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{47, 80,90,220},{45, 70,85,220},{43, 66,80,220},},//無傷の球
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{50,120,95,250},{48,100,90,250},{45, 90,85,250},},//鬼神変化
	},
	{
	/*:::生命1*/
	{{ 3,  2,25,  0},{ 7,  3,30,  5},{ 5,  2,28,  5},{ 3,  2,25,  5},{ 1,  1,20,  5},{ 1,  1,18,  5},},//軽傷の治癒
	{{ 5,  4,40,  0},{99,  5,50,  5},{ 6,  4,45,  5},{ 5,  3,40,  5},{ 3,  2,35,  5},{ 2,  2,30,  5},},//祝福
	{{ 7,  7,40,  0},{10,  8,45, 10},{ 8,  7,43, 10},{ 6,  6,40, 10},{ 4,  5,35, 10},{ 3,  4,30, 10},},//解毒
	{{ 9,  7,40,  0},{12,  9,45, 10},{ 9,  8,43, 10},{ 7,  7,40, 10},{ 5,  5,35, 10},{ 4,  4,30, 10},},//光の召喚
	{{12,  9,40,  0},{15, 11,45, 20},{11, 10,40, 20},{ 9,  8,35, 20},{ 7,  7,30, 20},{ 6,  5,25, 20},},//生命体感知
	{{15, 12,45,  0},{18, 15,55, 20},{13, 14,50, 20},{11, 12,45, 20},{ 9, 10,40, 20},{ 8,  8,35, 20},},//回復力強化
	{{18, 18,55,  0},{99,  1,65, 25},{16, 20,60, 25},{14, 17,55, 25},{12, 15,50, 25},{10, 13,45, 25},},//空腹充足
	{{21, 20,45,  0},{21, 25,55, 30},{18, 23,50, 30},{16, 20,45, 30},{14, 18,40, 30},{12, 16,35, 30},},//治癒
	/*:::生命2*/
	{{24, 18,50,  0},{25, 25,60, 30},{20, 20,50, 30},{18, 18,48, 30},{16, 16,45, 30},{14, 14,40, 30},},//解呪
	{{27, 24,55,  0},{99,  1,20,  5},{24, 26,57, 35},{21, 22,53, 35},{18, 20,50, 35},{16, 18,45, 35},},//耐熱耐寒
	{{30, 20,45,  0},{30, 26,52, 40},{27, 23,48, 40},{23, 20,45, 40},{20, 16,40, 40},{18, 14,35, 40},},//ターンアンデッド
	{{34, 22,55,  0},{32, 29,60, 40},{27, 26,58, 40},{24, 23,55, 40},{22, 20,50, 40},{20, 18,45, 40},},//耐地獄
	{{38, 24,55,  0},{99,  1,20,  5},{30, 26,58, 45},{28, 24,55, 45},{25, 20,50, 45},{23, 18,45, 45},},//耐毒
	{{42, 28,75,  0},{35, 33,80, 40},{32, 30,75, 40},{30, 27,73, 40},{28, 25,70, 40},{25, 23,65, 40},},//鑑識
	{{45, 32,60,  0},{40, 42,70, 60},{36, 38,65, 60},{33, 35,60, 60},{30, 30,55, 60},{27, 27,50, 60},},//体力回復
	{{48, 48,85,  0},{47, 53,90, 80},{42, 50,86, 80},{38, 48,83, 80},{35, 45,80, 80},{32, 40,75, 80},},//結界の紋章
	/*:::生命3*/
	{{99,  1,20,  5},{99,  1,20,  5},{29, 38,80, 50},{26, 34,75, 50},{23, 30,70, 50},{20, 27,65, 50},},//精神感応
	{{99,  1,20,  5},{33, 40,80, 70},{30, 35,77, 70},{27, 30,73, 70},{25, 27,70, 70},{23, 24,65, 70},},//肉体強化
	{{99,  1,20,  5},{38, 55,75, 85},{34, 50,70, 85},{30, 45,65, 85},{27, 40,60, 85},{25, 36,55, 85},},//*解呪*
	{{99,  1,20,  5},{99,  1,20,  5},{35, 44,80, 80},{32, 40,75, 80},{30, 35,70, 80},{27, 32,65, 80},},//ディスペル
	{{99,  1,20,  5},{42, 45,75, 70},{39, 40,75, 70},{36, 36,70, 70},{33, 30,65, 70},{30, 25,60, 70},},//他者治療
	{{99,  1,20,  5},{44, 50,85, 80},{41, 40,80, 80},{39, 37,78, 80},{36, 35,75, 80},{33, 30,70, 80},},//耐混沌
	{{99,  1,20,  5},{99,  1,20,  5},{46, 72,75,100},{44, 68,72,100},{41, 65,70,100},{39, 60,65,100},},//*鑑識*
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  0},{46, 59,78,120},{43, 55,75,120},{41, 50,70,120},},//精神防壁
	/*:::生命4*/
	{{99,  1,20,  5},{99,  1,20,  5},{38, 50,95,115},{33, 43,90,115},{30, 40,85,115},{27, 35,80,115},},//リアクティブヒール
	{{99,  1,20,  5},{42, 70,90,120},{40, 65,88,120},{36, 59,84,120},{34, 55,80,120},{31, 51,75,120},},//アンデッド消滅
	{{99,  1,20,  5},{45,100,90,150},{42, 94,85,150},{38, 87,78,150},{36, 80,75,150},{33, 73,70,150},},//全復活
	{{99,  1,20,  5},{99,  1,20,  5},{45,105,90,120},{42, 96,88,120},{40, 90,85,120},{36, 82,75,120},},//ライフストリーム
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,110},{46, 75,84,110},{44, 70,80,110},{40, 64,75,110},},//真・結界
	{{99,  1,20,  5},{50, 70,95,180},{49, 65,90,180},{47, 60,85,180},{45, 50,80,180},{42, 43,75,180},},//*体力回復*
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,230},{49, 88,93,230},{48, 80,90,230},{45, 70,85,230},},//新生
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,250},{50,108,83,250},{50,100,80,250},{47, 85,75,250},},//究極の耐性
	},
	{
	/*:::破邪1*/
	{{ 3,  1,20,  0},{ 7,  2,30,  5},{ 5,  2,27,  5},{ 3,  2,25,  5},{ 1,  1,20,  5},{ 1,  1,20,  5},},//懲罰→魔除けのまじない
	{{ 5,  2,20,  0},{ 8,  5,33,  5},{ 6,  4,30,  5},{ 4,  3,25,  5},{ 2,  2,20,  5},{ 1,  1,20,  5},},//混沌勢力感知
	{{ 8,  4,30,  0},{10,  6,45, 10},{ 7,  5,40, 10},{ 5,  4,35, 10},{ 3,  3,30, 10},{ 2,  2,25, 10},},//祝福
	{{11,  8,30,  0},{12, 12,40, 10},{ 8, 10,35, 10},{ 6,  8,30, 10},{ 3,  6,25, 10},{ 2,  4,22, 10},},//魔除けのまじない→御札投擲
	{{14,  7,40,  0},{13, 10,48, 15},{10,  9,45, 15},{ 7,  8,40, 15},{ 6,  7,35, 15},{ 5,  6,32, 15},},//透明体視認
	{{17,  9,30,  0},{14, 15,40, 20},{11, 12,35, 20},{ 9, 10,30, 20},{ 8,  8,25, 20},{ 7,  7,22, 20},},//士気高揚
	{{20, 11,43,  0},{99,  1,55, 30},{14, 14,50, 30},{11, 12,45, 30},{10, 10,40, 30},{ 9,  8,37, 30},},//スターダスト
	{{23, 19,58,  0},{20, 25,70, 40},{16, 23,65, 40},{13, 20,60, 40},{12, 18,55, 40},{10, 16,50, 40},},//解呪
	/*:::破邪2*/
	{{26, 17,50,  0},{99,  1,20, 50},{99,  1,20, 50},{17, 23,50, 50},{15, 20,45, 50},{13, 17,40, 50},},//治癒
	{{29, 13,45,  0},{22, 16,50, 50},{20, 14,45, 50},{18, 13,43, 50},{16, 12,40, 50},{15, 11,36, 50},},//威圧
	{{32, 15,52,  0},{99,  1,20, 60},{24, 18,60, 60},{20, 16,55, 60},{18, 14,50, 60},{16, 13,45, 60},},//聖なる光球
	{{35, 20,63,  0},{30, 30,70, 80},{26, 25,68, 80},{24, 22,64, 80},{21, 19,60, 80},{18, 17,55, 80},},//退魔の呪文
	{{38, 12,32,  0},{33, 16,40, 80},{30, 13,36, 80},{27, 12,33, 80},{24, 10,30, 80},{22,  9,27, 80},},//封印解除
	{{40, 32,64,  0},{36, 45,80, 90},{32, 40,70, 90},{29, 35,65, 90},{27, 30,60, 90},{24, 27,55, 90},},//ディスペル
	{{43, 34,85,  0},{42, 45,90,100},{38, 39,88,100},{35, 36,83,100},{33, 32,80,100},{30, 28,75,100},},//裁きの雷
	{{46, 38,85,  0},{99,  1,20,125},{99,  1,20,125},{43, 40,85,125},{40, 35,80,125},{36, 32,75,125},},//聖なる御言葉
	/*:::破邪3*/
	{{99,  1,20,  5},{24, 23,60, 50},{22, 20,56, 50},{20, 17,53, 50},{18, 14,50, 50},{16, 13,45, 50},},//封魔
	{{99,  1,20,  5},{99,  1,20,  5},{29, 27,67, 60},{27, 24,64, 60},{24, 20,60, 60},{22, 18,55, 60},},//耐邪悪結界
	{{99,  1,20,  5},{36, 30,64, 75},{32, 27,60, 75},{30, 25,55, 75},{27, 23,50, 75},{25, 20,45, 75},},//破邪の印
	{{99,  1,20,  5},{38, 50,95,100},{35, 45,90,100},{33, 40,85,100},{30, 35,80,100},{28, 33,75,100},},//*解呪*
	{{99,  1,20,  5},{99,  1,20,  5},{38, 28,67, 80},{35, 25,64, 80},{32, 20,60, 80},{30, 18,55, 80},},//聖なるオーラ
	{{99,  1,20,  5},{43, 38,80, 80},{40, 35,78, 80},{37, 32,73, 80},{34, 30,70, 80},{32, 27,65, 80},},//聖なる矢
	{{99,  1,20,  5},{99,  1,20,  5},{42, 40,80,100},{40, 36,75,100},{37, 30,70,100},{35, 27,65,100},},//邪悪追放
	{{99,  1,20,  5},{99,  1,20,  5},{45, 50,80,120},{42, 48,75,120},{40, 45,70,120},{37, 40,65,120},},//スターバースト
	/*:::破邪4*/
	{{99,  1,20,  5},{40, 46,80,100},{37, 40,75,100},{34, 36,70,100},{30, 32,60,100},{27, 30,55,100},},//天石門別命降臨
	{{99,  1,20,  5},{45, 80,80,120},{40, 72,75,120},{38, 63,70,120},{35, 50,65,120},{33, 43,60,120},},//石凝姥命降臨
	{{99,  1,20,  5},{47, 75,86,150},{43, 70,83,150},{40, 64,80,150},{38, 57,75,150},{35, 50,70,150},},//飯綱権現降臨
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,160},{42, 76,74,160},{40, 70,70,160},{38, 64,65,160},},//伊豆能売降臨
	{{99,  1,20,  5},{99,  1,20,  5},{46, 77,94,170},{44, 72,90,170},{42, 65,85,170},{40, 58,80,170},},//住吉三神降臨
	{{99,  1,20,  5},{50, 90,90,180},{48, 82,86,180},{46, 77,83,180},{44, 70,80,180},{42, 64,70,180},},//愛宕権現降臨
	{{99,  1,20,  5},{99,  1,20,  5},{50,100,88,200},{48, 98,84,200},{46, 90,80,200},{43, 85,75,200},},//天宇受売命降臨
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,250},{50,120,95,250},{48,108,90,250},{46,100,80,250},},//天照大御神降臨
	},
	{
	/*:::自然1*/
	{{ 3,  4,20,  0},{ 7,  5,25,  5},{ 5,  4,25,  5},{ 3,  3,20,  5},{ 1,  2,20,  5},{ 1,  2,20,  5},},//モンスター感知
	{{ 5,  3,25,  0},{ 8,  5,28,  5},{ 5,  4,25,  5},{ 4,  3,25,  5},{ 1,  2,20,  5},{ 1,  1,15,  5},},//放電
	{{ 8,  5,25,  0},{ 9,  7,33,  8},{ 6,  6,30,  8},{ 5,  5,25,  8},{ 3,  4,20,  8},{ 2,  3,18,  8},},//罠と扉感知　
	{{10,  7,30,  0},{10,  9,35, 10},{ 8,  8,30, 10},{ 6,  7,30, 10},{ 5,  6,25, 10},{ 4,  5,20, 10},},//食糧生成
	{{12,  6,30,  0},{12,  9,35, 15},{ 9,  7,30, 15},{ 7,  6,30, 15},{ 6,  5,25, 15},{ 5,  4,20, 15},},//日の光
	{{15, 10,35,  0},{14, 12,40, 20},{11, 11,38, 20},{ 9, 10,35, 20},{ 8,  9,30, 20},{ 7,  8,25, 20},},//動物馴らし
	{{18, 10,40,  0},{16, 13,45, 30},{13, 11,40, 30},{12, 10,40, 30},{10,  8,35, 30},{ 9,  7,30, 30},},//環境への耐性
	{{20,  8,35,  0},{18, 10,40, 20},{16,  9,35, 20},{15,  8,35, 20},{12,  6,30, 20},{10,  5,25, 20},},//傷と毒治療
	/*:::自然2*/
	{{23,  9,40,  0},{19, 12,40, 30},{17, 10,40, 30},{15,  8,40, 30},{12,  7,35, 30},{10,  5,30, 30},},//岩石溶解
	{{26, 18,50,  0},{24, 25,50, 40},{20, 22,50, 40},{18, 18,50, 40},{16, 15,45, 40},{12, 13,40, 40},},//耐水
	{{28, 12,45,  0},{25, 15,50, 35},{23, 13,45, 35},{21, 12,45, 35},{18, 10,40, 35},{15,  9,35, 35},},//太陽光線
	{{32, 30,55,  0},{26, 40,70, 40},{24, 35,65, 40},{22, 32,60, 35},{19, 28,55, 35},{16, 24,50, 35},},//足がらめ
	{{34, 21,55,  0},{99,  1,20,  5},{27, 24,60, 40},{25, 22,55, 40},{22, 18,50, 40},{19, 15,45, 40},},//自然の覚醒
	{{40, 28,55,  0},{35, 35,65, 55},{32, 32,60, 55},{29, 28,55, 55},{25, 25,50, 55},{22, 23,45, 55},},//鎌鼬
	{{45, 35,65,  0},{99,  1,20,  5},{38, 38,70, 60},{35, 35,65, 60},{30, 32,60, 60},{27, 28,55, 60},},//薬草治療
	{{48, 40,75,  0},{43, 48,80, 80},{41, 45,75, 80},{39, 40,75, 80},{36, 35,70, 80},{32, 30,65, 80},},//動物召喚
	/*:::自然3*/
	{{99,  1,20,  5},{99,  1,20,  5},{21, 25,60, 55},{17, 22,55, 55},{15, 18,55, 55},{12, 16,50, 55},},//肌石化
	{{99,  1,20,  5},{30, 30,55, 50},{27, 27,55, 50},{23, 25,50, 50},{20, 22,50, 50},{18, 18,45, 50},},//天狗礫
	{{99,  1,20,  5},{36, 35,80, 60},{32, 32,70, 60},{28, 28,65, 60},{26, 24,65, 60},{23, 20,60, 60},},//真・耐性
	{{99,  1,20,  5},{99,  1,20,  5},{37, 40,75, 75},{34, 34,75, 75},{31, 30,70, 75},{28, 26,65, 75},},//森林創造
	{{99,  1,20,  5},{42, 40,85, 80},{39, 36,80, 80},{35, 32,80, 80},{33, 26,75, 80},{30, 20,70, 80},},//鷲使い
	{{99,  1,20,  5},{45, 50,95, 90},{43, 44,90, 90},{39, 40,90, 90},{36, 35,85, 90},{33, 32,80, 90},},//吹雪
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{43, 50,90,110},{40, 45,85,110},{36, 42,80,110},},//石の壁
	{{99,  1,20,  5},{49, 53,85,100},{47, 48,85,100},{45, 43,85,100},{42, 40,80,100},{38, 36,75,100},},//召雷
	/*:::自然4*/
	{{99,  1,20,  5},{35, 35,60, 60},{30, 30,55, 60},{27, 28,50, 60},{24, 25,50, 60},{20, 23,40, 60},},//妖精召喚
	{{99,  1,20,  5},{40, 40,60, 80},{38, 36,55, 80},{35, 30,55, 80},{32, 26,50, 80},{28, 24,40, 80},},//地震
	{{99,  1,20,  5},{43, 53,70,100},{40, 50,65,100},{37, 45,65,100},{35, 38,60,100},{32, 32,55,100},},//竜巻
	{{99,  1,20,  5},{48, 85,20,150},{43, 78,90,150},{40, 72,90,150},{38, 65,85,150},{36, 58,80,150},},//精霊の刃
	{{99,  1,20,  5},{99,  1,20,  5},{46, 40,80,120},{43, 36,85,120},{41, 32,80,120},{38, 27,76,120},},//陽光召喚
	{{99,  1,20,  5},{99,  1,20,  5},{48, 75,85,120},{45, 70,80,120},{43, 64,80,120},{41, 57,75,120},},//水脈収束
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{48,195,95,250},{46,180,95,250},{43,160,90,250},},//聖獣召喚
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{50,100,90,200},{47, 90,85,200},{44, 84,80,200},},//天変地異　
	},



	{
	/*:::変容1*/
	{{ 4,  2,20,  0},{ 7,  4,30,  5},{ 5,  3,25,  5},{ 3,  3,23,  5},{ 1,  2,20,  5},{ 1,  1,20,  5},},//発光
	{{ 6,  5,30,  0},{ 8,  9,40,  5},{ 6,  8,36,  5},{ 4,  7,33,  5},{ 3,  5,30,  5},{ 1,  3,25,  5},},//筋肉増強
	{{ 8,  5,25,  0},{ 9,  7,35,  5},{ 7,  6,32,  5},{ 6,  5,28,  5},{ 4,  4,25,  5},{ 3,  3,22,  5},},//獣の耳
	{{10,  8,35,  0},{10, 10,50, 10},{ 9,  9,45, 10},{ 8,  8,40, 10},{ 6,  7,35, 10},{ 5,  6,32, 10},},//強力投擲
	{{14, 14,40,  0},{13, 21,50, 10},{11, 19,50, 10},{10, 15,45, 10},{ 8, 13,40, 10},{ 7, 10,36, 10},},//皮膚変容
	{{16, 12,40,  0},{99,  1,20, 15},{13, 13,48, 15},{12, 11,44, 15},{10, 10,40, 15},{ 8,  9,36, 15},},//髪の毛針
	{{18, 14,30,  0},{16, 20,40, 20},{14, 15,38, 20},{13, 14,35, 20},{12, 12,30, 20},{ 9, 10,27, 20},},//翼生成
	{{21, 18,35,  0},{99,  1, 0,  0},{16, 24,42, 30},{15, 20,40, 30},{14, 18,35, 30},{12, 16,32, 30},},//足かせ→石油噴出
	/*:::変容2*/
	{{24, 22,45,  0},{21, 30,55, 35},{19, 25,53, 35},{17, 23,50, 35},{15, 20,45, 35},{14, 18,40, 35},},//循環器変容
	{{27, 16,45,  0},{24, 24,50, 30},{22, 20,48, 30},{20, 18,45, 30},{18, 16,40, 30},{16, 14,35, 30},},//目からビーム　
	{{30, 23,50,  0},{28, 30,55, 40},{26, 26,53, 40},{24, 24,50, 40},{21, 21,45, 40},{18, 20,40, 40},},//ドア生成　
	{{33, 28,45,  0},{32, 35,50, 50},{28, 30,45, 50},{26, 28,43, 50},{23, 26,40, 50},{20, 24,37, 50},},//結合再生　
	{{37, 38,60,  0},{36, 50,72, 70},{30, 48,68, 70},{28, 43,65, 70},{26, 40,63, 70},{23, 36,55, 70},},//爪強化
	{{40, 26,50,  0},{99,  1,20, 55},{34, 30,56, 55},{32, 27,53, 55},{30, 24,50, 55},{27, 20,45, 55},},//ブレス
//	{{43, 85,84,  0},{99,  1,20,  5},{32, 90,87,100},{29, 85,84,100},{27, 80,80,100},{25, 70,75,100},},//v1.1.94 毒針作成から変更
	{{43, 60,85,  0},{99,  1, 1,  1},{32, 30,80, 80},{29, 27,75, 80},{27, 22,70, 80},{25, 20,65, 80},},//粉砕
	{{46, 30,60,  0},{99,  1, 0,  0},{39, 32,66, 80},{38, 30,63, 80},{36, 28,60, 80},{33, 25,55, 80},},//伸腕
	/*:::変容3*/
	{{99,  1,20,  5},{32, 35,60, 65},{28, 33,57, 65},{25, 30,53, 65},{22, 26,50, 65},{20, 22,50, 65},},//スプリングフロア
	{{99,  1,20,  5},{34, 40,70, 75},{30, 35,68, 75},{27, 33,64, 75},{25, 30,60, 75},{23, 27,55, 75},},//電光石火
	{{99,  1,20,  5},{99,  1,20,  5},{34, 50,80, 95},{31, 45,75, 95},{28, 40,70, 95},{26, 36,65, 95},},//スライム変化　
	{{99,  1,20,  5},{99,  1,20,  5},{40, 36,70, 75},{35, 33,63, 75},{32, 30,60, 75},{29, 27,55, 75},},//*筋肉増強*
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{37, 47,64, 90},{35, 42,60, 90},{32, 37,55, 90},},//肉体再構成　
	{{99,  1,20,  5},{99,  1,20,  5},{43, 60,75, 90},{40, 56,70, 90},{38, 50,65, 90},{35, 45,60, 90},},//*ブレス*　
	{{99,  1,20,  5},{46, 65,85,130},{44, 60,80,130},{42, 55,75,130},{40, 50,70,130},{37, 45,65,130},},//獣変化
	{{99,  1,20,  5},{48, 70,85,105},{47, 64,83,105},{45, 60,80,105},{43, 55,75,105},{41, 49,70,105},},//マグマ活性
	/*:::変容4*/
	{{99,  1,20,  5},{37, 80,80,120},{35, 73,75,120},{32, 70,70,120},{28, 65,65,120},{25, 60,60,100},},//魔理沙変化
	{{99,  1,20,  5},{42, 55,70, 80},{38, 51,66, 80},{35, 48,63, 80},{32, 45,60, 80},{30, 40,55, 80},},//レーダーセンス
	{{99,  1,20,  5},{99,  1,20,  5},{42, 60,77,120},{38, 55,73,120},{37, 50,70,120},{34, 43,65,120},},//地面泳法
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,150},{43, 85,75,150},{40, 80,70,150},{38, 75,65,150},},//霧変化
	{{99,  1,20,  5},{50,180,90,170},{49,170,80,170},{47,160,75,170},{45,150,70,170},{42,140,65,170},},//肉体変容
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,160},{48, 88,90,160},{46, 80,85,160},{43, 70,80,160},},//生体ロケット
	{{99,  1,20,  5},{99,  1,20,  5},{50,140,99,200},{50,130,95,200},{48,120,90,200},{46,100,85,200},},//ドラゴン変化　
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,250},{50,225,99,250},{50,200,90,250},{50,180,85,250},},//転生
	},

//変容は種族により特殊処理でレベルが上下したり使用可否が変わるようにしよう
	{
	/*:::暗黒1*/
	{{ 3,  2,20,  0},{ 7,  3,30,  5},{ 5,  2,25,  5},{ 3,  2,22,  5},{ 1,  1,20,  5},{ 1,  1,16,  5},},//マジックミサイル
	{{ 5,  3,20,  0},{ 8,  4,30,  5},{ 6,  3,27,  5},{ 4,  3,24,  5},{ 2,  2,20,  5},{ 1,  1,18,  5},},//殺気感知
	{{ 8,  4,20,  0},{10,  6,30, 10},{ 8,  5,26, 10},{ 5,  4,23, 10},{ 3,  3,20, 10},{ 2,  2,18, 10},},//悪魔の祝福
	{{10,  4,25,  0},{11,  6,35, 15},{ 9,  5,33, 15},{ 6,  4,30, 15},{ 4,  3,25, 15},{ 3,  3,22, 15},},//悪臭雲
	{{12, 10,45,  0},{12, 12,48, 20},{10, 11,45, 20},{ 8, 10,43, 20},{ 7,  9,40, 20},{ 5,  8,36, 20},},//耐暗黒
	{{15,  7,33,  0},{13, 11,40, 25},{12,  9,35, 25},{10,  7,30, 25},{ 8,  6,25, 25},{ 7,  5,20, 25},},//暗闇
	{{18, 13,40,  0},{17, 15,42, 35},{15, 14,40, 35},{12, 12,38, 35},{10, 10,33, 35},{ 9,  9,30, 35},},//暗黒の矢　
	{{21, 16,45,  0},{99, 1,  1,  0},{17, 20,50, 35},{15, 18,48, 35},{11, 14,43, 35},{10, 12,40, 35},},//略式契約
	/*:::暗黒2*/
	{{25, 18,75,  0},{20, 23,80, 40},{18, 20,75, 40},{16, 18,70, 40},{14, 15,65, 40},{13, 12,60, 40},},//耐毒
	{{28, 32,63,  0},{25, 33,75, 55},{22, 30,70, 55},{20, 28,65, 55},{17, 24,60, 55},{16, 20,55, 55},},//毒液塗布
	{{32, 22,52,  0},{99,  1,20,  5},{25, 25,60, 55},{23, 23,55, 55},{20, 20,50, 55},{18, 17,45, 55},},//追放
	{{36, 20,64,  0},{30, 27,75, 70},{27, 24,70, 70},{25, 20,65, 65},{22, 18,60, 65},{20, 16,56, 65},},//暗黒レーザー
	{{40, 27,85,  0},{35, 38,88, 85},{30, 35,85, 85},{27, 30,83, 85},{24, 25,80, 85},{21, 23,75, 85},},//悪魔召喚
	{{43, 85,84,  0},{99,  1,20,  5},{32, 90,87,100},{29, 85,84,100},{27, 80,80,100},{25, 70,75,100},},//毒針作成
	{{46, 28,72,  0},{40, 38,85, 90},{36, 35,80, 90},{32, 30,75, 90},{30, 27,70, 90},{27, 24,65, 90},},//吸血
	{{50, 40,95,  0},{99,  1,20,  5},{99,  1,20,  0},{42, 40,93,120},{38, 36,90,120},{36, 32,85,120},},//抹殺
	/*:::暗黒3*/
	{{99,  1,20,  5},{30, 25,75, 55},{28, 21,70, 55},{25, 19,63, 55},{22, 16,60, 55},{20, 14,57, 55},},//ナイトメア
	{{99,  1,20,  5},{34, 35,80, 75},{30, 30,77, 75},{27, 28,74, 75},{25, 25,70, 75},{23, 23,66, 75},},//狂乱
	{{99,  1,20,  5},{36, 38,64, 85},{33, 35,60, 85},{30, 32,54, 85},{27, 30,50, 85},{24, 26,47, 85},},//毒素の嵐
	{{99,  1,20,  5},{99,  1,20,  5},{35, 37,80,100},{32, 34,74,100},{30, 30,70,100},{27, 28,66,100},},//ヘル・ランス
	{{99,  1,20,  5},{99,  1,20,  5},{41, 60,90,125},{36, 53,85,125},{33, 45,80,125},{30, 40,75,125},},//悪魔変化
	{{99,  1,20,  5},{45, 42,75,105},{43, 40,70,105},{39, 38,65,105},{36, 36,60,105},{33, 33,55,105},},//暗黒の嵐
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{42, 45,75,120},{39, 40,70,120},{36, 35,65,120},},//真・吸血
	{{99,  1,20,  5},{99,  1,20,  5},{47, 55,88,160},{45, 50,84,160},{42, 46,80,160},{40, 42,75,160},},//闇との融和
	/*:::暗黒4*/
	{{99,  1,20,  5},{99,  1,20,  5},{33, 35,70,100},{31, 32,65,100},{28, 28,60,100},{25, 24,55,100},},//影のゲート
	{{99,  1,20,  5},{37, 63,74, 80},{35, 60,70, 80},{30, 55,65, 80},{25, 50,60, 80},{22, 45,55, 80},},//不毛化
	{{99,  1,20,  5},{45, 80,90,120},{42, 74,88,120},{40, 68,85,120},{36, 60,80,120},{33, 55,75,120},},//魔剣
	{{99,  1,20,  5},{99,  1,20,  5},{44,100,82,150},{42, 95,78,150},{40, 90,70,150},{38, 83,65,150},},//テンプテーション
	{{99,  1,20,  5},{99,  1,20,  5},{99,  0, 0,  0},{44, 80,85,180},{42, 75,80,180},{39, 69,75,180},},//周辺抹殺
	{{99,  1,20,  5},{50,128,99,200},{48,120,96,200},{46,110,93,200},{44,100,90,200},{41, 93,85,200},},//上位悪魔召喚
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{48, 94,95,180},{46, 85,90,180},{43, 79,85,180},},//地獄の劫火
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{50,120,90,250},{49,100,85,250},{47, 88,80,250},},//魔王変化
	},
	{
	/*:::死霊1*/
	{{ 3,  2,25,  0},{ 7,  4,30,  5},{ 5,  3,25,  5},{ 3,  2,25,  5},{ 1,  2,20,  5},{ 1,  1,16,  5},},//呪符
	{{ 4,  3,25,  0},{ 8,  6,30,  5},{ 6,  5,25,  5},{ 4,  4,25,  5},{ 2,  3,20,  5},{ 1,  2,20,  5},},//無生命感知
	{{ 6,  5,30,  0},{ 9,  7,35,  5},{ 7,  6,30,  5},{ 5,  5,25,  5},{ 3,  4,25,  5},{ 2,  3,20,  5},},//アンデッド退散
	{{ 8,  5,25,  0},{10,  7,30,  8},{ 8,  6,25,  8},{ 6,  5,25,  8},{ 4,  4,20,  8},{ 3,  3,20,  8},},//催眠
	{{11,  7,30,  0},{12,  8,35, 10},{ 9,  7,30, 10},{ 7,  6,25, 10},{ 5,  5,25, 10},{ 4,  4,20, 10},},//鬼火
	{{14,  8,40,  0},{13, 10,50, 15},{10,  9,45, 15},{ 9,  8,40, 15},{ 7,  6,35, 15},{ 6,  5,30, 15},},//耐地獄　
	{{18, 10,45,  0},{14, 11,50, 20},{12, 10,45, 20},{10, 10,40, 20},{ 8,  8,40, 20},{ 7,  7,35, 20},},//スケルトン生成
	{{20,  9,35,  0},{16, 14,50, 25},{14, 12,40, 25},{12, 11,35, 25},{10,  8,30, 25},{ 9,  7,25, 25},},//アンデッド説得
	/*:::死霊2*/
	{{22, 13,35,  0},{18, 17,45, 35},{16, 15,40, 35},{14, 13,35, 35},{13, 12,30, 35},{11,  9,27, 35},},//地獄の矢
	{{25, 13,30,  0},{20, 19,40, 30},{18, 16,35, 30},{16, 14,30, 30},{15, 12,30, 30},{13, 10,25, 30},},//悪霊召喚
	{{28, 24,45,  0},{25, 32,50, 35},{23, 28,45, 35},{20, 25,43, 35},{18, 20,40, 35},{14, 18,35, 35},},//念縛
	{{30, 15,55,  0},{27, 20,60, 30},{25, 17,60, 30},{22, 15,55, 30},{20, 12,50, 30},{18, 10,45, 30},},//残留思念解読
	{{34, 20,50,  0},{33, 30,60, 40},{28, 25,55, 40},{25, 21,50, 40},{23, 18,45, 40},{20, 15,40, 40},},//怨霊憑依
	{{36, 22,60,  0},{36, 35,70, 50},{32, 30,65, 50},{28, 25,60, 50},{25, 20,55, 50},{22, 17,50, 50},},//アンデッド一体召喚
	{{42, 21,75,  0},{99,  1,20,  5},{99,  1,20,  5},{30, 18,75, 80},{28, 15,70, 80},{25, 12,60, 80},},//魔力吸収
	{{45, 25,50,  0},{99,  1,20,  5},{42, 40,55, 60},{38, 37,50, 60},{35, 35,50, 60},{32, 30,45, 60},},//使嗾
	/*:::死霊3*/
	{{99,  1,20,  5},{32, 22,60, 50},{28, 18,57, 50},{25, 16,54, 50},{20, 14,50, 50},{18, 12,47, 50},},//死の言霊
	{{99,  1,20,  5},{99,  1,20,  5},{30, 26,56, 65},{27, 24,53, 65},{24, 20,50, 65},{20, 18,45, 65},},//精神感応
	{{99,  1,20,  5},{36, 48,80, 70},{33, 45,80, 70},{30, 44,75, 70},{27, 40,70, 70},{24, 35,65, 70},},//アンデッド魅了
	{{99,  1,20,  5},{99,  1,20,  0},{39, 50,65,100},{35, 40,60,100},{33, 30,55,100},{30, 25,48,100},},//死の光線
	{{99,  1,20,  5},{99,  1,20,  5},{43, 45,70,120},{38, 42,65,120},{35, 38,60,120},{32, 34,52,120},},//死霊のオーラ
	{{99,  1,20,  5},{42, 42,70, 80},{40, 40,68, 80},{38, 37,65, 80},{36, 34,60, 80},{34, 30,50, 80},},//呪殺法陣
	{{99,  1,20,  5},{48, 60,85,150},{45, 52,80,150},{40, 48,75,150},{38, 40,70,150},{36, 36,65,150},},//吸血鬼化
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{45, 80,90,150},{43, 75,85,150},{40, 70,80,150},},//上位アンデッド召喚
	/*:::死霊4*/
	{{99,  1,20,  5},{40, 62,92, 95},{35, 55,90, 95},{32, 51,85, 95},{28, 47,80, 95},{25, 41,73, 95},},//屍竜召喚
	{{99,  1,20,  5},{99,  1,20,  5},{41, 58,70, 85},{38, 53,65, 85},{35, 50,60, 85},{32, 45,55, 85},},//破滅の手
	{{99,  1,20,  5},{48, 52,80,105},{45, 48,80,105},{42, 44,76,105},{39, 40,70,105},{37, 35,65,105},},//地獄の嵐
	{{99,  1,20,  5},{48, 55,90,120},{46, 50,90,120},{44, 46,85,120},{42, 40,80,120},{40, 37,75,120},},//復讐の契約
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{48, 74,85,180},{45, 70,80,180},{42, 65,75,180},},//ソウルスティール
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{49,111,95,200},{47,100,90,200},{45, 90,85,200},},//幽体化
	{{99,  1,20,  5},{99,  1,20,  5},{50, 96,90,160},{50, 91,84,160},{48, 85,80,160},{47, 80,72,160},},//血の呪い
	{{99,  1,20,  5},{99,  1,20,  5},{99,  1,20,  5},{50,240,99,250},{50,230,95,250},{48,210,80,250},},//死者の秘宝→幽冥の鬼神
	},

	{
	/*:::混沌1*/
	{{ 3,  2,22,  0},{ 7,  2,30,  5},{ 5,  2,28,  5},{ 3,  2,23,  5},{ 1,  1,20,  5},{ 1,  1,15,  5},},//マジックミサイル
	{{ 4,  3,25,  0},{ 8,  4,32,  5},{ 6,  3,30,  5},{ 3,  3,25,  5},{ 1,  2,22,  5},{ 1,  1,15,  5},},//トラップ/ドア破壊→トラップ発動
	{{ 6,  4,30,  0},{11,  9,35,  5},{ 8,  8,35,  5},{ 4,  5,30,  5},{ 2,  2,25,  5},{ 2,  1,15,  5},},//閃光
	{{ 9,  6,35,  0},{12, 12,45,  6},{ 9, 10,40,  6},{ 6,  6,34,  6},{ 5,  5,30,  6},{ 4,  2,20,  6},},//混乱の手
	{{16, 14,45,  0},{15, 13,60,  8},{12, 11,60,  8},{10,  7,53,  8},{ 9,  6,48,  8},{ 6,  4,40,  8},},//魔力炸裂
	{{23, 18,45,  0},{18, 18,45, 10},{15, 13,50, 10},{15,  9,48, 10},{13,  9,45, 10},{10,  5,35, 10},},//ファイア・ボルト
	{{26, 24,45,  0},{99,  0, 0,  0},{18, 15,48, 20},{16, 12,48, 20},{14,  9,45, 20},{12,  6,35, 20},},//力の拳
	{{28, 25,50,  0},{24, 22,50, 40},{20, 20,50, 40},{18, 18,42, 40},{15, 10,35, 40},{14,  7,25, 40},},//テレポート
	/*:::混沌2*/
	{{29, 26,60,  0},{22, 18,45, 20},{21, 15,40, 20},{19, 13,30, 20},{17, 11,25, 20},{15,  9,20, 20},},//ワンダー
	{{32, 29,60,  0},{25, 20,45, 20},{23, 18,55, 20},{21, 15,50, 20},{19, 12,45, 20},{17, 10,35, 20},},//カオス・ボルト
	{{35, 35,70,  0},{99,  0, 0,  0},{26, 20,62, 50},{23, 16,55, 50},{21, 13,45, 50},{19, 11,35, 50},},//ソニックブーム
	{{38, 36,70,  0},{99,  0, 0,  0},{27, 22,65, 60},{25, 18,60, 60},{23, 15,50, 60},{21, 12,40, 60},},//破滅の矢
	{{41, 40,75,  0},{32, 30,55, 60},{28, 24,55, 60},{26, 19,55, 60},{24, 16,50, 60},{22, 13,40, 60},},//ファイアボール
	{{43, 35,65,  0},{34, 30,80, 65},{32, 27,70, 65},{28, 22,65, 65},{25, 18,60, 65},{23, 15,50, 65},},//テレポアウェイ
	{{46, 38,90,  0},{43, 40,90, 70},{38, 30,90, 70},{33, 25,85, 70},{30, 20,80, 70},{27, 17,70, 70},},//破壊
	{{49, 60,85,  0},{99,  0, 0,  0},{42, 50,85, 80},{38, 45,85, 80},{35, 40,80, 80},{30, 35,75, 80},},//ログルス発動
	/*:::混沌3*/
	{{99,  0, 0,  0},{28, 32,75, 80},{26, 30,70, 80},{23, 27,60, 80},{20, 24,55, 80},{18, 20,50, 80},},//他者変容
	{{99,  0, 0,  0},{99,  0, 0,  0},{33, 40,90,100},{30, 37,85,100},{27, 32,80,100},{24, 28,70,100},},//カロジアン
	{{99,  0, 0,  0},{99,  0, 0,  0},{35, 36,90,120},{32, 30,85,120},{29, 25,80,120},{26, 22,70,120},},//原子分解
	{{99,  0, 0,  0},{38, 40,70,100},{37, 32,90,100},{34, 28,90,100},{30, 25,85,100},{27, 22,75,100},},//現実変容
	{{99,  0, 0,  0},{40, 40,80,100},{38, 35,80,100},{35, 30,75,100},{32, 27,70,100},{29, 24,60,100},},//プラズマ球
	{{99,  0, 0,  0},{48,120,95,140},{45,100,95,140},{40, 90,95,140},{36, 80,90,140},{32, 65,85,140},},//混沌の刃
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{42, 40,85,120},{40, 36,80,120},{36, 33,70,120},},//マジックロケット
	{{99,  0, 0,  0},{45, 50,85,180},{45, 45,80,180},{44, 43,75,180},{42, 40,70,180},{38, 36,60,180},},//力場の球
	/*:::混沌4*/
	{{99,  0, 0,  0},{40, 70,95, 75},{36, 60,90, 75},{32, 55,85, 75},{30, 50,85, 75},{26, 45,80, 75},},//自己変容
	{{99,  0, 0,  0},{43, 45,90,120},{39, 40,90,120},{36, 35,85,120},{33, 32,80,120},{30, 28,75,120},},//境界伝送(仮)
	{{99,  0, 0,  0},{48, 70,95,150},{44, 65,90,150},{40, 55,90,150},{38, 48,85,150},{35, 43,80,150},},//空間歪曲
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{45, 80,90,180},{42, 75,85,180},{39, 60,75,180},},//ログルスのブレス
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{47, 66,90,150},{45, 58,85,150},{42, 52,75,150},},//魔力の嵐
	{{99,  0, 0,  0},{99,  0, 0,  0},{50,110,90,250},{48,100,90,250},{47, 90,90,250},{44, 75,80,250},},//混沌招来
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{49,110,90,200},{48,100,85,200},{46, 90,75,200},},//虚無招来
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{50,200,99,250},{50,180,95,250},{48,150,80,250},},//オープンパンドラ
	},

};

///mod160706 オカルト魔法用のデータ
//司書はとりあえず除外
magic_type occult_spell_base_info[32][6] =
	{
	/*:::秘術→怪異1*/
	{{99,  2,22,  0},{ 8, 14,30,  3},{ 5, 12,26,  3},{ 4, 10,23,  3},{ 2,  8,20,  3},{ 1,  7,15,  3},},//二宮金次郎
	{{99,  3,25,  0},{10, 10,30,  5},{ 8,  8,27,  5},{ 6,  7,25,  5},{ 4,  5,22,  5},{ 2,  3,20,  5},},//こっくりさん
	{{99,  6,30,  0},{15, 20,40,  8},{12, 18,35,  8},{ 9, 15,33,  8},{ 7, 11,30,  8},{ 5,  8,25,  8},},//行灯
	{{99,  8,35,  0},{24, 30,50, 20},{20, 25,45, 20},{15, 20,40, 20},{12, 15,35, 20},{10, 12,30, 20},},//肖像画
	{{99, 10,40,  0},{99,  0, 0,  0},{99,  0, 0,  0},{20, 25,45, 40},{18, 22,42, 40},{16, 18,38, 40},},//置いてけ堀
	{{99, 12,45,  0},{35, 50,60, 50},{30, 40,55, 50},{27, 36,50, 50},{24, 30,45, 50},{22, 24,40, 50},},//トイレの花子さん
	{{99, 16,45,  0},{40, 30,70, 60},{36, 25,65, 60},{32, 20,55, 60},{28, 16,50, 60},{25, 10,45, 60},},//赤マント青マント
	{{99, 20,50,  0},{99,  0, 0,  0},{42, 50,75, 80},{38, 43,70, 80},{35, 36,65, 80},{32, 27,60, 80},},//足洗邸
	/*:::秘術→怪異2*/
	{{99, 12,40,  0},{15, 20,45,  5},{10, 15,35,  5},{ 7, 10,30,  5},{ 5,  8,27,  5},{ 3,  6,24,  5},},//人面犬
	{{99, 12,40,  0},{20, 27,50, 10},{17, 24,45, 10},{14, 20,44, 10},{11, 15,40, 10},{ 9, 10,32, 10},},//隙間女
	{{99, 20,55,  0},{22, 32,50, 25},{20, 30,48, 25},{18, 25,43, 25},{15, 21,40, 25},{12, 15,35, 25},},//口裂け女
	{{99, 27,60,  0},{30, 50,70, 40},{26, 40,65, 40},{23, 36,60, 40},{20, 32,55, 40},{18, 25,50, 40},},//ターボ婆
	{{99, 18,55,  0},{32, 36,55, 60},{30, 30,52, 60},{27, 27,48, 60},{23, 20,45, 60},{20, 16,40, 60},},//番町皿屋敷
	{{99, 21,55,  0},{35, 40,60, 75},{32, 38,57, 75},{29, 35,53, 75},{26, 30,48, 75},{24, 25,45, 75},},//メリーさんの電話
	{{99, 22,60,  0},{99,  0, 0,  0},{40, 80,70, 90},{35, 72,65, 90},{32, 60,60, 90},{30, 50,55, 90},},//八尺さま
	{{99, 25,70,  0},{46, 60,85,100},{43, 50,82,100},{40, 48,80,100},{36, 44,75,100},{33, 40,70,100},},//くねくね(v1.1.19 猿の手から変更)
	/*:::秘術→怪異3*/
	{{99,  0, 0,  0},{14, 35,60,  7},{12, 32,55,  7},{ 8, 27,50,  7},{ 6, 24,45,  7},{ 4, 20,40,  7},},//UFO
	{{99,  0, 0,  0},{20, 40,55, 10},{16, 32,50, 10},{12, 28,44, 10},{10, 22,40, 10},{ 8, 18,36, 10},},//人体発火
	{{99,  0, 0,  0},{99,  0, 0,  0},{30, 45,60, 40},{25, 40,55, 40},{21, 32,50, 40},{18, 27,44, 40},},//ネッシー
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{30,  1,90, 70},{27,  1,80, 70},{24,  1,75, 70},},//猿の手(v1.1.19 三冊目に移動し少し性能変更)
	{{99,  0, 0,  0},{38, 50,70, 80},{36, 45,65, 80},{32, 40,60, 80},{29, 36,55, 80},{26, 32,50, 80},},//リトルグリーンマン
	{{99,  0, 0,  0},{45, 65,90,100},{43, 60,85,100},{40, 50,80,100},{36, 44,70,100},{32, 37,64,100},},//ドッペルゲンガー
	{{99,  0, 0,  0},{99,  0, 0,  0},{48, 65,85,120},{45, 60,83,120},{42, 55,80,120},{39, 47,75,120},},//MIB
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{48, 70,88,160},{45, 65,83,160},{42, 50,80,160},},//月面超文明の襲来
	/*:::秘術→怪異4*/
	{{99,  0, 0,  0},{24, 35,55, 50},{18, 30,50, 50},{16, 24,45, 50},{13, 20,40, 50},{10, 15,35, 50},},//エイボンの霧の車輪
	{{99,  0, 0,  0},{35, 30,65, 80},{30, 25,60, 80},{25, 20,55, 80},{22, 15,50, 80},{18, 12,35, 80},},//スレイマンの塵
	{{99,  0, 0,  0},{43, 75,83,100},{40, 70,80,100},{35, 60,75,100},{30, 50,70,100},{27, 40,65,100},},//異界との接触
 //	{{99,  0, 0,  0},{50, 40,60,100},{42, 35,55,100},{37, 30,50,100},{33, 20,45,100},{30, 18,40,100},},//異界への退散
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{37, 65,72,100},{33, 57,65,100},{30, 46,60,100},},//v1.1.96 アザトートの呪詛
	{{99,  0, 0,  0},{99,  0, 0,  0},{45,210,95,120},{41,200,90,120},{37,180,80,120},{35,150,75,120},},//黄金の蜂蜜酒製造
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{44,128,95,140},{40,100,90,140},{37, 80,85,140},},//イシスの封印
	{{99,  0, 0,  0},{50,120,95,160},{48,100,90,160},{46, 90,85,160},{43, 80,80,160},{40, 64,75,160},},//旧神の印
	{{99,  0, 0,  0},{99,  0, 0,  0},{99,  0, 0,  0},{50,120,95,200},{48, 96,90,200},{45, 77,85,200},},//ヨグ＝ソトートの一撃
	};



//v2.1.1 異変魔法のデータ
//司書はとりあえず除外
magic_type incident_spell_base_info[32][6] =
{
	//スカーレットデビル
	{{99,  0, 0,  0},{ 5,  4,30,  5},{ 3,  3,25,  5},{ 2,  2,23,  5},{ 1,  1,20,  5},{ 1,  1,15,  5},},//針弾
	{{99,  0, 0,  0},{20, 16,45, 30},{17, 14,40, 30},{15, 12,38, 30},{14, 10,35, 30},{12,  8,30, 30},},//レーザー
	{{99,  0, 0,  0},{40, 40,75, 80},{36, 36,67, 80},{32, 33,64, 80},{30, 30,60, 80},{28, 25,55, 80},},//腕力強化
	{{99,  0, 0,  0},{99,  0, 0,200},{49, 80,90,200},{45, 72,85,200},{43, 64,80,200},{40, 56,75,200},},//真紅の槍

	//クリーチャーレッド
	{{99,  0, 0,  0},{10,  8,35, 10},{ 7,  5,30, 10},{ 6,  4,28, 10},{ 5,  3,25, 10},{ 4,  2,20, 10},},//呪いの御札弾
	{{99,  0, 0,  0},{25, 35,60, 50},{20, 30,50, 50},{18, 25,43, 50},{16, 20,40, 50},{14, 18,35, 50},},//加速
	{{99,  0, 0,  0},{43, 45,85,100},{40, 40,80,100},{37, 36,78,100},{35, 32,75,100},{32, 27,70,100},},//炎熱ロケット弾
	{{99,  0, 0,  0},{99,  0, 0,160},{50, 40,90,160},{47, 35,85,160},{45, 30,80,160},{42, 25,74,160},},//スカベンジング

	//スノーブロッサム
	{{99,  0, 0,  0},{ 8, 10,40,  5},{ 6,  8,35,  5},{ 4,  5,30,  5},{ 3,  4,25,  5},{ 2,  3,20,  5},},//モンスター感知
	{{99,  0, 0,  0},{30, 32,55, 60},{25, 27,48, 60},{22, 23,43, 60},{20, 20,40, 60},{18, 17,35, 60},},//亡霊弾
	{{99,  0, 0,  0},{38, 40,60, 80},{35, 36,57, 80},{31, 33,53, 80},{29, 30,50, 80},{27, 25,45, 80},},//氷雪弾
	{{99,  0, 0,  0},{99,  0, 0,120},{99,  0, 0,120},{43, 66,80,120},{41, 60,70,120},{38, 55,65,120},},//破滅の御札弾

	//ブルーシーズン
	{{99,  0, 0,  0},{12, 20,35, 10},{10, 15,30, 10},{ 9, 12,28, 10},{ 8, 10,25, 10},{ 7,  8,20, 10},},//アイテム感知
	{{99,  0, 0,  0},{30, 40,50, 75},{25, 32,40, 75},{23, 28,38, 75},{21, 25,35, 75},{18, 20,30, 75},},//サーチ弾
	{{99,  0, 0,  0},{45, 60,75,100},{40, 50,70,100},{36, 45,65,100},{34, 40,60,100},{32, 35,55,100},},//元素耐性
	{{99,  0, 0,  0},{99,  0, 0,180},{99,  0, 0,180},{47, 70,90,180},{44, 60,85,180},{40, 50,80,180},},//爆風防御

	//イエローサブタレイニアン
	{{99,  0, 0,  0},{12, 15,50, 10},{10, 12,40, 10},{ 8, 10,35, 10},{ 6,  8,30, 10},{ 5,  6,25, 10},},//精神攻撃弾
	{{99,  0, 0,  0},{20, 36,55, 40},{16, 30,50, 40},{14, 24,45, 40},{12, 20,40, 40},{10, 18,35, 40},},//一時テレパス
	{{99,  0, 0,  0},{37, 40,80, 80},{33, 35,70, 80},{30, 30,65, 80},{27, 25,60, 80},{25, 22,55, 80},},//攻撃回避
	{{99,  0, 0,  0},{99,  0, 0,150},{46, 55,90,150},{44, 45,85,150},{42, 40,80,150},{39, 36,75,150},},//精神防壁

	//インペリシャブルムーン
	{{99,  0, 0,  0},{16, 15,45, 15},{14, 12,40, 15},{12, 10,38, 15},{10,  8,35, 15},{ 8,  6,30, 15},},//浄化の矢
	{{99,  0, 0,  0},{32, 40,70, 80},{28, 36,60, 80},{25, 33,53, 80},{23, 30,50, 80},{20, 25,45, 80},},//ボルト反射
	{{99,  0, 0,  0},{43, 50,80,100},{40, 40,75,100},{38, 35,73,100},{36, 30,70,100},{33, 25,65,100},},//対邪悪結界
	{{99,  0, 0,  0},{99,  0, 0,250},{99,  0, 0,250},{50,200,90,250},{47,150,85,250},{45,120,80,250},},//浄化の光

	//ビーストハードネス
	{{99,  0, 0,  0},{10, 15,45,  5},{ 7, 12,40,  5},{ 5, 10,35,  5},{ 4,  8,30,  5},{ 3,  6,25,  5},},//回復力強化
	{{99,  0, 0,  0},{27, 25,55, 40},{23, 20,48, 40},{20, 18,43, 40},{18, 16,40, 40},{16, 12,35, 40},},//猛禽弾
	{{99,  0, 0,  0},{42, 50,80, 80},{38, 40,70, 80},{35, 35,65, 80},{32, 30,60, 80},{30, 25,55, 80},},//群狼弾
	{{99,  0, 0,  0},{99,  0, 0,120},{48, 45,80,120},{43, 40,75,120},{40, 36,70,120},{37, 30,65,120},},//切れ味付与(仮)

	//シントイズムウィンド
	{{99,  0, 0,  0},{14, 18,30, 10},{12, 15,25, 10},{10, 12,23, 10},{ 9, 10,20, 10},{ 8,  8,15, 10},},//蛇弾
	{{99,  0, 0,  0},{35, 35,60, 60},{30, 30,55, 60},{27, 25,53, 60},{25, 20,50, 60},{23, 16,45, 60},},//蛙弾
	{{99,  0, 0,  0},{48, 50,75,120},{43, 40,70,120},{40, 36,65,120},{38, 30,60,120},{36, 25,55,120},},//カマイタチ
	{{99,  0, 0,  0},{99,  0, 0,200},{99,  0, 0,200},{50, 25,90,200},{48, 20,85,200},{45, 15,80,200},},//異変石増幅
};



magic_type hissatsu_info[32] =
{
		{ 1,   12,   0,   0},
		{ 3,   16,   0,   0},
		{ 6,   15,   0,   0},
		{ 9,   18,   0,   0},
		{ 10,   8,   0,   0},
		{ 12,  20,   0,   0},
		{ 14,   7,   0,   0},
		{ 17,  20,   0,   0},

		{ 19,  24,   0,   0},
		{ 22,  27,   0,   0},
		{ 24,  30,   0,   0},
		{ 25,  16,   0,   0},
		{ 27,  15,   0,   0},
		{ 29,  35,   0,   0},
		{ 32,  50,   0,   0},
		{ 35,  43,   0,   0},

		{ 18,  20,   0,   0},
		{ 22,  36,   0,   0},
		{ 24,  24,   0,   0},
		{ 26,  35,   0,   0},
		{ 30,  30,   0,   0},
		{ 32,  51,   0,   0},
		{ 36,  25,   0,   0},
		{ 39,  64,   0,   0},

		{ 26,  20,   0,   0},
		{ 29,  40,   0,   0},
		{ 31,  35,   0,   0},
		{ 36,  68,   0,   0},
		{ 39,  80,   0,   0},
		{ 42, 110,   0,   0},
		{ 45, 120,   0,   0},
		{ 50, 180,   0,   0}
};

///realm歌、剣術、呪術の各魔法のレベル、MP、失敗率、経験値
#if 0
const magic_type technic_info[NUM_TECHNIC][32] =
{
	{
		/* Music */
		{ 1,  1,  10,   2},
		{ 2,  1,  10,   2},
		{ 3,  2,  20,   3},
		{ 4,  2,  20,   4},
		{ 5,  2,  20,   6},
		{ 7,  4,  30,   8},
		{ 9,  3,  30,   10},
		{ 10, 2,  30,   12},

		{ 12,  3,   40,   20},
		{ 15, 16,  42,   35},
		{ 17, 18,  40,   25},
		{ 18,  2,  45,   30},
		{ 23,  8,  50,   38},
		{ 28, 30,  50,   41},
		{ 33, 35,  60,   42},
		{ 38, 35,  70,   46},

		{ 10,  4,  20,   13},
		{ 22,  5,  30,   26},
		{ 23,  3,  35,   27},
		{ 26,  28,  37,   29},
		{ 32,  37,  41,   36},
		{ 33,  22,  43,   40},
		{ 37,  35,  46,   42},
		{ 45,  60,  50,   56},

		{ 23,  18,  20,   23},
		{ 30,  30,  30,   26},
		{ 33,  65,  41,   30},
		{ 37,  35,  43,   35},
		{ 40,  30,  46,   50},
		{ 42,  75,  50,   68},
		{ 45,  58,  62,   73},
		{ 49,  48,  70,  200}
	},

	{
		/* Hissatsu */
		{ 1,   15,   0,   0},
		{ 3,   10,   0,   0},
		{ 6,   15,   0,   0},
		{ 9,    8,   0,   0},
		{ 10,  12,   0,   0},
		{ 12,  25,   0,   0},
		{ 14,   7,   0,   0},
		{ 17,  20,   0,   0},

		{ 19,  10,   0,   0},
		{ 22,  20,   0,   0},
		{ 24,  30,   0,   0},
		{ 25,  10,   0,   0},
		{ 27,  15,   0,   0},
		{ 29,  45,   0,   0},
		{ 32,  70,   0,   0},
		{ 35,  50,   0,   0},

		{ 18,  40,   0,   0},
		{ 22,  22,   0,   0},
		{ 24,  30,   0,   0},
		{ 26,  35,   0,   0},
		{ 30,  30,   0,   0},
		{ 32,  60,   0,   0},
		{ 36,  40,   0,   0},
		{ 39,  80,   0,   0},

		{ 26,  20,   0,   0},
		{ 29,  40,   0,   0},
		{ 31,  35,   0,   0},
		{ 36,  80,   0,   0},
		{ 39, 100,   0,   0},
		{ 42, 110,   0,   0},
		{ 45, 130,   0,   0},
		{ 50, 255,   0,   0}
	},

	{
		/* Hex */
		{  1,  2, 20,   2},
		{  1,  2, 20,   2},
		{  3,  2, 30,   3},
		{  5,  3, 30,   4},
		{  7,  3, 40,   6},
		{  8, 10, 60,   8},
		{  9,  3, 30,  10},
		{ 10,  5, 40,  12},

		{ 12,  8, 40,  15},
		{ 12,  9, 35,  15},
		{ 15, 10, 50,  20},
		{ 20, 12, 45,  35},
		{ 25, 15, 50,  50},
		{ 30, 12, 60,  70},
		{ 35, 10, 60,  80},
		{ 40, 16, 70, 100},

		{ 15,  8, 20,  20},
		{ 18, 15, 50,  20},
		{ 22, 10, 65,  35},
		{ 25, 28, 70,  50},
		{ 28, 10, 70,  60},
		{ 30, 20, 60,  60},
		{ 36, 22, 70,  80},
		{ 40, 28, 70, 100},

		{  5,  6, 35,   5},
		{ 22, 24, 70,  40},
		{ 25,  2, 65,  50},
		{ 32, 20, 50,  70},
		{ 35, 35, 70,  80},
		{ 38, 32, 70,  90},
		{ 42, 24, 70, 120},
		{ 46, 45, 80, 200}
	},
};
#endif

/*
 * Zangband uses this array instead of the spell flags table, as there
 * are 5 realms of magic, each with 4 spellbooks and 8 spells per book -- TY
 */
const u32b fake_spell_flags[4]=
{
	0x000000ff,
	0x0000ff00,
	0x00ff0000,
	0xff000000
};

#if 0
///realm class
const s32b realm_choices1[MAX_CLASS] =
{
	(CH_NONE),				/* Warrior */
	(CH_LIFE | CH_SORCERY | CH_NATURE |
	 CH_CHAOS | CH_DEATH | CH_TRUMP |
	 CH_ARCANE | CH_ENCHANT | CH_DAEMON |
	 CH_CRUSADE),                              /* Mage */
	(CH_LIFE | CH_DEATH | CH_DAEMON |
	 CH_CRUSADE),                              /* Priest */
	(CH_SORCERY | CH_DEATH | CH_TRUMP |
	 CH_ARCANE | CH_ENCHANT),               /* Rogue */
	(CH_NATURE),                            /* Ranger */
	(CH_CRUSADE | CH_DEATH),                   /* Paladin */
	(CH_ARCANE),                            /* Warrior-Mage */
	(CH_CHAOS | CH_DAEMON),                 /* Chaos-Warrior */
	(CH_LIFE | CH_NATURE | CH_DEATH |
	 CH_ENCHANT),                           /* Monk */
	(CH_NONE),                              /* Mindcrafter */
	(CH_LIFE | CH_SORCERY | CH_NATURE |
	 CH_CHAOS | CH_DEATH | CH_TRUMP |
	 CH_ARCANE | CH_ENCHANT | CH_DAEMON |
	 CH_CRUSADE | CH_HEX),                  /* High-Mage */
	(CH_ARCANE),                            /* Tourist */
	(CH_NONE),                              /* Imitator */
	(CH_TRUMP),                             /* Beastmaster */
	(CH_NONE),                              /* Sorcerer */
	(CH_NONE),                              /* Archer */
	(CH_NONE),                              /* Magic eater */
	(CH_MUSIC),                             /* Bard */
	(CH_NONE),                              /* Red Mage */
	(CH_HISSATSU),                          /* Samurai */
	(CH_LIFE | CH_NATURE | CH_DEATH |
	 CH_ENCHANT | CH_CRUSADE),                 /* ForceTrainer */
	(CH_NONE),                              /* Blue Mage */
	(CH_NONE),				/* Cavalry */
	(CH_NONE),				/* Berserker */
	(CH_NONE),				/* Weaponsmith */
	(CH_NONE),				/* Mirror-master */
	(CH_NONE),				/* Ninja */
	(CH_NONE),				/* Sniper */
};

///realm class
const s32b realm_choices2[MAX_CLASS] =
{
	(CH_NONE),                              /* Warrior */
	(CH_LIFE | CH_SORCERY | CH_NATURE |
	 CH_CHAOS | CH_DEATH | CH_TRUMP |
	 CH_ARCANE | CH_ENCHANT | CH_DAEMON |
	 CH_CRUSADE),                              /* Mage */
	(CH_LIFE | CH_SORCERY | CH_NATURE |
	 CH_CHAOS | CH_DEATH | CH_TRUMP |
	 CH_ARCANE | CH_ENCHANT | CH_DAEMON |
	 CH_CRUSADE),                              /* Priest */
	(CH_NONE),                              /* Rogue */
	(CH_SORCERY | CH_CHAOS | CH_DEATH |
	 CH_TRUMP | CH_ARCANE | CH_DAEMON),     /* Ranger */
	(CH_NONE),                              /* Paladin */
	(CH_LIFE | CH_NATURE | CH_CHAOS |
	 CH_DEATH | CH_TRUMP | CH_ARCANE |
	 CH_SORCERY | CH_ENCHANT | CH_DAEMON |
	 CH_CRUSADE),                              /* Warrior-Mage */
	(CH_NONE),                              /* Chaos-Warrior */
	(CH_NONE),                              /* Monk */
	(CH_NONE),                              /* Mindcrafter */
	(CH_NONE),                              /* High-Mage */
	(CH_NONE),                              /* Tourist */
	(CH_NONE),                              /* Imitator */
	(CH_NONE),                              /* Beastmanster */
	(CH_NONE),                              /* Sorcerer */
	(CH_NONE),                              /* Archer */
	(CH_NONE),                              /* Magic eater */
	(CH_NONE),                              /* Bard */
	(CH_NONE),                              /* Red Mage */
	(CH_NONE),                              /* Samurai */
	(CH_NONE),                              /* ForceTrainer */
	(CH_NONE),                              /* Blue Mage */
	(CH_NONE),				/* Cavalry */
	(CH_NONE),				/* Berserker */
	(CH_NONE),				/* Weaponsmith */
	(CH_NONE),				/* Mirror-master */
	(CH_NONE),				/* Ninja */
	(CH_NONE),				/* Sniper */
};
#endif

#ifdef JP
const cptr realm_names[TV_BOOK_END+1] =
{
	"ダミー",
	"元素",
	"予見",
	"付与",
	"召喚",
	"神秘",
	"生命",
	"破邪",
	"自然",
	"変容",
	"暗黒",
	"死霊",
	"混沌",
	"武芸",
	"調剤",
	"怪異",
	"異変",
};
#endif

#ifdef JP
const cptr E_realm_names[TV_BOOK_END+1]
#else
const cptr realm_names[]
#endif
= {
	"none",
	"Elements",
	"Divination",
	"Enchantment",
	"Summoning",
	"Mysticism",
	"Life",
	"Exorcism",
	"Nature",
	"Transformation",
	"Darkness",
	"Necromancy",
	"Chaos",
	"Swordsmanship",
	"Pharmacy",
	"Phenomena",
	"Incidents",
};
/*:::魔法領域名一覧　添字は*/
/*
#ifdef JP
const cptr realm_names[] =
{
	"魔法なし",
	"生命",
	"仙術",
	"自然",
	"カオス",
	"暗黒",
	"トランプ",
	"秘術",
	"匠",
	"悪魔",
	"破邪",
	"不明",
	"不明",
	"不明",
	"不明",
	"不明",
	"歌",
	"武芸",
	"呪術",
	"不明"
};
#endif

#ifdef JP
const cptr E_realm_names[]
#else
const cptr realm_names[]
#endif
= {
	"none",
	"Life",
	"Sorcery",
	"Nature",
	"Chaos",
	"Death",
	"Trump",
	"Arcane",
	"Craft",
	"Daemon",
	"Crusade",
	"unknown",
	"unknown",
	"unknown",
	"unknown",
	"unknown",
	"Music",
	"Kendo",
	"Hex",
	"unknown"
};
*/

//v1.1.97 chest_traps[]に代わってこちらの箱トラップリストを使う。
//o_ptr->pval(1~60?)がインデックスになる。pvalが負なら解除済み、0なら空
//ビットフラグを使うのをやめマルチトラップを廃止。0は施錠
//過去のバージョンで生成された箱の施錠/解錠状態と互換を取るため0の部分は変えない

//ここを変えるときはactivate_chest_trap(),object_desc()の該当部分も変える
const int chest_new_traps[CHEST_TRAP_LIST_LENGTH] =
{
	CHEST_TRAP_NOTHING,                                      /* 0 == empty */
	CHEST_TRAP_LOSE_STR,
	CHEST_TRAP_LOSE_CON,
	CHEST_TRAP_ALARM,
	CHEST_TRAP_SLINGSHOT,
	CHEST_TRAP_PUNCH,             /* 5 == best small wooden */
	CHEST_TRAP_NOTHING,//←ここを0から変えると過去のバージョンで生成されたクエスト報酬箱などが罠付きに変化するので変えない
	CHEST_TRAP_LOSE_STR,
	CHEST_TRAP_LOSE_CON,
	CHEST_TRAP_LOSE_MAG,
	CHEST_TRAP_BA_POIS,
	CHEST_TRAP_BA_POIS,
	CHEST_TRAP_SLINGSHOT,
	CHEST_TRAP_BA_SLEEP,
	CHEST_TRAP_BA_CONF,
	CHEST_TRAP_ARROW,                 /* 15 == best large wooden */
	0,
	CHEST_TRAP_MIMIC,
	CHEST_TRAP_MIMIC,
	CHEST_TRAP_LOSE_MAG,
	CHEST_TRAP_BA_SLEEP,
	CHEST_TRAP_BA_CONF,
	CHEST_TRAP_SUMMON,
	CHEST_TRAP_ARROW,
	CHEST_TRAP_PUNCH,
	CHEST_TRAP_BA_TIME,                        /* 25 == best small iron */
	CHEST_TRAP_NOTHING,
	CHEST_TRAP_S_BIRD,
	CHEST_TRAP_S_ELEMENTAL,
	CHEST_TRAP_S_DEMON,
	CHEST_TRAP_S_DRAGON,
	CHEST_TRAP_S_CHIMERA,
	CHEST_TRAP_S_VORTEX,
	CHEST_TRAP_S_KWAI,
	CHEST_TRAP_BA_BERSERK,
	CHEST_TRAP_TELEPORTER, /* 35 == best large iron */
	CHEST_TRAP_NOTHING,
	CHEST_TRAP_BA_BERSERK,
	CHEST_TRAP_STEEL_ARROW,
	CHEST_TRAP_STEEL_ARROW,
	CHEST_TRAP_EXPLODE,
	CHEST_TRAP_TELEPORTER,
	CHEST_TRAP_BR_FIRE,
	CHEST_TRAP_BR_ACID,
	CHEST_TRAP_BA_TIME,
	CHEST_TRAP_MAGIC_DRAIN,        /* 45 == best small steel */
	CHEST_TRAP_NOTHING,
	CHEST_TRAP_BR_FIRE,
	CHEST_TRAP_BR_ACID,
	CHEST_TRAP_EXPLODE,
	CHEST_TRAP_SUIKI,
	CHEST_TRAP_RUIN,
	CHEST_TRAP_TELEPORTER,
	CHEST_TRAP_MAGIC_DRAIN,
	CHEST_TRAP_FUSION,
	CHEST_TRAP_FUSION,  /* 55 == best large steel */
	CHEST_TRAP_FUSION,//ここから下は多分出ない
	CHEST_TRAP_FUSION,
	CHEST_TRAP_FUSION,
	CHEST_TRAP_FUSION,
	CHEST_TRAP_FUSION,
	CHEST_TRAP_FUSION,
	CHEST_TRAP_FUSION,
	CHEST_TRAP_FUSION,

};



/*
 * Each chest has a certain set of traps, determined by pval
 * Each chest has a "pval" from 1 to the chest level (max 55)
 * If the "pval" is negative then the trap has been disarmed
 * The "pval" of a chest determines the quality of its treasure
 * Note that disarming a trap on a chest also removes the lock.
 */
const int chest_traps[64] =
{
	0,                                      /* 0 == empty */
	(CHEST_POISON),
	(CHEST_LOSE_STR),
	(CHEST_LOSE_CON),
	(CHEST_LOSE_STR),
	(CHEST_LOSE_CON),                       /* 5 == best small wooden */
	0,
	(CHEST_ALARM),
	(CHEST_ALARM),
	(CHEST_LOSE_STR),
	(CHEST_LOSE_CON),
	(CHEST_POISON),
	(CHEST_SCATTER),
	(CHEST_LOSE_STR | CHEST_LOSE_CON),
	(CHEST_LOSE_STR | CHEST_LOSE_CON),
	(CHEST_SUMMON),                 /* 15 == best large wooden */
	0,
	(CHEST_ALARM),
	(CHEST_SCATTER),
	(CHEST_PARALYZE),
	(CHEST_LOSE_STR | CHEST_LOSE_CON),
	(CHEST_SUMMON),
	(CHEST_PARALYZE),
	(CHEST_LOSE_STR),
	(CHEST_LOSE_CON),
	(CHEST_EXPLODE),                        /* 25 == best small iron */
	0,
	(CHEST_E_SUMMON),
	(CHEST_POISON | CHEST_LOSE_CON),
	(CHEST_LOSE_STR | CHEST_LOSE_CON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_BIRD_STORM),
	(CHEST_POISON | CHEST_SUMMON),
	(CHEST_E_SUMMON | CHEST_ALARM),
	(CHEST_EXPLODE),
	(CHEST_EXPLODE | CHEST_SUMMON), /* 35 == best large iron */
	0,
	(CHEST_SUMMON | CHEST_ALARM),
	(CHEST_EXPLODE),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_POISON | CHEST_PARALYZE),
	(CHEST_EXPLODE),
	(CHEST_BIRD_STORM),
	(CHEST_EXPLODE | CHEST_E_SUMMON | CHEST_ALARM),
	(CHEST_H_SUMMON),        /* 45 == best small steel */
	0,
	(CHEST_EXPLODE | CHEST_SUMMON | CHEST_ALARM),
	(CHEST_BIRD_STORM),
	(CHEST_RUNES_OF_EVIL),
	(CHEST_EXPLODE | CHEST_SUMMON | CHEST_ALARM),
	(CHEST_BIRD_STORM | CHEST_ALARM),
	(CHEST_H_SUMMON | CHEST_ALARM),
	(CHEST_RUNES_OF_EVIL),
	(CHEST_H_SUMMON | CHEST_SCATTER | CHEST_ALARM),
	(CHEST_RUNES_OF_EVIL | CHEST_EXPLODE),  /* 55 == best large steel */
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
	(CHEST_EXPLODE | CHEST_SUMMON),
};


/*
 * Class titles for the player.
 *
 * The player gets a new title every five levels, so each class
 * needs only ten titles total.
 */
///del140126 職業ごとの称号みたいなのを不使用に
#if 0
#ifdef JP
const cptr player_title[MAX_CLASS][PY_MAX_LEVEL / 5] =
{
	/* Warrior */
	{
		"新参兵",
		"兵士",
		"傭兵",
		"古参兵",
		"剣士",
		"闘士",
		"英雄",
		"男爵",
		"伯爵",
		"君主",
	},

	/* Mage */
	{
				/*"見習い",*/
		"練習生",                 /*丁稚、練習生 */
		"奇術師",               /*詐欺師、ペテン師 */
		"幻術師",
		"呪術師",
		"召霊師",
		"召魔師",
		"魔術師",
		"魔道師",
		"イプシシマス",
		"大魔道師",
	},

	/* Priest */
	{
		"信者",                 /*信徒 */
		"侍僧",             /*教会奉仕者、見習い僧、伴僧、従者 */
		"熟練僧",
		"聖職者",                 /*聖職者 */
		"伝道師",               /*司祭評議員、修道会会員 */
		"牧師",               /*ラマ教の僧 */
		"聖人",               /*大司教、総主教、総大司教 */
		"祭司",                 /*祭司、司祭 */
		"祭司長",               /*大祭司、祭司長 */
		"教皇",
	},

	/* Rogues */
	{
		/* "ごろつき",*/                     /*ごろつき、風来坊、浮浪者 */
		"すり",
		"追いはぎ",                     /*追い剥ぎ、強盗、泥棒 */
		"夜盗",                         /*強盗、夜盗、泥棒 */
		"こそ泥",                       /*こそ泥、小泥棒 */
		"ペテン師",                     /*博徒、ペテン師、詐欺師 */
		"ロウシーフ",
		"ハイシーフ",
		"マスター", /* "マスターシーフ", */
		"アサシン",						/* 暗殺者 */
		"頭領", /*"ギルドマスター",*/
	},

	/* Rangers */
	{
		"使い走り",
		"馳夫",
		"斥候",                         /*斥候、見張り、偵察兵 */
		"狩人",
		"追跡者",
		"先導者",
		"探険者",                       /*開拓者、探険者 */
		"野伏",
		"野伏頭",
		"野伏の総領",
	},

	/* Paladins */
	{
		"勇士",                 /*色男、愛人、しゃれ者、勇敢な人 */
		"衛士",
		"保護者",
		"防衛者",
		"護衛者",
		"騎士",
		"重騎士",
		"聖騎士",
		"上級聖騎士",
		"聖騎士団長",
	},

	/* Warrior-Mage */
	{
		"見習い",
		"徒弟",			/*丁稚、練習生 */
		"一人前",
		"古参兵",
		"魔術兵士",
		"魔術闘士",
		"魔術の英雄", /* Mage-Hero */
		"魔男爵",
		/* "魔公爵", */
		"戦闘魔術士",
		"知識の守護者", /* "ウィザードロード", */
	},

	/* Chaos Warrior */
	{
		"新参兵",
		"兵士",
		"傭兵",
		"古参兵",
		"剣士",
		"闘士",
		"混沌の英雄",
		"混沌の男爵",
		"混沌の公爵",
		"混沌の王者",
	},

	/* Monk */
	{
		"入門者",
		"弟子",
		"直弟子",
		"師範代",
		"師範",
		"道場主",
		"名人",
		"大名人",
		"拳聖",
		"拳神",
	},

	/* Mindcrafter */
	{
		"練習生",
		"見習い",
		"熟練士",
		"熟達士",
		"黙想士",
		"心術士",
		"サイキック",
		"サイオニック",
		"超能力者",
		"精神の支配者", /* "マインドマスター", */
	},

	/* High Mage; same as Mage */
	{
				/*"見習い",*/
		"練習生",                 /*丁稚、練習生 */
		"奇術師",               /*詐欺師、ペテン師 */
		"幻術師",
		"呪術師",
		"召霊師",
		"召魔師",
		"魔術師",
		"魔道師",
		"イプシシマス",
		"大魔道師",
	},

	/* Tourist */
	{
		"プー太郎",
		"観光客",
		"周遊旅行者",
		"遍歴者",
		"旅行者",
		"放浪者", /* "旅人", */
		"航海者",
		"探検家",
		"冒険家",
		"スペランカー",
	},

	/* Imitator */
	{
		"これから",
		"いまいち",
		"まだまだ",
		"ぼちぼち",
		"そこそこ",
		"まあまあ",
		"なかなか",
		"いけいけ",
		"そうとう",
		"えらい",
	},

	/* Beastmaster */
	{
		"イモリ使い",
		"ヘビ使い",
		"クモ使い",
		"狼使い",
		"トラ使い",
		"甲虫使い",
		"ヒドラ使い",
		"ハウンド使い",
		"ムーマク使い",
		"ドラゴン使い",
	},

	/* Sorcerer; same as Mage */
	{
				/*"見習い",*/
		"練習生",                 /*丁稚、練習生 */
		"奇術師",               /*詐欺師、ペテン師 */
		"幻術師",
		"呪術師",
		"召霊師",
		"召魔師",
		"魔術師",
		"魔道師",
		"イプシシマス",
		"大魔道師",
	},

	/* Archer */
	{
		"新参兵",
		"兵士",
		"傭兵",
		"古参兵",
		"剣士",
		"闘士",
		"英雄",
		"男爵",
		"伯爵",
		"領主",
	},

	/* Magic eater */
	{
		"無知なる者",
		"入門者",
		"奇術師",
		"秘術師",
		"秘術師",
		"熟練者",
		"達人",
		"達人",
		"魔道師",
		"全てを知る者",
	},

	/* Bard */
	{
		"見習い",	/*"Apprentice"*/
		"作曲家",	/*"Songsmith"*/
		"吟遊詩人",	/*"Bard"*/
		"コンパニオン",	/*"Companion"*/
		"心の癒し手",	/*"Minstrel"*/
		"竪琴師",	/*"Harper"*/
		"伝承の紡ぎ手",	/*"Loreweaver"*/
		"詩神の申し子",	/*"Muse"*/
		"夢紡ぎ",	/*"Dreamweaver"*/
		"マスター",	/*"Master Harper"*/
	},

	/* Red Mage; same as Warrior-Mage */
	{
		"見習い",
		"徒弟",			/*丁稚、練習生 */
		"一人前",
		"古参兵",
		"魔術兵士",
		"魔術闘士",
		"魔術の英雄", /* Mage-Hero */
		"魔男爵",
		/* "魔公爵", */
		"戦闘魔術士",
		"知識の守護者", /* "ウィザードロード", */
	},

	/* Samurai */
	{
		"入門者",
		"弟子",
		"直弟子",
		"師範代",
		"師範",
		"道場主",
		"名人",
		"大名人",
		"剣聖",
		"剣神",
	},

	/* ForceTrainer; same as Monk(?) */
	{
		"入門者",
		"弟子",
		"直弟子",
		"師範代",
		"師範",
		"道場主",
		"名人",
		"大名人",
		"拳聖",
		"拳神",
	},

	/* Blue Mage; same as Mage */
	{
				/*"見習い",*/
		"練習生",                 /*丁稚、練習生 */
		"奇術師",               /*詐欺師、ペテン師 */
		"幻術師",
		"呪術師",
		"召霊師",
		"召魔師",
		"魔術師",
		"魔道師",
		"イプシシマス",
		"大魔道師",
	},

	/* Cavalry */
	{
		"新参兵",
		"兵士",
		"傭兵",
		"古参兵",
		"剣士",
		"闘士",
		"英雄",
		"男爵",
		"伯爵",
		"領主",
	},

	/* Berserker */
	{
		"バーサーカー",
		"バーサーカー",
		"バーサーカー",
		"怒りの公爵",
		"怒りの公爵",
		"怒りの公爵",
		"怒りの王",
		"怒りの王",
		"怒りの王",
		"怒りの化身",
	},

	/* Weaponsmith */
	{
		"銅を鍛えし者",
		"鉄を鍛えし者",
		"鋼を鍛えし者",
		"銀を鍛えし者",
		"竜を鍛えし者",
		"霊を鍛えし者",
		"魔を鍛えし者",
		"魂を鍛えし者",
		"神を鍛えし者",
		"全を鍛えし者",
	},

	/* Mirror Master */
	{
		"鏡を見る人",
		"鏡磨き",
		"鏡職人",
		"鏡術師",
		"鏡導師",
		"鏡の賢者",
		"鏡の王",
		"鏡の皇帝",
		"鏡の化身",
		"ラフノール王",
	},
	/* Ninja */
	{
		"訓練生",
		"仕手",
		"熟達者",
		"短刀使い",
		"切り裂き",
		"凄腕",
		"漆黒の刃",
		"闇の一撃",
		"暗殺者",
		"死の長き腕",
	},

	/* Sniper */
	{
		"新参兵",
		"兵士",
		"傭兵",
		"古参兵",
		"剣士",
		"闘士",
		"英雄",
		"男爵",
		"伯爵",
		"領主",
	},
};

#else
const cptr player_title[MAX_CLASS][PY_MAX_LEVEL / 5] =
{
	/* Warrior */
	{
		"Rookie",
		"Soldier",
		"Mercenary",
		"Veteran",
		"Swordsman",
		"Champion",
		"Hero",
		"Baron",
		"Duke",
		"Lord",
	},

	/* Mage */
	{
		"Apprentice",
		"Trickster",
		"Illusionist",
		"Spellbinder",
		"Evoker",
		"Conjurer",
		"Warlock",
		"Sorcerer",
		"Ipsissimus",
		"Archimage",
	},

	/* Priest */
	{
		"Believer",
		"Acolyte",
		"Adept",
		"Curate",
		"Canon",
		"Priest",
		"High Priest",
		"Cardinal",
		"Inquisitor",
		"Pope",
	},

	/* Rogues */
	{
		"Cutpurse",
		"Robber",
		"Burglar",
		"Filcher",
		"Sharper",
		"Low Thief",
		"High Thief",
		"Master Thief",
		"Assassin",
		"Guildmaster",
	},

	/* Rangers */
	{
		"Runner",
		"Strider",
		"Scout",
		"Courser",
		"Tracker",
		"Guide",
		"Pathfinder",
		"Low Ranger",
		"High Ranger",
		"Ranger Lord",
	},

	/* Paladins */
	{
		"Gallant",
		"Keeper",
		"Protector",
		"Defender",
		"Warder",
		"Knight",
		"Guardian",
		"Low Paladin",
		"High Paladin",
		"Paladin Lord",
	},

	/* Warrior-Mage */
	{
		"Novice",
		"Apprentice",
		"Journeyman",
		"Veteran",
		"Enchanter",
		"Champion",
		"Mage-Hero",
		"Baron Mage",
		"Battlemage",
		"Wizard Lord",
	},

	/* Chaos Warrior */
	{
		"Rookie",
		"Soldier",
		"Mercenary",
		"Veteran",
		"Swordsman",
		"Champion",
		"Chaos Hero",
		"Chaos Baron",
		"Chaos Duke",
		"Chaos Lord",
	},

	/* Monk */
	{
		"Initiate",
		"Brother",
		"Disciple",
		"Immaculate",
		"Master",
		"Soft Master",
		"Hard Master",
		"Flower Master",
		"Dragon Master",
		"Grand Master",
	},

	/* Mindcrafter */
	{
		"Trainee",
		"Acolyte",
		"Adept",
		"Immaculate",
		"Contemplator",
		"Mentalist",
		"Psychic",
		"Psionicist",
		"Esper",
		"Mindmaster",
	},

	/* High Mage; same as Mage */
	{
		"Apprentice",
		"Trickster",
		"Illusionist",
		"Spellbinder",
		"Evoker",
		"Conjurer",
		"Warlock",
		"Sorcerer",
		"Ipsissimus",
		"Archimage",
	},

	/* Tourist */
	{
		"Rambler",
		"Sightseer",
		"Excursionist",
		"Peregrinator",
		"Traveler",
		"Journeyer",
		"Voyager",
		"Explorer",
		"Adventurer",
		"Spelunker",
	},

	/* Imitator */
	{
		"Yet",
		"Lacks",
		"Still more",
		"So so",
		"All right",
		"Not bad",
		"Considerable",
		"Go go",
		"Sizable",
		"Great man",
	},

	/* BeastMaster */
	{
		"Newt Master",
		"Snake Master",
		"Spider Master",
		"Wolf Master",
		"Tiger Master",
		"Beetle Master",
		"Hydra Master",
		"Hound Master",
		"Mumak Master",
		"Dragon Master",
	},

	/* Sorcerer */
	{
		"Apprentice",
		"Trickster",
		"Illusionist",
		"Spellbinder",
		"Evoker",
		"Conjurer",
		"Warlock",
		"Sorcerer",
		"Ipsissimus",
		"Archimage",
	},

	/* Archer */
	{
		"Rookie",
		"Soldier",
		"Mercenary",
		"Veteran",
		"Bowman",
		"Champion",
		"Hero",
		"Baron",
		"Duke",
		"Lord",
	},

	/* Magic eater */
	{
		"Apprentice",
		"Beginner",
		"Jagguler",
		"Skilled",
		"Conjurer",
		"Magician",
		"Master",
		"Master",
		"Wizard",
		"Almighty",
	},

	/* Bard */
	{
		"Apprentice",	/*"Apprentice"*/
		"Songsmith",	/*"Songsmith"*/
		"Bard",	/*"Bard"*/
		"Companion",	/*"Companion"*/
		"Minstrel",	/*"Minstrel"*/
		"Harper",	/*"Harper"*/
		"Loreweaver",	/*"Loreweaver"*/
		"Muse",	/*"Muse"*/
		"Dreamweaver",	/*"Dreamweaver"*/
		"Master Harper",	/*"Master Harper"*/
	},

	/* Red Mage */
	{
		"Novice",
		"Apprentice",
		"Journeyman",
		"Veteran",
		"Enchanter",
		"Champion",
		"Mage-Hero",
		"Baron Mage",
		"Battlemage",
		"Wizard Lord",
	},

	/* Samurai */
	{
		"Initiate",
		"Brother",
		"Disciple",
		"Immaculate",
		"Master",
		"Soft Master",
		"Hard Master",
		"Flower Master",
		"Dragon Master",
		"Grand Master",
	},

	/* ForceTrainer */
	{
		"Initiate",
		"Brother",
		"Disciple",
		"Immaculate",
		"Master",
		"Soft Master",
		"Hard Master",
		"Flower Master",
		"Dragon Master",
		"Grand Master",
	},

	/* Blue Mage */
	{
		"Apprentice",
		"Trickster",
		"Illusionist",
		"Spellbinder",
		"Evoker",
		"Conjurer",
		"Warlock",
		"Sorcerer",
		"Ipsissimus",
		"Archimage",
	},

	/* Warrior */
	{
		"Rookie",
		"Soldier",
		"Mercenary",
		"Veteran",
		"Swordsman",
		"Champion",
		"Hero",
		"Baron",
		"Duke",
		"Lord",
	},

	/* Berserker */
	{
		    "Berserker",
		    "Berserker",
		    "Berserker",
		    "Rage Prince",
		    "Rage Prince",
		    "Rage Prince",
		    "Rage King",
		    "Rage King",
		    "Rage King",
		    "God of Rage",
	},

	/* Weaponsmith */
	{
		"Copper smith",
		"Iron smith",
		"Steel smith",
		"Silver smith",
		"Dragon smith",
		"Spirit smith",
		"Magic smith",
		"Soul smith",
		"God smith",
		"AlmightySmith",
	},

	/* Mirror Master */
	{
		"Mirrorstarer",
		"Mirrorcleaner",
		"Mirrormaker",
		"Mirrormagician",
		"Mirror Guru",
		"Mirror Mage",
		"Mirror King",
		"Mirror Emperor",
		"Mirror Avatar",
		"Ruffnor King",
	},

	/* Ninja */
	{
		"Trainee",
		"Myrmidon",
		"Initiate",
		"Knifer",
		"Bladesman",
		"Hashishin",
		"Black Dagger",
		"Shadowstrike",
		"Assassinator",
		"Death Lord",
	},

	/* Sniper */
	{
		"Rookie",
		"Soldier",
		"Mercenary",
		"Veteran",
		"Swordsman",
		"Champion",
		"Hero",
		"Baron",
		"Duke",
		"Lord",
	},
};
#endif
#endif




const monster_power monster_powers[MAX_MONSPELLS] =
{
/* level,  smana,  %fail,  manedam,  %manefail,  use_stat, name */
#ifdef JP
{  1,   1,  10,    0,  15, A_CON,  "叫ぶ"},
{ 10,   4,  35,   89,  40, A_INT,  "何か"},
{ 40,  35,  85,    0,  40, A_INT,  "魔力消去"},
{ 35,  30,  80,  800,  70, A_STR,  "ロケット"},
{  5,   1,  20,   18,  15, A_DEX,  "射撃"},
{ 10,   4,  35,   89,  40, A_INT,  "何か"},
{ 10,   4,  35,   89,  40, A_INT,  "何か"},
{ 10,   4,  35,   89,  40, A_INT,  "何か"},
{ 20,  15,  55, 1600,  95, A_CON,  "酸のブレス"},
{ 20,  15,  55, 1600,  95, A_CON,  "電撃のブレス"},
{ 20,  15,  55, 1600,  95, A_CON,  "炎のブレス"},
{ 20,  15,  55, 1600,  95, A_CON,  "冷気のブレス"},
{ 20,  15,  55,  800,  95, A_CON,  "毒のブレス"},
{ 20,  15,  70,  550,  95, A_CON,  "地獄のブレス"},
{ 20,  16,  70,  400,  95, A_CON,  "閃光のブレス"},
{ 20,  16,  70,  400,  95, A_CON,  "暗黒のブレス"},
{ 20,  20,  70,  450,  95, A_CON,  "混乱のブレス"},
{ 20,  20,  70,  450,  95, A_CON,  "轟音のブレス"},
{ 20,  20,  70,  600,  95, A_CON,  "カオスのブレス"},
{ 20,  16,  70,  500,  95, A_CON,  "劣化のブレス"},
{ 30,  25,  80,  250,  95, A_CON,  "因果混乱のブレス"},
{ 35,  18,  80,  150,  95, A_CON,  "時間逆転のブレス"},
{ 30,  25,  80,  200,  95, A_CON,  "遅鈍のブレス"},
{ 30,  28,  90,  200,  95, A_CON,  "重力のブレス"},
{ 20,  15,  70,  500,  95, A_CON,  "破片のブレス"},
{ 35,  15,  80,  150,  95, A_CON,  "プラズマのブレス"},
{ 30,  18,  70,  200,  95, A_CON,  "フォースのブレス"},
{ 30,  28,  80,  250,  95, A_CON,  "魔力のブレス"},
{ 25,  20,  95,  320,  80, A_INT,  "放射能球"},
{ 25,  15,  70,  800,  95, A_CON,  "放射性廃棄物のブレス"},
{ 30,  32,  85,  400,  80, A_INT,  "純ログルス"},
{ 35,  40,  95,  150,  95, A_CON,  "分解のブレス"},
{ 18,  13,  55,  630,  80, A_INT,  "アシッド・ボール"},
{ 14,  10,  45,  316,  60, A_INT,  "サンダー・ボール"},
{ 20,  14,  60,  720,  80, A_INT,  "ファイア・ボール"},
{ 15,  11,  50,  320,  60, A_INT,  "アイス・ボール"},
{  5,   3,  40,   48,  20, A_INT,  "悪臭雲"},
{ 25,  18,  70,  350,  80, A_INT,  "地獄球"},
{ 30,  22,  75,  350,  80, A_INT,  "ウォーター・ボール"},
{ 44,  45,  85,  550,  95, A_INT,  "魔力の嵐"},
{ 40,  42,  90,  550,  95, A_INT,  "暗黒の嵐"},
{ 10,   5,  50,    0,  25, A_INT,  "魔力吸収"},
{ 25,  10,  60,    0,  30, A_INT,  "精神攻撃"},
{ 30,  14,  65,    0,  30, A_INT,  "脳攻撃"},
{  3,   1,  25,   24,  20, A_INT,  "軽傷"},
{ 12,   2,  35,   64,  25, A_INT,  "重傷"},
{ 22,   6,  50,  150,  30, A_INT,  "致命傷"},
{ 32,  10,  70,  225,  35, A_INT,  "秘孔を突く"},
{ 13,   7,  40,  178,  40, A_INT,  "アシッド・ボルト"},
{ 10,   5,  35,  130,  35, A_INT,  "サンダー・ボルト"},
{ 15,   9,  50,  210,  45, A_INT,  "ファイア・ボルト"},
{ 12,   6,  35,  162,  40, A_INT,  "アイス・ボルト"},
{ 40,  42,  90,  550,  95, A_INT,  "スター・バースト"},
{ 25,  17,  60,  255,  60, A_INT,  "地獄の矢"},
{ 25,  20,  65,  250,  60, A_INT,  "ウォーター・ボルト"},
{ 25,  24,  90,  400,  80, A_INT,  "魔力の矢"},
{ 25,  20,  80,  216,  60, A_INT,  "プラズマ・ボルト"},
{ 25,  16,  60,  186,  60, A_INT,  "極寒の矢"},
{  3,   1,  25,   12,  20, A_INT,  "マジック・ミサイル"},
{  5,   3,  35,    0,  20, A_INT,  "恐慌"},
{ 10,   5,  40,    0,  20, A_INT,  "盲目"},
{ 10,   5,  40,    0,  20, A_INT,  "パニック・モンスター"},
{ 10,   5,  40,    0,  20, A_INT,  "スロウ・モンスター"},
{ 10,   5,  40,    0,  20, A_INT,  "スリープ・モンスター"},
{ 20,  10,  70,    0,  40, A_INT,  "スピード"},
{ 45, 120,  95,    0,  60, A_INT,  "破滅の手"},
{ 20,  15,  70,    0,  20, A_WIS,  "体力回復"},
{ 45,  65,  80,    0,  60, A_INT,  "無傷の球"},
{  5,   1,  30,    0,  20, A_INT,  "ショート・テレポート"},
{ 15,   8,  40,    0,  30, A_INT,  "テレポート"},
{ 40, 999,  99,    0,  80, A_INT,  "ザ・ワールド"},
{  1,   0,   0,    0,  15, A_INT,  "何か"},
{ 15,   8,  50,    0,  30, A_INT,  "引きよせる"},
{ 20,  13,  80,    0,  30, A_INT,  "テレポート・アウェイ"},
{ 30,  40,  95,    0,  40, A_INT,  "テレポート・レベル"},
{ 35,  30,  80,  350,  70, A_INT,  "光の剣"},
{  5,   1,  20,    0,  15, A_INT,  "暗闇"},
{  5,   1,  20,    0,  15, A_DEX,  "トラップ創造"},
{ 15,   3,  40,    0,  30, A_INT,  "記憶喪失"},
{ 30,  30,  70,    0,  40, A_INT,  "死者復活"},
{ 40,  70,  85,    0,  45, A_INT,  "援軍を呼ぶ"},
{ 45,  90,  90,    0,  50, A_INT,  "サイバーデーモンの召喚"},
{ 25,  20,  65,    0,  30, A_INT,  "モンスターの召喚"},
{ 35,  30,  75,    0,  40, A_INT,  "複数のモンスターの召喚"},
{ 25,  25,  65,    0,  25, A_INT,  "アリの召喚"},
{ 25,  20,  60,    0,  25, A_INT,  "蜘蛛の召喚"},
{ 35,  26,  75,    0,  40, A_INT,  "ハウンドの召喚"},
{ 30,  23,  70,    0,  35, A_INT,  "ヒドラの召喚"},
{ 40,  50,  85,    0,  40, A_INT,  "天使の召喚"},
{ 35,  50,  80,    0,  35, A_INT,  "デーモンの召喚"},
{ 30,  30,  75,    0,  35, A_INT,  "アンデッドの召喚"},
{ 39,  70,  80,    0,  40, A_INT,  "ドラゴンの召喚"},
{ 43,  85,  85,    0,  45, A_INT,  "上級アンデッドの召喚"},
{ 46,  90,  85,    0,  45, A_INT,  "古代ドラゴンの召喚"},
{ 48, 120,  90,    0,  50, A_INT,  "アンバーの王族の召喚"},
{ 50, 150,  95,    0,  50, A_INT,  "ユニークモンスターの召喚"},
#else
{  1,   1,  10,    0,  15, A_CON,  "shriek"},
{ 10,   4,  35,   89,  40, A_INT,  "something"},
{ 40,  35,  85,    0,  40, A_INT,  "dispel-magic"},
{ 35,  30,  80,  800,  70, A_STR,  "rocket"},
{  2,   1,  15,   10,  15, A_DEX,  "arrow"},
{  5,   2,  20,   18,  20, A_DEX,  "arrows"},
{ 12,   3,  25,   30,  25, A_DEX,  "missile"},
{ 16,   4,  30,   42,  30, A_DEX,  "missiles"},
{ 20,  15,  55, 1600,  95, A_CON,  "breath acid"},
{ 20,  15,  55, 1600,  95, A_CON,  "breath lightning"},
{ 20,  15,  55, 1600,  95, A_CON,  "breath fire"},
{ 20,  15,  55, 1600,  95, A_CON,  "breath cold"},
{ 20,  15,  55,  800,  95, A_CON,  "breath poison"},
{ 20,  15,  70,  550,  95, A_CON,  "breath nether"},
{ 20,  16,  70,  400,  95, A_CON,  "breath light"},
{ 20,  16,  70,  400,  95, A_CON,  "breath dark"},
{ 20,  20,  70,  450,  95, A_CON,  "breath confusion"},
{ 20,  20,  70,  450,  95, A_CON,  "breath sound"},
{ 20,  20,  70,  600,  95, A_CON,  "breath chaos"},
{ 20,  16,  70,  500,  95, A_CON,  "breath disenchantment"},
{ 30,  25,  80,  250,  95, A_CON,  "breath nexus"},
{ 35,  18,  80,  150,  95, A_CON,  "breath time"},
{ 30,  25,  80,  200,  95, A_CON,  "breath inertia"},
{ 30,  28,  90,  200,  95, A_CON,  "breath gravity"},
{ 20,  15,  70,  500,  95, A_CON,  "breath shards"},
{ 35,  15,  80,  150,  95, A_CON,  "breath plasma"},
{ 30,  18,  70,  200,  95, A_CON,  "breath force"},
{ 30,  28,  80,  250,  95, A_CON,  "breath mana"},
{ 25,  20,  95,  320,  80, A_INT,  "nuke ball"},
{ 25,  15,  70,  800,  95, A_CON,  "breath nuke"},
{ 30,  32,  85,  400,  80, A_INT,  "raw Logrus"},
{ 35,  40,  95,  150,  95, A_CON,  "breath disintegrate"},
{ 18,  13,  55,  630,  80, A_INT,  "acid ball"},
{ 14,  10,  45,  316,  60, A_INT,  "lightning ball"},
{ 20,  14,  60,  720,  80, A_INT,  "fire ball"},
{ 15,  11,  50,  320,  60, A_INT,  "frost ball"},
{  5,   3,  40,   48,  20, A_INT,  "stinking cloud"},
{ 25,  18,  70,  350,  80, A_INT,  "nether ball"},
{ 30,  22,  75,  350,  80, A_INT,  "water ball"},
{ 44,  45,  85,  550,  95, A_INT,  "mana storm"},
{ 40,  42,  90,  550,  95, A_INT,  "darkness storm"},
{ 10,   5,  50,    0,  25, A_INT,  "drain mana"},
{ 25,  10,  60,    0,  30, A_INT,  "mind blast"},
{ 30,  14,  65,    0,  30, A_INT,  "brain smash"},
{  3,   1,  25,   24,  20, A_INT,  "cause light wounds"},
{ 12,   2,  35,   64,  25, A_INT,  "cause serious wounds"},
{ 22,   6,  50,  150,  30, A_INT,  "cause critical wounds"},
{ 32,  10,  70,  225,  35, A_INT,  "cause mortal wounds"},
{ 13,   7,  40,  178,  40, A_INT,  "acid bolt"},
{ 10,   5,  35,  130,  35, A_INT,  "lightning bolt"},
{ 15,   9,  50,  210,  45, A_INT,  "fire bolt"},
{ 12,   6,  35,  162,  40, A_INT,  "frost bolt"},
{ 40,  42,  90,  550,  95, A_INT,  "starburst"},
{ 25,  17,  60,  255,  60, A_INT,  "nether bolt"},
{ 25,  20,  65,  250,  60, A_INT,  "water bolt"},
{ 25,  24,  90,  400,  80, A_INT,  "mana bolt"},
{ 25,  20,  80,  216,  60, A_INT,  "plasma bolt"},
{ 25,  16,  60,  186,  60, A_INT,  "ice bolt"},
{  3,   1,  25,   12,  20, A_INT,  "magic missile"},
{  5,   3,  35,    0,  20, A_INT,  "scare"},
{ 10,   5,  40,    0,  20, A_INT,  "blind"},
{ 10,   5,  40,    0,  20, A_INT,  "confuse"},
{ 10,   5,  40,    0,  20, A_INT,  "slow"},
{ 10,   5,  40,    0,  20, A_INT,  "sleep"},
{ 20,  10,  70,    0,  40, A_INT,  "speed"},
{ 45, 120,  95,    0,  60, A_INT,  "the Hand of Doom"},
{ 20,  15,  70,    0,  20, A_WIS,  "heal-self"},
{ 45,  65,  80,    0,  60, A_INT,  "make invulnerable"},
{  5,   1,  30,    0,  20, A_INT,  "blink-self"},
{ 15,   8,  40,    0,  30, A_INT,  "teleport-self"},
{ 40, 999,  99,    0,  80, A_INT,  "The world"},
{  1,   0,   0,    0,  15, A_INT,  "something"},
{ 15,   8,  50,    0,  30, A_INT,  "teleport to"},
{ 20,  13,  80,    0,  30, A_INT,  "teleport away"},
{ 30,  40,  95,    0,  40, A_INT,  "teleport level"},
{ 35,  30,  80,  350,  70, A_INT,  "psycho-spear"},
{  5,   1,  20,    0,  15, A_INT,  "create darkness"},
{  5,   1,  20,    0,  15, A_DEX,  "create traps"},
{ 15,   3,  40,    0,  30, A_INT,  "cause amnesia"},
{ 30,  30,  70,    0,  40, A_INT,  "raise dead"},
{ 40,  70,  85,    0,  45, A_INT,  "summon aid"},
{ 45,  90,  90,    0,  50, A_INT,  "summon Cyberdemons"},
{ 25,  20,  65,    0,  30, A_INT,  "summon a monster"},
{ 35,  30,  75,    0,  40, A_INT,  "summon monsters"},
{ 25,  25,  65,    0,  25, A_INT,  "summon ants"},
{ 25,  20,  60,    0,  25, A_INT,  "summon spiders"},
{ 35,  26,  75,    0,  40, A_INT,  "summon hounds"},
{ 30,  23,  70,    0,  35, A_INT,  "summon hydras"},
{ 40,  50,  85,    0,  40, A_INT,  "summon an angel"},
{ 35,  50,  80,    0,  35, A_INT,  "summon a daemon"},
{ 30,  30,  75,    0,  35, A_INT,  "summon an undead"},
{ 39,  70,  80,    0,  40, A_INT,  "summon a dragon"},
{ 43,  85,  85,    0,  45, A_INT,  "summon Greater Undead"},
{ 46,  90,  85,    0,  45, A_INT,  "summon Ancient Dragon"},
{ 48, 120,  90,    0,  50, A_INT,  "summon Lords of Amber"},
{ 50, 150,  95,    0,  50, A_INT,  "summon Unique Monsters"},
#endif

};


const cptr monster_powers_short[MAX_MONSPELLS] = {
#ifdef JP

	"叫ぶ", "何か", "魔力消去", "ロケット", "射撃", "何か", "何か", "何か",
	"酸", "電撃", "火炎", "冷気", "毒", "地獄", "閃光", "暗黒",
	"混乱", "轟音", "カオス", "劣化", "因果混乱", "時間逆転", "遅鈍", "重力",
	"破片", "プラズマ", "フォース", "魔力", "放射能球", "放射性廃棄物", "純ログルス", "分解",

	"酸", "電撃", "火炎", "冷気", "悪臭雲", "地獄球", "ウォーター", "魔力の嵐",
	"暗黒の嵐", "魔力吸収", "精神攻撃", "脳攻撃", "軽傷", "重傷", "致命傷", "秘孔を突く",
	"酸", "電撃", "火炎", "冷気", "スターバースト", "地獄の矢", "ウォーター", "魔力の矢",
	"プラズマ", "極寒", "マジックミサイル", "恐慌", "盲目", "混乱", "減速", "睡眠",

	"加速", "破滅の手", "体力回復", "無傷の球", "ショートテレポート", "テレポート", "時を止める", "何か",
	"引きよせる", "テレポートアウェイ", "テレポートレベル", "光の剣", "暗闇", "トラップ創造", "記憶喪失", "死者復活",
	"援軍", "サイバーデーモン", "モンスター", "複数のモンスター", "蟻", "蜘蛛", "ハウンド", "ヒドラ",
	"天使", "悪魔", "アンデッド", "ドラゴン", "上級アンデッド", "古代ドラゴン", "アンバーの王族", "ユニーク"

#else

	"Shriek", "Something", "Dispel-magic", "Rocket", "Arrow", "Arrows", "Missile", "Missiles",
	"Acid", "Lightning", "Fire", "Cold", "Poison", "Nether", "Light", "Dark",
	"Confusion", "Sound", "Chaos", "Disenchantment", "Nexus", "Time", "Inertia", "Gravity",
	"Shards", "Plasma", "Force", "Mana", "Nuke", "Nuke", "Logrus", "Disintegrate",

	"Acid", "Lightning", "Fire", "Frost", "Stinking Cloud", "Nether", "Water", "Mana storm",
	"Darkness storm", "Drain mana", "Mind blast", "Brain smash", "Cause Light Wound", "Cause Serious Wound", "Cause Critical Wound", "Cause Mortal Wound",
	"Acid", "Lightning", "Fire", "Frost", "Starburst", "Nether", "Water", "Mana",
	"Plasm", "Ice", "Magic missile", "Scare", "Blind", "Confuse", "Slow", "Sleep",

	"Speed", "Hand of doom", "Heal-self", "Invulnerable", "Blink", "Teleport", "The world", "Something",
	"Teleport to", "Teleport away", "Teleport level", "Psycho-spear", "Create darkness", "Create traps", "Amnesia", "Raise dead",
	"Aid", "Cyberdemons", "A monster", "Monsters", "Ants", "Spiders", "Hounds", "Hydras",
	"Angel", "Daemon", "Undead", "Dragon", "Greater Undead", "Ancient Dragon", "Lords of Amber", "Unique monsters"

#endif
};


/*
 * Hack -- the "basic" color names (see "TERM_xxx")
 */
const cptr color_names[16] =
{
#ifdef JP
	"黒",
	"白",
	"青灰色",
	"オレンジ",
	"赤",
	"緑",
	"青",
	"琥珀色",
	"灰色",
	"明青灰色",
	"紫",
	"黄",
	"明るい赤",
	"明るい緑",
	"明るい青",
	"明琥珀色",
#else
	"Dark",
	"White",
	"Slate",
	"Orange",
	"Red",
	"Green",
	"Blue",
	"Umber",
	"Light Dark",
	"Light Slate",
	"Violet",
	"Yellow",
	"Light Red",
	"Light Green",
	"Light Blue",
	"Light Umber",
#endif

};


/*
 * Abbreviations of healthy stats
 */
const cptr stat_names[6] =
{
#ifdef JP
	"腕力 :", "知能 :", "賢さ :", "器用 :", "耐久 :", "魅力 :"
#else
	"STR : ", "INT : ", "WIS : ", "DEX : ", "CON : ", "CHR : "
#endif

};

/*
 * Abbreviations of damaged stats
 */
const cptr stat_names_reduced[6] =
{
#ifdef JP
	"腕力x:", "知能x:", "賢さx:", "器用x:", "耐久x:", "魅力x:"
#else
	"Str : ", "Int : ", "Wis : ", "Dex : ", "Con : ", "Chr : "
#endif

};


/*
 * Certain "screens" always use the main screen, including News, Birth,
 * Dungeon, Tomb-stone, High-scores, Macros, Colors, Visuals, Options.
 *
 * Later, special flags may allow sub-windows to "steal" stuff from the
 * main window, including File dump (help), File dump (artifacts, uniques),
 * Character screen, Small scale map, Previous Messages, Store screen, etc.
 *
 * The "ctrl-i" (tab) command flips the "Display inven/equip" and "Display
 * equip/inven" flags for all windows.
 *
 * The "ctrl-g" command (or pseudo-command) should perhaps grab a snapshot
 * of the main screen into any interested windows.
 */
const cptr window_flag_desc[32] =
{
#ifdef JP
	"持ち物/装備一覧",
#else
	"Display inven/equip",
#endif

#ifdef JP
	"装備/持ち物一覧",
#else
	"Display equip/inven",
#endif

#ifdef JP
	"呪文一覧",
#else
	"Display spell list",
#endif

#ifdef JP
	"キャラクタ情報",
#else
	"Display character",
#endif

#ifdef JP
	"感知しているモンスターの表示",
#else
	"Display monsters in sight",
#endif

	NULL,
#ifdef JP
	"メッセージ",
#else
	"Display messages",
#endif

#ifdef JP
	"ダンジョン全体図",
#else
	"Display overhead view",
#endif

#ifdef JP
	"モンスターの思い出",
#else
	"Display monster recall",
#endif

#ifdef JP
	"アイテムの詳細",
#else
	"Display object recall",
#endif

#ifdef JP
	"自分の周囲を表示",
#else
	"Display dungeon view",
#endif

#ifdef JP
	"記念撮影",
#else
	"Display snap-shot",
#endif

	///mod140428
	_("足元のアイテム一覧", "Display items at player location"),
	NULL,
#ifdef JP
	"ボーグ・メッセージ",
#else
	"Display borg messages",
#endif

#ifdef JP
	"ボーグ・ステータス",
#else
	"Display borg status",
#endif

	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL
};


/*
 * Available Options
 *
 */

 /*:::オプション一覧　ここでコメントアウトしたオプションも変数が残っていれば使えるがセーブ＆ロードされないので注意*/

 //ここでのデフォルト値はoption_info[].normとpref-opt.prfの両方から記述されている？
 //詳細不明だが

const option_type option_info[] =
{
	/*** Input Options ***/

#ifdef JP
	{ &rogue_like_commands,         FALSE, OPT_PAGE_INPUT, 0, 0,
	"rogue_like_commands",          "ローグ風キー配置を使用する" },
#else
	{ &rogue_like_commands,         FALSE, OPT_PAGE_INPUT, 0, 0,
	"rogue_like_commands",          "Rogue-like commands" },
#endif

#ifdef JP
	{ &always_pickup,               FALSE, OPT_PAGE_INPUT, 0, 5,
	"always_pickup",                "常にアイテムを拾う" },
#else
	{ &always_pickup,               FALSE, OPT_PAGE_INPUT, 0, 5,
	"always_pickup",                "Pick things up by default" },
#endif

#ifdef JP
	{ &carry_query_flag,            FALSE, OPT_PAGE_INPUT, 0, 3,
	"carry_query_flag",             "アイテムを拾う前に確認する" },
#else
	{ &carry_query_flag,            FALSE, OPT_PAGE_INPUT, 0, 3,
	"carry_query_flag",             "Prompt before picking things up" },
#endif

#ifdef JP
	{ &quick_messages,              TRUE,  OPT_PAGE_INPUT, 0, 1,
	"quick_messages",               "クイック・メッセージを使用する" },
#else
	{ &quick_messages,              TRUE,  OPT_PAGE_INPUT, 0, 1,
	"quick_messages",               "Activate quick messages" },
#endif

#ifdef JP
	{ &auto_more,                   FALSE, OPT_PAGE_INPUT, 2, 6,
	"auto_more",                    "キー待ちしないで連続でメッセージを表示する" },
#else
	{ &auto_more,                   FALSE, OPT_PAGE_INPUT, 2, 6,
	"auto_more",                    "Automatically clear '-more-' prompts" },
#endif

#ifdef JP
	{ &command_menu,                TRUE,  OPT_PAGE_INPUT, 2, 7,
	"command_menu",                 "メニューによりコマンド選択を有効にする" },
#else
	{ &command_menu,                TRUE,  OPT_PAGE_INPUT, 2, 7,
	"command_menu",                 "Enable command selection menu" },
#endif

#ifdef JP
	{ &other_query_flag,            FALSE, OPT_PAGE_INPUT, 0, 2,
	"other_query_flag",             "床上のアイテムを使用するときに確認する" },
#else
	{ &other_query_flag,            FALSE, OPT_PAGE_INPUT, 0, 2,
	"other_query_flag",             "Prompt for floor item selection" },
#endif

#ifdef JP
	{ &use_old_target,              FALSE, OPT_PAGE_INPUT, 0, 4,
	"use_old_target",               "常に以前のターゲットを指定する" },
#else
	{ &use_old_target,              FALSE, OPT_PAGE_INPUT, 0, 4,
	"use_old_target",               "Use old target by default" },
#endif

#ifdef JP
	{ &always_repeat,               TRUE,  OPT_PAGE_INPUT, 0, 6,
	"always_repeat",                "コマンド自動繰り返し" },
#else
	{ &always_repeat,               TRUE,  OPT_PAGE_INPUT, 0, 6,
	"always_repeat",                "Repeat obvious commands" },
#endif

#ifdef JP
	{ &confirm_destroy,             FALSE, OPT_PAGE_INPUT, 5, 3,
	"confirm_destroy",              "「無価値」なアイテムを破壊する時確認する" },
#else
	{ &confirm_destroy,             FALSE, OPT_PAGE_INPUT, 5, 3,
	"confirm_destroy",              "Prompt for destruction of known worthless items" },
#endif

#ifdef JP
	{ &confirm_wear,                TRUE,  OPT_PAGE_INPUT, 5, 4,
	"confirm_wear",                 "呪われた物を装備する時確認する" },
#else
	{ &confirm_wear,                TRUE,  OPT_PAGE_INPUT, 5, 4,
	"confirm_wear",                 "Confirm to wear/wield known cursed items" },
#endif

#ifdef JP
	{ &confirm_quest,               TRUE,  OPT_PAGE_INPUT, 1, 9,
	"confirm_quest",                "クエストを諦めて階段で逃げる前に確認する" },
#else
	{ &confirm_quest,               TRUE,  OPT_PAGE_INPUT, 1, 9,
	"confirm_quest",                "Prompt before exiting a quest level" },
#endif

#ifdef JP
	{ &target_pet,                  FALSE, OPT_PAGE_INPUT, 2, 5,
	"target_pet",                   "ペットをターゲットにする" },
#else
	{ &target_pet,                  FALSE, OPT_PAGE_INPUT, 2, 5,
	"target_pet",                   "Allow targetting followers" },
#endif

#ifdef ALLOW_EASY_OPEN
#ifdef JP
	{ &easy_open,                   TRUE,  OPT_PAGE_INPUT, 5, 7,
	"easy_open",                    "自動的にドアを開ける" },
#else
	{ &easy_open,                   TRUE,  OPT_PAGE_INPUT, 5, 7,
	"easy_open",                    "Automatically open doors" },
#endif
#endif /* ALLOW_EASY_OPEN */

#ifdef ALLOW_EASY_DISARM
#ifdef JP
	{ &easy_disarm,                 TRUE,  OPT_PAGE_INPUT, 5, 8,
	"easy_disarm",                  "自動的に罠を解除する" },
#else
	{ &easy_disarm,                 TRUE,  OPT_PAGE_INPUT, 5, 8,
	"easy_disarm",                  "Automatically disarm traps" },
#endif
#endif /* ALLOW_EASY_DISARM */

#ifdef ALLOW_EASY_FLOOR /* TNB */
#ifdef JP
	{ &easy_floor,                  FALSE, OPT_PAGE_INPUT, 5, 9,
	"easy_floor",                   "床上で重なったアイテムをリストする" },
#else
	{ &easy_floor,                  FALSE, OPT_PAGE_INPUT, 5, 9,
	"easy_floor",                   "Display floor stacks in a list" },
#endif
#endif /* ALLOW_EASY_FLOOR -- TNB */

#ifdef JP
	{ &use_command,                 FALSE, OPT_PAGE_INPUT, 5, 10,
	"use_command",                  "「使う(a)」コマンドでアイテムを何でも使える" },
#else
	{ &use_command,                 FALSE, OPT_PAGE_INPUT, 5, 10,
	"use_command",                  "Allow unified use command" },
#endif

#ifdef JP
	{ &over_exert,                  FALSE, OPT_PAGE_INPUT, 0, 29,
	"over_exert",                   "MPが足りなくても魔法に挑戦する" },
#else
	{ &over_exert,                  FALSE, OPT_PAGE_INPUT, 0, 29,
	"over_exert",                   "Allow casting spells when short of mana" },
#endif

#ifdef JP
	{ &numpad_as_cursorkey,         TRUE, OPT_PAGE_INPUT, 2, 31,
	"numpad_as_cursorkey",          "エディタ内でテンキーをカーソルキーとして使う" },
#else
	{ &numpad_as_cursorkey,         TRUE, OPT_PAGE_INPUT, 2, 31,
	"numpad_as_cursorkey",          "Use numpad keys as cursor keys in editor mode" },
#endif

	/*** Map Screen Options ***/

#ifdef JP
	{ &center_player,               FALSE, OPT_PAGE_MAPSCREEN, 5, 11,
	"center_player",                "常にプレイヤーを中心に置く(*遅い*)" },
#else
	{ &center_player,               FALSE, OPT_PAGE_MAPSCREEN, 5, 11,
	"center_player",                "Center map while walking (*slow*)" },
#endif

#ifdef JP
	{ &center_running,              TRUE,  OPT_PAGE_MAPSCREEN, 5, 12,
	"center_running",               "走っている時でも中心に置く" },
#else
	{ &center_running,              TRUE,  OPT_PAGE_MAPSCREEN, 5, 12,
	"center_running",               "Centering even while running" },
#endif

#ifdef JP
	{ &view_yellow_lite,            TRUE,  OPT_PAGE_MAPSCREEN, 1, 28,
	"view_yellow_lite",             "明かりの範囲を特別な色で表示する" },
#else
	{ &view_yellow_lite,            TRUE,  OPT_PAGE_MAPSCREEN, 1, 28,
	"view_yellow_lite",             "Use special colors for torch-lit grids" },
#endif

#ifdef JP
	{ &view_bright_lite,            TRUE,  OPT_PAGE_MAPSCREEN, 1, 29,
	"view_bright_lite",             "視界の範囲を特別な色で表示する" },
#else
	{ &view_bright_lite,            TRUE,  OPT_PAGE_MAPSCREEN, 1, 29,
	"view_bright_lite",             "Use special colors for 'viewable' grids" },
#endif

#ifdef JP
	{ &view_granite_lite,           TRUE,  OPT_PAGE_MAPSCREEN, 1, 30,
	"view_granite_lite",            "壁を特別な色で表示する(重い)" },
#else
	{ &view_granite_lite,           TRUE,  OPT_PAGE_MAPSCREEN, 1, 30,
	"view_granite_lite",            "Use special colors for wall grids (slow)" },
#endif

#ifdef JP
	{ &view_special_lite,           TRUE,  OPT_PAGE_MAPSCREEN, 1, 31,
	"view_special_lite",            "床を特別な色で表示する(重い)" },
#else
	{ &view_special_lite,           TRUE,  OPT_PAGE_MAPSCREEN, 1, 31,
	"view_special_lite",            "Use special colors for floor grids (slow)" },
#endif

#ifdef JP
	{ &view_perma_grids,            TRUE,  OPT_PAGE_MAPSCREEN, 1, 6,
	"view_perma_grids",             "明るい場所はそのままにする" },
#else
	{ &view_perma_grids,            TRUE,  OPT_PAGE_MAPSCREEN, 1, 6,
	"view_perma_grids",             "Map remembers all perma-lit grids" },
#endif

#ifdef JP
	{ &view_torch_grids,            FALSE, OPT_PAGE_MAPSCREEN, 1, 7,
	"view_torch_grids",             "明かりで照らした場所はそのままにする" },
#else
	{ &view_torch_grids,            FALSE, OPT_PAGE_MAPSCREEN, 1, 7,
	"view_torch_grids",             "Map remembers all torch-lit grids" },
#endif

#ifdef JP
	{ &view_unsafe_grids,           FALSE, OPT_PAGE_MAPSCREEN, 1, 8,
	"view_unsafe_grids",            "トラップ感知済みでない場所を表示する" },
#else
	{ &view_unsafe_grids,           FALSE, OPT_PAGE_MAPSCREEN, 1, 8,
	"view_unsafe_grids",            "Map marked by detect traps" },
#endif

#ifdef JP
	{ &view_reduce_view,            FALSE, OPT_PAGE_MAPSCREEN, 1, 17,
	"view_reduce_view",             "街では視野を狭くする" },
#else
	{ &view_reduce_view,            FALSE, OPT_PAGE_MAPSCREEN, 1, 17,
	"view_reduce_view",             "Reduce view-radius in town" },
#endif

#ifdef JP
	{ &fresh_before,                TRUE,  OPT_PAGE_MAPSCREEN, 1, 23,
	"fresh_before",                 "連続コマンド中に画面を再描画し続ける" },
#else
	{ &fresh_before,                TRUE,  OPT_PAGE_MAPSCREEN, 1, 23,
	"fresh_before",                 "Flush output while continuous command" },
#endif

#ifdef JP
	{ &fresh_after,                 FALSE, OPT_PAGE_MAPSCREEN, 1, 24,
	"fresh_after",                  "コマンド後に画面を常に再描画し続ける" },
#else
	{ &fresh_after,                 FALSE, OPT_PAGE_MAPSCREEN, 1, 24,
	"fresh_after",                  "Flush output after monster's move" },
#endif

#ifdef JP
	{ &fresh_message,               FALSE, OPT_PAGE_MAPSCREEN, 1, 25,
	"fresh_message",                "メッセージの後に画面を再描画する" },
#else
	{ &fresh_message,               FALSE, OPT_PAGE_MAPSCREEN, 1, 25,
	"fresh_message",                "Flush output after every message" },
#endif

#ifdef JP
	{ &hilite_player,               FALSE, OPT_PAGE_MAPSCREEN, 1, 27,
	"hilite_player",                "プレイヤーにカーソルを合わせる" },
#else
	{ &hilite_player,               FALSE, OPT_PAGE_MAPSCREEN, 1, 27,
	"hilite_player",                "Hilite the player with the cursor" },
#endif

#ifdef JP
	{ &display_path,                FALSE, OPT_PAGE_MAPSCREEN, 2, 8,
	"display_path",                 "魔法や矢の軌跡を表示する" },
#else
	{ &display_path,                FALSE, OPT_PAGE_MAPSCREEN, 2, 8,
	"display_path",                 "Display actual path before shooting" },
#endif

	/*** Text Display Options ***/

#ifdef JP
	{ &plain_descriptions,          TRUE,  OPT_PAGE_TEXT, 5, 1,
	"plain_descriptions",           "アイテムの記述を簡略にする" },
#else
	{ &plain_descriptions,          TRUE,  OPT_PAGE_TEXT, 5, 1,
	"plain_descriptions",           "Plain object descriptions" },
#endif

#ifdef JP
	{ &plain_pickup,                FALSE, OPT_PAGE_TEXT, 6, 6,
	"plain_pickup",                 "「拾った」メッセージを簡略化する" },
#else
	{ &plain_pickup,                FALSE, OPT_PAGE_JAPANESE_ONLY, 6, 6,
	"plain_pickup",                 "Plain pickup messages(japanese only)" },
#endif

#ifdef JP
	{ &always_show_list,            TRUE,  OPT_PAGE_TEXT, 4, 0,
	"always_show_list",             "選択時には常に一覧を表示する" },
#else
	{ &always_show_list,            TRUE,  OPT_PAGE_TEXT, 4, 0,
	"always_show_list",             "Always show list when choosing items" },
#endif

#ifdef JP
	{ &depth_in_feet,               FALSE, OPT_PAGE_TEXT, 0, 7,
	"depth_in_feet",                "ダンジョンの深さをフィートで表示する" },
#else
	{ &depth_in_feet,               FALSE, OPT_PAGE_TEXT, 0, 7,
	"depth_in_feet",                "Show dungeon level in feet" },
#endif

#ifdef JP
	{ &show_labels,                 TRUE,  OPT_PAGE_TEXT, 0, 10,
	"show_labels",                  "装備一覧で装備場所を表示する" },
#else
	{ &show_labels,                 TRUE,  OPT_PAGE_TEXT, 0, 10,
	"show_labels",                  "Show labels in object listings" },
#endif

#ifdef JP
	{ &show_weights,                TRUE,  OPT_PAGE_TEXT, 0, 11,
	"show_weights",                 "アイテム一覧で重量を表示する" },
#else
	{ &show_weights,                TRUE,  OPT_PAGE_TEXT, 0, 11,
	"show_weights",                 "Show weights in object listings" },
#endif

#ifdef JP
	{ &show_item_graph,             TRUE,  OPT_PAGE_TEXT, 2, 0,
	"show_item_graph",              "アイテムのシンボルを表示する" },
#else
	{ &show_item_graph,             TRUE,  OPT_PAGE_TEXT, 2, 0,
	"show_item_graph",              "Show items graphics" },
#endif

#ifdef JP
	{ &equippy_chars,               TRUE,  OPT_PAGE_TEXT, 1, 12,
	"equippy_chars",                "ステータスに文字で装備を表示する" },
#else
	{ &equippy_chars,               TRUE,  OPT_PAGE_TEXT, 1, 12,
	"equippy_chars",                "Display 'equippy' chars" },
#endif

#ifdef JP
	{ &display_mutations,           FALSE, OPT_PAGE_TEXT, 5, 0,
	"display_mutations",            "'C'コマンドで突然変異を表示する" },
#else
	{ &display_mutations,           FALSE, OPT_PAGE_TEXT, 5, 0,
	"display_mutations",            "Display mutations in 'C'haracter Display" },
#endif

#ifdef JP
	{ &compress_savefile,           FALSE, OPT_PAGE_TEXT, 1, 26,
	"compress_savefile",            "セーブ・ファイル中のメッセージを圧縮する" },
#else
	{ &compress_savefile,           FALSE, OPT_PAGE_TEXT, 1, 26,
	"compress_savefile",            "Compress messages in savefiles" },
#endif

#ifdef JP
	{ &abbrev_extra,                FALSE, OPT_PAGE_TEXT, 2, 10,
	"abbrev_extra",                 "アイテムに追加耐性/能力の略称を刻む" },
#else
	{ &abbrev_extra,                FALSE, OPT_PAGE_TEXT, 2, 10,
	"abbrev_extra",                 "Describe obj's extra resistances by abbreviation" },
#endif

#ifdef JP
	{ &abbrev_all,                  FALSE, OPT_PAGE_TEXT, 2, 11,
	"abbrev_all",                   "アイテムに全ての耐性/能力の略称を刻む" },
#else
	{ &abbrev_all,                  FALSE, OPT_PAGE_TEXT, 2, 11,
	"abbrev_all",                   "Describe obj's all resistances by abbreviation" },
#endif

#ifdef JP
	{ &exp_need,                    FALSE, OPT_PAGE_TEXT, 2, 12,
	"exp_need",                     "次のレベルに必要な経験値を表示する" },
#else
	{ &exp_need,                    FALSE, OPT_PAGE_TEXT, 2, 12,
	"exp_need",                     "Show the experience needed for next level" },
#endif

#ifdef JP
	{ &ignore_unview,               FALSE, OPT_PAGE_TEXT, 2, 13,
	"ignore_unview",                "視界外のモンスターの行動を表示しない" },
#else
	{ &ignore_unview,               FALSE, OPT_PAGE_TEXT, 2, 13,
	"ignore_unview",                "Ignore whenever any monster performs an action" },
#endif

#ifdef JP
	{ &full_mon_list,                FALSE,  OPT_PAGE_TEXT, 4, 21,
	"full_mon_list",                 "視界内モンスターリストに画面外のモンスターも表示" },

	{ &show_throwing_dam,                FALSE,  OPT_PAGE_TEXT, 7, 6,
	"show_throwing_dam",                 "武器の投擲ダメージを表示する" },

	{ &show_special_info,                FALSE,  OPT_PAGE_TEXT, 7, 10,
	"show_special_info",                 "アイテムのその他の特殊な情報を表示する" },

	{ &show_actual_value,                FALSE, OPT_PAGE_TEXT, 2, 14,
		"show_actual_value",                 "各技能値に実値を表示する" },
#else
    { &full_mon_list,                FALSE,  OPT_PAGE_TEXT, 4, 21,
	"full_mon_list",                 "Show offscreen monsters in visible monster list" },

	{ &show_throwing_dam,                FALSE,  OPT_PAGE_TEXT, 7, 6,
	"show_throwing_dam",                 "Show weapon throwing damage" },

	{ &show_special_info,                FALSE,  OPT_PAGE_TEXT, 7, 10,
	"show_special_info",                 "Show other special item information" },

	{ &show_actual_value,                FALSE, OPT_PAGE_TEXT, 2, 14,
		"show_actual_value",                 "Show actual skill values" },
#endif


	/*** Game-Play ***/

#ifdef JP
	{ &stack_force_notes,           TRUE,  OPT_PAGE_GAMEPLAY, 0, 8,
	"stack_force_notes",            "異なる銘のアイテムをまとめる" },
#else
	{ &stack_force_notes,           TRUE,  OPT_PAGE_GAMEPLAY, 0, 8,
	"stack_force_notes",            "Merge inscriptions when stacking" },
#endif

#ifdef JP
	{ &stack_force_costs,           FALSE, OPT_PAGE_GAMEPLAY, 0, 9,
	"stack_force_costs",            "異なる割引表示のアイテムをまとめる" },
#else
	{ &stack_force_costs,           FALSE, OPT_PAGE_GAMEPLAY, 0, 9,
	"stack_force_costs",            "Merge discounts when stacking" },
#endif

#ifdef JP
	{ &expand_list,                 TRUE,  OPT_PAGE_GAMEPLAY, 1, 5,
	"expand_list",                  "「一覧」コマンドを拡張する" },
#else
	{ &expand_list,                 TRUE,  OPT_PAGE_GAMEPLAY, 1, 5,
	"expand_list",                  "Expand the power of the list commands" },
#endif

#ifdef JP
	{ &small_levels,                TRUE,  OPT_PAGE_GAMEPLAY, 0, 30,
	"small_levels",                 "非常に小さいフロアの生成を可能にする" },
#else
	{ &small_levels,                TRUE,  OPT_PAGE_GAMEPLAY, 0, 30,
	"small_levels",                 "Allow unusually small dungeon levels" },
#endif

#ifdef JP
	{ &always_small_levels,         FALSE, OPT_PAGE_GAMEPLAY, 2, 3,
	"always_small_levels",          "常に非常に小さいフロアを生成する" },
#else
	{ &always_small_levels,         FALSE, OPT_PAGE_GAMEPLAY, 2, 3,
	"always_small_levels",          "Always create unusually small dungeon levels" },
#endif

#ifdef JP
	{ &empty_levels,                TRUE,  OPT_PAGE_GAMEPLAY, 0, 31,
	"empty_levels",                 "空っぽの「アリーナ」レベルの生成を可能にする" },
#else
	{ &empty_levels,                TRUE,  OPT_PAGE_GAMEPLAY, 0, 31,
	"empty_levels",                 "Allow empty 'arena' levels" },
#endif

#ifdef JP
	{ &bound_walls_perm,            FALSE, OPT_PAGE_GAMEPLAY, 2, 1,
	"bound_walls_perm",             "ダンジョンの外壁を永久岩にする" },
#else
	{ &bound_walls_perm,            FALSE, OPT_PAGE_GAMEPLAY, 2, 1,
	"bound_walls_perm",             "Boundary walls become 'permanent wall'" },
#endif

#ifdef JP
	{ &gun_free_world,            FALSE, OPT_PAGE_GAMEPLAY, 7, 11,
	"gun_free_world",             "銃が出現しない" },
#else
    { &gun_free_world,            FALSE, OPT_PAGE_GAMEPLAY, 7, 11,
        "gun_free_world",             "No guns are generated" },
#endif

#ifdef JP
	{ &bm_sells_antique,            FALSE, OPT_PAGE_GAMEPLAY, 7, 13,
		"bm_sells_antique",             "店に骨董品が並ぶ(蒐集用アイテム)" },
#else
    { &bm_sells_antique,            FALSE, OPT_PAGE_GAMEPLAY, 7, 13,
		"bm_sells_antique",             "Antiques are sold in stores (for collection)" },
#endif

#ifdef JP
	{ &always_check_arms,            FALSE, OPT_PAGE_GAMEPLAY, 7, 12,
	"always_check_arms",             "右手と左手に別々の物を持つとき常に確認する" },
#else
    { &always_check_arms,            FALSE, OPT_PAGE_GAMEPLAY, 7, 12,
	"always_check_arms",             "Prompt for holding items in both hands" },
#endif

#ifdef JP
	{ &last_words,                  TRUE,  OPT_PAGE_GAMEPLAY, 0, 28,
///msg131221
	"last_words",                   "ゲーム終了時に一言コメントを残す" },
#else
	{ &last_words,                  TRUE,  OPT_PAGE_GAMEPLAY, 0, 28,
	"last_words",                   "Leave last words when your character dies" },
#endif

#ifdef JP
	{ &auto_dump,                  TRUE,  OPT_PAGE_GAMEPLAY, 4, 6,
	"auto_dump",                   "ダンプファイル名を自動設定する" },
#else
    { &auto_dump,                  TRUE,  OPT_PAGE_GAMEPLAY, 4, 6,
	"auto_dump",                   "Automatically generate character dump file name" },
#endif

#ifdef WORLD_SCORE
#ifdef JP
	{ &send_score,                  TRUE,  OPT_PAGE_GAMEPLAY, 4, 7,
	"send_score",                   "スコアサーバにゲームデータを送る" },
#else
	{ &send_score,                  TRUE,  OPT_PAGE_GAMEPLAY, 4, 6,
	"send_score",                   "Send score dump to the world score server" },
#endif
#endif
#ifdef JP
	{ &ex_attack_msg,                  FALSE,  OPT_PAGE_GAMEPLAY, 6, 0,
///msg131221
	"ex_attack_msg",                   "武器攻撃時のメッセージに変化をつける" },
#else
	{ &ex_attack_msg,                  FALSE,  OPT_PAGE_GAMEPLAY, 6, 0,
///msg131221
	"ex_attack_msg",                   "Change messages when attacking with weapons" },
#endif


#ifdef JP
	{ &allow_debug_opts,            FALSE, OPT_PAGE_GAMEPLAY, 6, 11,
	"allow_debug_opts",             "デバッグ/詐欺オプションを許可する" },
#else
	{ &allow_debug_opts,            FALSE, OPT_PAGE_GAMEPLAY, 6, 11,
	"allow_debug_opts",             "Allow use of debug/cheat options" },
#endif

	/*** Disturbance ***/

#ifdef JP
	{ &find_ignore_stairs,          FALSE, OPT_PAGE_DISTURBANCE, 0, 16,
	"find_ignore_stairs",           "階段は通過する" },
#else
	{ &find_ignore_stairs,          FALSE, OPT_PAGE_DISTURBANCE, 0, 16,
	"find_ignore_stairs",           "Run past stairs" },
#endif

#ifdef JP
	{ &find_ignore_doors,           TRUE,  OPT_PAGE_DISTURBANCE, 0, 17,
	"find_ignore_doors",            "ドアは通過する" },
#else
	{ &find_ignore_doors,           TRUE,  OPT_PAGE_DISTURBANCE, 0, 17,
	"find_ignore_doors",            "Run through open doors" },
#endif

#ifdef JP
	{ &find_cut,                    FALSE, OPT_PAGE_DISTURBANCE, 0, 18,
	"find_cut",                     "曲り角を斜めに最短距離で通過する" },
#else
	{ &find_cut,                    FALSE, OPT_PAGE_DISTURBANCE, 0, 18,
	"find_cut",                     "Run past known corners" },
#endif

#ifdef JP
	{ &check_abort,                 TRUE,  OPT_PAGE_DISTURBANCE, 1, 18,
	"check_abort",                  "連続コマンドはキー入力で中断する" },
#else
	{ &check_abort,                 TRUE,  OPT_PAGE_DISTURBANCE, 1, 18,
	"check_abort",                  "Check for user abort while continuous command" },
#endif

#ifdef JP
	{ &flush_failure,               TRUE,  OPT_PAGE_DISTURBANCE, 1, 20,
	"flush_failure",                "様々なミス発生時に入力をクリアする" },
#else
	{ &flush_failure,               TRUE,  OPT_PAGE_DISTURBANCE, 1, 20,
	"flush_failure",                "Flush input on various failures" },
#endif

#ifdef JP
	{ &flush_disturb,               FALSE, OPT_PAGE_DISTURBANCE, 1, 21,
	"flush_disturb",                "障害発生時に入力をクリアする" },
#else
	{ &flush_disturb,               FALSE, OPT_PAGE_DISTURBANCE, 1, 21,
	"flush_disturb",                "Flush input whenever disturbed" },
#endif

#ifdef JP
	{ &disturb_move,                FALSE, OPT_PAGE_DISTURBANCE, 0, 20,
	"disturb_move",                 "どこのモンスターが動いても行動を中止する" },
#else
	{ &disturb_move,                FALSE, OPT_PAGE_DISTURBANCE, 0, 20,
	"disturb_move",                 "Disturb whenever any monster moves" },
#endif

#ifdef JP
	{ &disturb_high,                FALSE, OPT_PAGE_DISTURBANCE, 1, 3,
	"disturb_high",                 "レベルの高いモンスターが動いたら行動を中止する" },
#else
	{ &disturb_high,                FALSE, OPT_PAGE_DISTURBANCE, 1, 3,
	"disturb_high",                 "Disturb whenever high-level monster moves" },
#endif

#ifdef JP
	{ &disturb_near,                TRUE,  OPT_PAGE_DISTURBANCE, 0, 21,
	"disturb_near",                 "視界内のモンスターが動いたら行動を中止する" },
#else
	{ &disturb_near,                TRUE,  OPT_PAGE_DISTURBANCE, 0, 21,
	"disturb_near",                 "Disturb whenever viewable monster moves" },
#endif

#ifdef JP
	{ &disturb_pets,                FALSE, OPT_PAGE_DISTURBANCE, 5, 6,
	"disturb_pets",                 "視界内のペットが動いたら行動を中止する" },
#else
	{ &disturb_pets,                FALSE, OPT_PAGE_DISTURBANCE, 5, 6,
	"disturb_pets",                 "Disturb when visible followers move" },
#endif

#ifdef JP
	{ &disturb_panel,               TRUE,  OPT_PAGE_DISTURBANCE, 0, 22,
	"disturb_panel",                "画面スクロール時に行動を中止する" },
#else
	{ &disturb_panel,               TRUE,  OPT_PAGE_DISTURBANCE, 0, 22,
	"disturb_panel",                "Disturb whenever map panel changes" },
#endif

#ifdef JP
	{ &disturb_state,               TRUE,  OPT_PAGE_DISTURBANCE, 0, 23,
	"disturb_state",                "自分のステータス変化時に行動を中止する" },
#else
	{ &disturb_state,               TRUE,  OPT_PAGE_DISTURBANCE, 0, 23,
	"disturb_state",                "Disturb whenever player state changes" },
#endif

#ifdef JP
	{ &disturb_minor,               TRUE,  OPT_PAGE_DISTURBANCE, 0, 24,
	"disturb_minor",                "些細なことが起きても行動を中止する" },
#else
	{ &disturb_minor,               TRUE,  OPT_PAGE_DISTURBANCE, 0, 24,
	"disturb_minor",                "Disturb whenever boring things happen" },
#endif

#ifdef JP
	{ &ring_bell,                   FALSE, OPT_PAGE_DISTURBANCE, 0, 14,
	"ring_bell",                    "エラー時にビープ音を鳴らす" },
#else
	{ &ring_bell,                   FALSE, OPT_PAGE_DISTURBANCE, 0, 14,
	"ring_bell",                    "Audible bell (on errors, etc)" },
#endif

#ifdef JP
	{ &disturb_trap_detect,         TRUE,  OPT_PAGE_DISTURBANCE, 0, 27,
	"disturb_trap_detect",          "トラップ感知範囲外に出る直前に行動を中止する" },
#else
	{ &disturb_trap_detect,         TRUE,  OPT_PAGE_DISTURBANCE, 0, 27,
	"disturb_trap_detect",          "Disturb when leaving trap detected area" },
#endif

#ifdef JP
	{ &alert_trap_detect,           FALSE, OPT_PAGE_DISTURBANCE, 0, 25,
	"alert_trap_detect",            "トラップ感知範囲外に出る直前に警告する" },
#else
	{ &alert_trap_detect,           FALSE, OPT_PAGE_DISTURBANCE, 0, 25,
	"alert_trap_detect",            "Alert when leaving trap detected area" },
#endif

	/*** Birth Options ***/
///del131222 値切り交渉しない
#if 0
#ifdef JP
	{ &manual_haggle,               FALSE, OPT_PAGE_BIRTH, 1, 0,
	"manual_haggle",                "店で値切り交渉をする" },
#else
	{ &manual_haggle,               FALSE, OPT_PAGE_BIRTH, 1, 0,
	"manual_haggle",                "Manually haggle in stores" },
#endif
#endif
/*
#ifdef JP
	{ &easy_band,                   FALSE, OPT_PAGE_BIRTH, 6, 31,
	"easy_band",                    "初心者用簡単モード(*)" },
#else
	{ &easy_band,                   FALSE, OPT_PAGE_BIRTH, 6, 31,
	"easy_band",                    "Easy Mode (*)" },
#endif
*/

///mod150103
#ifdef JP
	{ &birth_bonus_20,                 FALSE,  OPT_PAGE_BIRTH, 1, 14,
	"birth_bonus_20",                  "ボーナスポイントを固定(*)" },
	{ &birth_bonus_10,                 FALSE,  OPT_PAGE_BIRTH, 1, 15,
	"birth_bonus_10",                  "ボーナスポイントが少ない(*)" },
	{ &ironman_no_bonus,                 FALSE,  OPT_PAGE_BIRTH, 1, 16,
	"ironman_no_bonus",                  "(鉄人用)ボーナスポイントなし(*)" },
#else
	{ &birth_bonus_20,                 FALSE,  OPT_PAGE_BIRTH, 1, 14,
	"birth_bonus_20",                  "Fixed amount of bonus points (*)" },
	{ &birth_bonus_10,                 FALSE,  OPT_PAGE_BIRTH, 1, 15,
	"birth_bonus_10",                  "Low amount of bonus points (*)" },
	{ &ironman_no_bonus,                 FALSE,  OPT_PAGE_BIRTH, 1, 16,
	"ironman_no_bonus",                  "No bonus points (*)" },
#endif
/*
#ifdef JP
	{ &smart_learn,                 TRUE,  OPT_PAGE_BIRTH, 1, 14,
	"smart_learn",                  "モンスターは失敗を学習する(*)" },
#else
	{ &smart_learn,                 TRUE,  OPT_PAGE_BIRTH, 1, 14,
	"smart_learn",                  "Monsters learn from their mistakes (*)" },
#endif

#ifdef JP
	{ &smart_cheat,                 FALSE, OPT_PAGE_BIRTH, 1, 15,
	"smart_cheat",                  "モンスターはプレイヤーの弱みを突く(*)" },
#else
	{ &smart_cheat,                 FALSE, OPT_PAGE_BIRTH, 1, 15,
	"smart_cheat",                  "Monsters exploit players weaknesses (*)" },
#endif
*/
/*
#ifdef JP
	{ &vanilla_town,                FALSE, OPT_PAGE_BIRTH, 6, 0,
	"vanilla_town",                 "元祖の街/クエストと荒野なし" },
#else
	{ &vanilla_town,                FALSE, OPT_PAGE_BIRTH, 6, 0,
	"vanilla_town",                 "Use 'vanilla' town without quests and wilderness" },
#endif

#ifdef JP
	{ &lite_town,                   FALSE, OPT_PAGE_BIRTH, 6, 1,
	"lite_town",                    "小規模な街/荒野なし" },
#else
	{ &lite_town,                   FALSE, OPT_PAGE_BIRTH, 6, 1,
	"lite_town",                    "Use 'lite' town without a wilderness" },
#endif
*/

#ifdef JP
	{ &ironman_shops,               FALSE, OPT_PAGE_BIRTH, 6, 2,
	"ironman_shops",                "(鉄人用)店と我が家を使用しない(*)" },
#else
	{ &ironman_shops,               FALSE, OPT_PAGE_BIRTH, 6, 2,
	"ironman_shops",                "Stores are permanently closed (*)" },
#endif

#ifdef JP
	{ &ironman_small_levels,        FALSE, OPT_PAGE_BIRTH, 6, 3,
	"ironman_small_levels",         "(鉄人用)常に非常に小さいフロアを生成(*)" },
#else
	{ &ironman_small_levels,        FALSE, OPT_PAGE_BIRTH, 6, 3,
	"ironman_small_levels",         "Always create unusually small dungeon levels (*)" },
#endif
/*
#ifdef JP
	{ &ironman_downward,            FALSE, OPT_PAGE_BIRTH, 6, 4,
	"ironman_downward",             "(鉄人用)帰還と上り階段なし(*)" },
#else
	{ &ironman_downward,            FALSE, OPT_PAGE_BIRTH, 6, 4,
	"ironman_downward",             "Disable recall and use of up stairs (*)" },
#endif
*/
///mod140406追加

#ifdef JP
	{ &ironman_empty_levels,        FALSE, OPT_PAGE_BIRTH, 6, 8,
	"ironman_empty_levels",         "(鉄人用)常に空っぽのアリーナレベルを生成(*)" },
#else
	{ &ironman_empty_levels,        FALSE, OPT_PAGE_BIRTH, 6, 8,
	"ironman_empty_levels",         "Always create empty 'arena' levels (*)" },
#endif

#ifdef JP
	{ &ironman_no_fixed_art,            FALSE, OPT_PAGE_BIRTH, 6, 4,
	"ironman_no_fixed_art",             "固定アーティファクトが出現しない(*)" },
#else
	{ &ironman_no_fixed_art,            FALSE, OPT_PAGE_BIRTH, 6, 4,
	"ironman_no_fixed_art",             "Don't generate fixed artifacts (*)" },
#endif

#ifdef JP
	{ &ironman_rooms,               FALSE, OPT_PAGE_BIRTH, 6, 12,
	"ironman_rooms",                "常に普通でない部屋を生成する(*)" },
#else
	{ &ironman_rooms,               FALSE, OPT_PAGE_BIRTH, 6, 12,
	"ironman_rooms",                "Always generate very unusual rooms (*)" },
#endif
/*
#ifdef JP
	{ &ironman_nightmare,           FALSE, OPT_PAGE_BIRTH, 6, 18,
	"ironman_nightmare",            "(鉄人用)悪夢モード(これは全く不条理です！)(*)" },
#else
	{ &ironman_nightmare,           FALSE, OPT_PAGE_BIRTH, 6, 18,
	"ironman_nightmare",            "Nightmare mode(it isn't even remotely fair!)(*)" },
#endif
	*/
#ifdef JP
	{ &no_capture_book,                 FALSE, OPT_PAGE_BIRTH, 6, 13,
	"no_capture_book",                  "妖魔本が出現しない(*)" },
#else
	{ &no_capture_book,                 FALSE, OPT_PAGE_BIRTH, 6, 13,
	"no_capture_book",                  "Don't generate demon books (*)" },
#endif

	//左利き 6,13→6,15
#ifdef JP
	{ &left_hander,                 FALSE, OPT_PAGE_BIRTH, 6, 15,
	"left_hander",                  "左利きである" },
#else
	{ &left_hander,                 FALSE, OPT_PAGE_BIRTH, 6, 15,
	"left_hander",                  "Left-Hander" },
#endif
#ifdef JP
	{ &preserve_mode,               TRUE,  OPT_PAGE_BIRTH, 6, 14,
	"preserve_mode",                "伝説のアイテムを取り逃しても再生成される(*)" },
#else
	{ &preserve_mode,               TRUE,  OPT_PAGE_BIRTH, 6, 14,
	"preserve_mode",                "Preserve artifacts (*)" },
#endif
///mod140511 オートローラー無効
/*
#ifdef JP
	{ &autoroller,                  TRUE,  OPT_PAGE_BIRTH, 6, 15,
	"autoroller",                   "能力値にオートローラー使用(*)" },
#else
	{ &autoroller,                  TRUE,  OPT_PAGE_BIRTH, 6, 15,
	"autoroller",                   "Allow use of autoroller for stats (*)" },
#endif
*/
///del131221 体格・地位オプション無効
#if 0
#ifdef JP
	{ &autochara,                   FALSE, OPT_PAGE_BIRTH, 6, 16,
	"autochara",                   "体格/地位にオートローラー使用" },
#else
	{ &autochara,                   FALSE, OPT_PAGE_BIRTH, 6, 16,
	"autochara",                    "Autoroll for weight, height and social status" },
#endif
#endif

#ifdef JP
	{ &powerup_home,                TRUE,  OPT_PAGE_BIRTH, 4, 3,
	"powerup_home",                 "我が家を拡張する(*)" },
#else
	{ &powerup_home,                TRUE,  OPT_PAGE_BIRTH, 4, 3,
	"powerup_home",                 "Increase capacity of your home (*)" },
#endif

	/*** Easy Object Auto-Destroyer ***/

#ifdef JP
	{ &destroy_items,               FALSE, OPT_PAGE_AUTODESTROY, 7, 0,
	"destroy_items",                "アイテムの簡易自動破壊を使用する" },
#else
	{ &destroy_items,               FALSE, OPT_PAGE_AUTODESTROY, 7, 0,
	"destroy_items",                "Use easy auto-destroyer" },
#endif

#ifdef JP
	{ &destroy_feeling,             FALSE, OPT_PAGE_AUTODESTROY, 7, 8,
	"destroy_feeling",              "簡易鑑定したとき自動破壊を適用する" },
#else
	{ &destroy_feeling,             FALSE, OPT_PAGE_AUTODESTROY, 7, 8,
	"destroy_feeling",              "Apply auto-destroy as sense feeling" },
#endif

#ifdef JP
	{ &destroy_identify,            FALSE, OPT_PAGE_AUTODESTROY, 7, 9,
	"destroy_identify",             "鑑定したとき自動破壊を適用する" },
#else
	{ &destroy_identify,            FALSE, OPT_PAGE_AUTODESTROY, 7, 9,
	"destroy_identify",             "Apply auto-destroy as identify an item" },
#endif

#ifdef JP
	{ &leave_worth,                 TRUE,  OPT_PAGE_AUTODESTROY, 7, 2,
	"leave_worth",                  "価格が$1以上のアイテムは壊さない" },
#else
	{ &leave_worth,                 TRUE,  OPT_PAGE_AUTODESTROY, 7, 2,
	"leave_worth",                  "Auto-destroyer leaves known worthy items" },
#endif

#ifdef JP
	{ &leave_equip,                 FALSE, OPT_PAGE_AUTODESTROY, 7, 3,
	"leave_equip",                  "武器/防具は壊さない" },
#else
	{ &leave_equip,                 FALSE, OPT_PAGE_AUTODESTROY, 7, 3,
	"leave_equip",                  "Auto-destroyer leaves weapons and armour" },
#endif

#ifdef JP
	{ &leave_chest,                 TRUE,  OPT_PAGE_AUTODESTROY, 7, 7,
	"leave_chest",                  "開封されていない箱は壊さない" },
#else
	{ &leave_chest,                 TRUE,  OPT_PAGE_AUTODESTROY, 7, 7,
	"leave_chest",                  "Auto-destroyer leaves closed chests" },
#endif
/*
#ifdef JP
	{ &leave_wanted,                TRUE,  OPT_PAGE_AUTODESTROY, 7, 4,
	"leave_wanted",                 "賞金首の死体/骨は壊さない" },
#else
	{ &leave_wanted,                TRUE,  OPT_PAGE_AUTODESTROY, 7, 4,
	"leave_wanted",                 "Auto-destroyer leaves wanted corpses" },
#endif

#ifdef JP
	{ &leave_corpse,                FALSE, OPT_PAGE_AUTODESTROY, 7, 5,
	"leave_corpse",                 "死体/骨は壊さない" },
#else
	{ &leave_corpse,                FALSE, OPT_PAGE_AUTODESTROY, 7, 5,
	"leave_corpse",                 "Auto-destroyer leaves corpses and skeletons" },
#endif

	//7,6は「武器の投擲ダメージを表示する」に変更
#ifdef JP
	{ &leave_junk,                  FALSE, OPT_PAGE_AUTODESTROY, 7, 6,
	"leave_junk",                   "がらくたは壊さない" },
#else
	{ &leave_junk,                  FALSE, OPT_PAGE_AUTODESTROY, 7, 6,
	"leave_junk",                   "Auto-destroyer leaves junk" },
#endif
	*/
#ifdef JP
	{ &leave_special,               TRUE,  OPT_PAGE_AUTODESTROY, 7, 1,
//	"leave_special",                "種族/職業で特別に必要なアイテムは壊さない" },
	"leave_special",                "今の種族/職業に有用なアイテムは壊さない" },
#else
	{ &leave_special,               TRUE,  OPT_PAGE_AUTODESTROY, 7, 1,
	"leave_special",                "Auto-destroyer leaves items your current race/class needs" },
#endif

	/*** Play-record Options ***/

#ifdef JP
	{ &record_fix_art,              TRUE,  OPT_PAGE_PLAYRECORD, 4, 11,
	"record_fix_art",               "固定アーティファクトの入手を記録する" },
#else
	{ &record_fix_art,              TRUE,  OPT_PAGE_PLAYRECORD, 4, 11,
	"record_fix_art",               "Record fixed artifacts" },
#endif

#ifdef JP
	{ &record_rand_art,             TRUE,  OPT_PAGE_PLAYRECORD, 4, 12,
	"record_rand_art",              "ランダムアーティファクトの入手を記録する" },
#else
	{ &record_rand_art,             TRUE,  OPT_PAGE_PLAYRECORD, 4, 12,
	"record_rand_art",              "Record random artifacts" },
#endif

#ifdef JP
	{ &record_destroy_uniq,         TRUE,  OPT_PAGE_PLAYRECORD, 4, 13,
	"record_destroy_uniq",          "ユニークモンスターを倒したときを記録する" },
#else
	{ &record_destroy_uniq,         TRUE,  OPT_PAGE_PLAYRECORD, 4, 13,
	"record_destroy_uniq",          "Record when destroy unique monster" },
#endif

#ifdef JP
	{ &record_fix_quest,            TRUE,  OPT_PAGE_PLAYRECORD, 4, 14,
	"record_fix_quest",             "固定クエストの達成を記録する" },
#else
	{ &record_fix_quest,            TRUE,  OPT_PAGE_PLAYRECORD, 4, 14,
	"record_fix_quest",             "Record fixed quests" },
#endif

#ifdef JP
	{ &record_rand_quest,           TRUE,  OPT_PAGE_PLAYRECORD, 4, 15,
	"record_rand_quest",            "ランダムクエストの達成を記録する" },
#else
	{ &record_rand_quest,           TRUE,  OPT_PAGE_PLAYRECORD, 4, 15,
	"record_rand_quest",            "Record random quests" },
#endif

#ifdef JP
	{ &record_maxdepth,             TRUE,  OPT_PAGE_PLAYRECORD, 4, 16,
	"record_maxdepth",              "最深階を更新したときに記録する" },
#else
	{ &record_maxdepth,             TRUE,  OPT_PAGE_PLAYRECORD, 4, 16,
	"record_maxdepth",              "Record movements to deepest level" },
#endif

#ifdef JP
	{ &record_stair,                TRUE,  OPT_PAGE_PLAYRECORD, 4, 17,
	"record_stair",                 "階の移動を記録する" },
#else
	{ &record_stair,                TRUE,  OPT_PAGE_PLAYRECORD, 4, 17,
	"record_stair",                 "Record recall and stair movements" },
#endif

#ifdef JP
	{ &record_buy,                  TRUE,  OPT_PAGE_PLAYRECORD, 4, 18,
	"record_buy",                   "アイテムの購入を記録する" },
#else
	{ &record_buy,                  TRUE,  OPT_PAGE_PLAYRECORD, 4, 18,
	"record_buy",                   "Record purchased items" },
#endif

#ifdef JP
	{ &record_sell,                 FALSE, OPT_PAGE_PLAYRECORD, 4, 19,
	"record_sell",                  "アイテムの売却を記録する" },
#else
	{ &record_sell,                 FALSE, OPT_PAGE_PLAYRECORD, 4, 19,
	"record_sell",                  "Record sold items" },
#endif

#ifdef JP
	{ &record_danger,               TRUE,  OPT_PAGE_PLAYRECORD, 4, 20,
	"record_danger",                "ピンチになったときを記録する" },
#else
	{ &record_danger,               TRUE,  OPT_PAGE_PLAYRECORD, 4, 20,
	"record_danger",                "Record hitpoint warning" },
#endif
/* 4,21は「常にモンスターリストを更新する」に変更
//v1.1.57 4,24を新たに使用
*/
#ifdef JP
	{ &record_arena,                TRUE,  OPT_PAGE_PLAYRECORD, 4, 24,
	"record_arena",                 "夢日記での勝敗を記録する" },
#else
	{ &record_arena,                TRUE,  OPT_PAGE_PLAYRECORD, 4, 24,
	"record_arena",                 "Record arena victories" },
#endif

#ifdef JP
	{ &record_ident,                TRUE,  OPT_PAGE_PLAYRECORD, 4, 22,
	"record_ident",                 "未判明のアイテムの識別を記録する" },
#else
	{ &record_ident,                TRUE,  OPT_PAGE_PLAYRECORD, 4, 22,
	"record_ident",                 "Record first identified items" },
#endif

#ifdef JP
	{ &record_named_pet,            FALSE, OPT_PAGE_PLAYRECORD, 4, 23,
	"record_named_pet",             "名前つきペットの情報を記録する" },
#else
	{ &record_named_pet,            FALSE, OPT_PAGE_PLAYRECORD, 4, 23,
	"record_named_pet",             "Record informations of named followers" },
#endif

	/*** End of Table ***/

	{ NULL,                         0, 0, 0, 0,
	NULL,                           NULL }
};


const cptr animal_ghost_strife_names[] =
{
	"(ERROR)",
	_("無所属", "Unaligned"),
	_("鬼傑組", "Kiketsu Family"),
	_("勁牙組", "Keiga Family"),
	_("剛欲同盟", "Gouyoku Alliance")
};

#ifdef JP
const cptr chaos_patrons[MAX_PATRON] =
{
	"スローター",
	"マベロード",
	"チャードロス",
	"ハイオンハーン",
	"キシオムバーグ",

	"ピアレー",
	"バラン",
	"アリオッチ",
	"イーカー",
	"ナージャン",

	"バロ",
	"コーン",
	"スラーネッシュ",
	"ナーグル",
	"ティーンチ",

	"カイン"
};
#else
const cptr chaos_patrons[MAX_PATRON] =
{
	"Slortar",
	"Mabelode",
	"Chardros",
	"Hionhurn",
	"Xiombarg",

	"Pyaray",
	"Balaan",
	"Arioch",
	"Eequor",
	"Narjhan",

	"Balo",
	"Khorne",
	"Slaanesh",
	"Nurgle",
	"Tzeentch",

	"Khaine"
};
#endif


const int chaos_stats[MAX_PATRON] =
{
	A_CON,  /* Slortar */
	A_CON,  /* Mabelode */
	A_STR,  /* Chardros */
	A_STR,  /* Hionhurn */
	A_STR,  /* Xiombarg */

	A_INT,  /* Pyaray */
	A_STR,  /* Balaan */
	A_INT,  /* Arioch */
	A_CON,  /* Eequor */
	A_CHR,  /* Narjhan */

	-1,     /* Balo */
	A_STR,  /* Khorne */
	A_CHR,  /* Slaanesh */
	A_CON,  /* Nurgle */
	A_INT,  /* Tzeentch */

	A_STR,  /* Khaine */
};




const int chaos_rewards[MAX_PATRON][20] =
{
	/* Slortar the Old: */
	{
		REW_WRATH, REW_CURSE_WP, REW_CURSE_AR, REW_RUIN_ABL, REW_LOSE_ABL,
		REW_IGNORE, REW_IGNORE, REW_IGNORE, REW_POLY_WND, REW_POLY_SLF,
		REW_POLY_SLF, REW_POLY_SLF, REW_GAIN_ABL, REW_GAIN_ABL, REW_GAIN_EXP,
		REW_GOOD_OBJ, REW_CHAOS_WP, REW_GREA_OBJ, REW_AUGM_ABL, REW_AUGM_ABL
	},

	/* Mabelode the Faceless: */
	{
		REW_WRATH, REW_CURSE_WP, REW_CURSE_AR, REW_H_SUMMON, REW_SUMMON_M,
		REW_SUMMON_M, REW_IGNORE, REW_IGNORE, REW_POLY_WND, REW_POLY_WND,
		REW_POLY_SLF, REW_HEAL_FUL, REW_HEAL_FUL, REW_GAIN_ABL, REW_SER_UNDE,
		REW_CHAOS_WP, REW_GOOD_OBJ, REW_GOOD_OBJ, REW_GOOD_OBS, REW_GOOD_OBS
	},

	/* Chardros the Reaper: */
	{
		REW_WRATH, REW_WRATH, REW_HURT_LOT, REW_PISS_OFF, REW_H_SUMMON,
		REW_SUMMON_M, REW_IGNORE, REW_IGNORE, REW_DESTRUCT, REW_SER_UNDE,
		REW_GENOCIDE, REW_MASS_GEN, REW_MASS_GEN, REW_DISPEL_C, REW_GOOD_OBJ,
		REW_CHAOS_WP, REW_GOOD_OBS, REW_GOOD_OBS, REW_AUGM_ABL, REW_AUGM_ABL
	},

	/* Hionhurn the Executioner: */
	{
		REW_WRATH, REW_WRATH, REW_CURSE_WP, REW_CURSE_AR, REW_RUIN_ABL,
		REW_IGNORE, REW_IGNORE, REW_SER_UNDE, REW_DESTRUCT, REW_GENOCIDE,
		REW_MASS_GEN, REW_MASS_GEN, REW_HEAL_FUL, REW_GAIN_ABL, REW_GAIN_ABL,
		REW_CHAOS_WP, REW_GOOD_OBS, REW_GOOD_OBS, REW_AUGM_ABL, REW_AUGM_ABL
	},

	/* Xiombarg the Sword-Queen: */
	{
		REW_TY_CURSE, REW_TY_CURSE, REW_PISS_OFF, REW_RUIN_ABL, REW_LOSE_ABL,
		REW_IGNORE, REW_POLY_SLF, REW_POLY_SLF, REW_POLY_WND, REW_POLY_WND,
		REW_GENOCIDE, REW_DISPEL_C, REW_GOOD_OBJ, REW_GOOD_OBJ, REW_SER_MONS,
		REW_GAIN_ABL, REW_CHAOS_WP, REW_GAIN_EXP, REW_AUGM_ABL, REW_GOOD_OBS
	},


	/* Pyaray the Tentacled Whisperer of Impossible Secretes: */
	{
		REW_WRATH, REW_TY_CURSE, REW_PISS_OFF, REW_H_SUMMON, REW_H_SUMMON,
		REW_IGNORE, REW_IGNORE, REW_IGNORE, REW_POLY_WND, REW_POLY_SLF,
		REW_POLY_SLF, REW_SER_DEMO, REW_HEAL_FUL, REW_GAIN_ABL, REW_GAIN_ABL,
		REW_CHAOS_WP, REW_DO_HAVOC, REW_GOOD_OBJ, REW_GREA_OBJ, REW_GREA_OBS
	},

	/* Balaan the Grim: */
	{
		REW_TY_CURSE, REW_HURT_LOT, REW_CURSE_WP, REW_CURSE_AR, REW_RUIN_ABL,
		REW_SUMMON_M, REW_LOSE_EXP, REW_POLY_SLF, REW_POLY_SLF, REW_POLY_WND,
		REW_SER_UNDE, REW_HEAL_FUL, REW_HEAL_FUL, REW_GAIN_EXP, REW_GAIN_EXP,
		REW_CHAOS_WP, REW_GOOD_OBJ, REW_GOOD_OBS, REW_GREA_OBS, REW_AUGM_ABL
	},

	/* Arioch, Duke of Hell: */
	{
		REW_WRATH, REW_PISS_OFF, REW_RUIN_ABL, REW_LOSE_EXP, REW_H_SUMMON,
		REW_IGNORE, REW_IGNORE, REW_IGNORE, REW_IGNORE, REW_POLY_SLF,
		REW_POLY_SLF, REW_MASS_GEN, REW_SER_DEMO, REW_HEAL_FUL, REW_CHAOS_WP,
		REW_CHAOS_WP, REW_GOOD_OBJ, REW_GAIN_EXP, REW_GREA_OBJ, REW_AUGM_ABL
	},

	/* Eequor, Blue Lady of Dismay: */
	{
		REW_WRATH, REW_TY_CURSE, REW_PISS_OFF, REW_CURSE_WP, REW_RUIN_ABL,
		REW_IGNORE, REW_IGNORE, REW_POLY_SLF, REW_POLY_SLF, REW_POLY_WND,
		REW_GOOD_OBJ, REW_GOOD_OBJ, REW_SER_MONS, REW_HEAL_FUL, REW_GAIN_EXP,
		REW_GAIN_ABL, REW_CHAOS_WP, REW_GOOD_OBS, REW_GREA_OBJ, REW_AUGM_ABL
	},

	/* Narjhan, Lord of Beggars: */
	{
		REW_WRATH, REW_CURSE_AR, REW_CURSE_WP, REW_CURSE_WP, REW_CURSE_AR,
		REW_IGNORE, REW_IGNORE, REW_IGNORE, REW_POLY_SLF, REW_POLY_SLF,
		REW_POLY_WND, REW_HEAL_FUL, REW_HEAL_FUL, REW_GAIN_EXP, REW_AUGM_ABL,
		REW_GOOD_OBJ, REW_GOOD_OBJ, REW_CHAOS_WP, REW_GREA_OBJ, REW_GREA_OBS
	},

	/* Balo the Jester: */
	{
		REW_WRATH, REW_SER_DEMO, REW_CURSE_WP, REW_CURSE_AR, REW_LOSE_EXP,
		REW_GAIN_ABL, REW_LOSE_ABL, REW_POLY_WND, REW_POLY_SLF, REW_IGNORE,
		REW_DESTRUCT, REW_MASS_GEN, REW_CHAOS_WP, REW_GREA_OBJ, REW_HURT_LOT,
		REW_AUGM_ABL, REW_RUIN_ABL, REW_H_SUMMON, REW_GREA_OBS, REW_AUGM_ABL
	},

	/* Khorne the Bloodgod: */
	{
		REW_WRATH, REW_HURT_LOT, REW_HURT_LOT, REW_H_SUMMON, REW_H_SUMMON,
		REW_IGNORE, REW_IGNORE, REW_IGNORE, REW_SER_MONS, REW_SER_DEMO,
		REW_POLY_SLF, REW_POLY_WND, REW_HEAL_FUL, REW_GOOD_OBJ, REW_GOOD_OBJ,
		REW_CHAOS_WP, REW_GOOD_OBS, REW_GOOD_OBS, REW_GREA_OBJ, REW_GREA_OBS
	},

	/* Slaanesh: */
	{
		REW_WRATH, REW_PISS_OFF, REW_PISS_OFF, REW_RUIN_ABL, REW_LOSE_ABL,
		REW_LOSE_EXP, REW_IGNORE, REW_IGNORE, REW_POLY_WND, REW_SER_DEMO,
		REW_POLY_SLF, REW_HEAL_FUL, REW_HEAL_FUL, REW_GOOD_OBJ, REW_GAIN_EXP,
		REW_GAIN_EXP, REW_CHAOS_WP, REW_GAIN_ABL, REW_GREA_OBJ, REW_AUGM_ABL
	},

	/* Nurgle: */
	{
		REW_WRATH, REW_PISS_OFF, REW_HURT_LOT, REW_RUIN_ABL, REW_LOSE_ABL,
		REW_LOSE_EXP, REW_IGNORE, REW_IGNORE, REW_IGNORE, REW_POLY_SLF,
		REW_POLY_SLF, REW_POLY_WND, REW_HEAL_FUL, REW_GOOD_OBJ, REW_GAIN_ABL,
		REW_GAIN_ABL, REW_SER_UNDE, REW_CHAOS_WP, REW_GREA_OBJ, REW_AUGM_ABL
	},

	/* Tzeentch: */
	{
		REW_WRATH, REW_CURSE_WP, REW_CURSE_AR, REW_RUIN_ABL, REW_LOSE_ABL,
		REW_LOSE_EXP, REW_IGNORE, REW_POLY_SLF, REW_POLY_SLF, REW_POLY_SLF,
		REW_POLY_SLF, REW_POLY_WND, REW_HEAL_FUL, REW_CHAOS_WP, REW_GREA_OBJ,
		REW_GAIN_ABL, REW_GAIN_ABL, REW_GAIN_EXP, REW_GAIN_EXP, REW_AUGM_ABL
	},

	/* Khaine: */
	{
		REW_WRATH, REW_HURT_LOT, REW_PISS_OFF, REW_LOSE_ABL, REW_LOSE_EXP,
		REW_IGNORE,   REW_IGNORE,   REW_DISPEL_C, REW_DO_HAVOC, REW_DO_HAVOC,
		REW_POLY_SLF, REW_POLY_SLF, REW_GAIN_EXP, REW_GAIN_ABL, REW_GAIN_ABL,
		REW_SER_MONS, REW_GOOD_OBJ, REW_CHAOS_WP, REW_GREA_OBJ, REW_GOOD_OBS
	}
};

///mod140216 素手攻撃時エフェクト変更
/*:::文章,攻撃分類、最低レベル,失敗率,dd,ds,特殊効果,重量(最終重量はこの値にLvを掛ける)*/

const martial_arts_new ma_blows_new[] =
{
	{ _("%sを殴った。",
        "You punch %s."),					 MELEE_MODE_PUNCH1,1, 0, 1, 5, 0 ,4},
	{ _("%sを殴りつけた。",
        "You punch %s hard."),				 MELEE_MODE_PUNCH1,10, 0, 2, 5, 0 ,4},
	{ _("%sに大振りパンチを食らわせた。",
        "You land a heavy blow on %s."),			 MELEE_MODE_PUNCH1,15, 0, 3, 5, 0 ,4},
	{ _("%sを思いっ切り殴った。",
        "You brutally punch %s."),				 MELEE_MODE_PUNCH1,20, 10, 4, 5, 0 ,3},
	{ _("%sをタコ殴りにした。",
        "You land consecutive punches on %s."),			 MELEE_MODE_PUNCH1,25, 5, 5, 5, MELEE_STUN ,4},
	{ _("%sへ右ストレートを食らわせた。",
        "You hit %s with a right straight."),  MELEE_MODE_PUNCH1,30, 15, 6, 6, 0 ,5},
	{ _("%sへ正拳突きを食らわせた。",
        "You hit %s with a fist thrust."),		 MELEE_MODE_PUNCH1,35, 15, 7, 7, MELEE_STUN ,8},

	{ _("%sを蹴った。",
        "You kick %s."),                 MELEE_MODE_KICK1,1, 0, 1, 7, 0 ,5},
	{ _("%sへヤクザキックを食らわせた。",
        "You hit %s with a yakuza kick."),   MELEE_MODE_KICK1,5, 0, 2, 7, 0 ,5},
	{ _("%sへ回し蹴りを食らわせた。",
        "You hit %s with a roundhouse kick."),   MELEE_MODE_KICK1,12, 0, 2, 9, 0 ,6},
	{ _("%sを蹴り上げた！",
        "You hit %s with a rising kick!"),             MELEE_MODE_KICK1,20, 10, 3, 7, 0 ,7},
	{ _("%sを蹴り回した！",
        "You hit %s with spinning kicks!"),             MELEE_MODE_KICK1,30, 15, 4, 7, MELEE_DEC_ATK ,8},
	{ _("%sを蹴って蹴って蹴りまくった！",
        "You keep kicking and kicking %s!"),MELEE_MODE_KICK1,40, 25, 7, 7, MELEE_STUN2 ,10},

	{ _("%sを人魚の尾で打った。",
        "You hit %s with your merfolk tail."),       MELEE_MODE_FISH_TAIL,1, 0, 4, 7, MELEE_STUN2 ,10},
	{ _("%sを人魚の尾でぶっ叩いた！",
        "You strike %s with your merfolk tail!"),   MELEE_MODE_FISH_TAIL,15, 0, 6, 7, MELEE_STUN2 ,12},
	{ _("%sを人魚の尾で薙ぎ倒した！",
        "You sweep %s with your merfolk tail!"),   MELEE_MODE_FISH_TAIL,30, 20, 10, 7, MELEE_STUN3 ,15},
	{ _("%sを人魚の尾でぶっ飛ばした！",
        "You knock %s back with your merfolk tail!"), MELEE_MODE_FISH_TAIL,45, 40, 12,10, MELEE_STUN3 ,20},

	{ _("%sに噛み付いた！",
        "You bite %s!"),             MELEE_MODE_BITE,1, 0, 2, 6, 0 ,6},
	{ _("%sに食い付いた！",
        "You gnaw %s!"),             MELEE_MODE_BITE,10, 0, 3, 6, 0 ,7},
	{ _("%sに齧り付いた！",
        "You deeply bite into %s!"),             MELEE_MODE_BITE,20, 10, 4, 6, MELEE_DELAY ,8},
	{ _("%sに鋭い牙を突き立てた！",
        "You thrust your sharp fangs into %s!"),     MELEE_MODE_BITE,30, 20, 7, 7, MELEE_DELAY ,10},
	{ _("%sへ齧りついて振り回した！",
        "You bite into %s and thrash around!"),   MELEE_MODE_BITE,40, 30, 10, 10, MELEE_DELAY ,11},

	{ _("%sを引っ掻いた。",
        "You scratch %s."),             MELEE_MODE_CLAW,1, 0, 1, 9, 0 ,2},
	{ _("%sを掻き毟った。",
        "You claw %s."),             MELEE_MODE_CLAW,7, 0, 2, 9, 0 ,3},
	{ _("%sを鋭い爪で突いた。",
        "You thrust your sharp claws into %s."),         MELEE_MODE_CLAW,15, 0, 3, 9, 0 ,4},
	{ _("%sを鋭い爪で切り裂いた！",
        "You slash %s with your sharp claws!"),     MELEE_MODE_CLAW,24, 0, 5, 9, MELEE_DEC_ATK ,6},
	{ _("%sを鋭い爪で貫いた！",
        "You rip %s with your sharp claws!"),		MELEE_MODE_CLAW,29, 20, 7, 9, 0 ,8},
	{ _("%sを鋭い爪でなます切りにした！",
        "You slice %s up with your sharp claws!"),		MELEE_MODE_CLAW,34, 20, 8, 9, MELEE_DEC_ATK ,8},
	{ _("%sを鋭い爪で滅多切りにした！",
        "You cleave %s up with your sharp claws!"),		MELEE_MODE_CLAW,40, 30, 9, 9, MELEE_DEC_ATK ,8},

	{ _("%sを羽衣で叩いた。",
        "You hit %s with your veils."),           MELEE_MODE_DRILL,1, 0, 1, 6, 0 ,1},
	{ _("%sを羽衣で突いた。",
        "You thrust at %s with your veils."),           MELEE_MODE_DRILL,5, 0, 1, 8, 0 ,2},
	{ _("%sを羽衣で薙ぎ払った。",
        "You sweep %s with your veils."),           MELEE_MODE_DRILL,10, 0, 2, 8, MELEE_DELAY ,4},
	{ _("%sを羽衣で締めた。",
        "You squeeze %s with your veils."),           MELEE_MODE_DRILL,15, 10, 3, 8, MELEE_STUN ,6},
	{ _("%sを羽衣で叩き伏せた。",
        "You strike %s down with your veils."),           MELEE_MODE_DRILL,20, 15, 4, 8, MELEE_STUN ,8},
	{ _("火花を放つ羽衣が%sを穿った。",
        "You wrap your sparking veils around %s."),           MELEE_MODE_DRILL,30, 20, 7, 9, MELEE_ELEC ,10},
	{ _("羽衣の螺旋が稲妻と共に%sを貫いた！",
        "You twist your veils into a spiral and pierce %s with electric discharge!"),   MELEE_MODE_DRILL,40, 40, 10, 11, MELEE_ELEC ,12},

	{ _("%sを殴りつけた。",
        "You punch %s hard."),         MELEE_MODE_PUNCH_ONI,1, 0, 3, 5, 0 ,8},
	{ _("%sを殴り飛ばした。",
        "You punch and knock back %s."),         MELEE_MODE_PUNCH_ONI,10, 0, 5, 6, MELEE_STUN ,10},
	{ _("%sを投げ飛ばした。",
        "You throw %s."),         MELEE_MODE_PUNCH_ONI,20, 0, 6, 8, MELEE_DELAY ,10},
	{ _("鋼鉄のような拳が%sへ叩き込まれた！",
        "You slam %s with an iron fist!"),    MELEE_MODE_PUNCH_ONI,30, 25, 9, 11, MELEE_STUN2 ,12},
	{ _("%sを叩き付け地面に大穴を開けた！",
        "You strike down %s, leaving a crater in the ground!"),    MELEE_MODE_PUNCH_ONI,40, 35, 11, 12, MELEE_STUN3 ,15},

	{ _("%sを叩いた。",
        "You strike %s."),						MELEE_MODE_KASEN,1, 0, 1, 7, 0 ,3},
	{ _("包帯が伸び%sを打ち据えた。",
        "You extend your bandages and strike %s."),         MELEE_MODE_KASEN,6, 0, 2, 5, 0 ,4},
	{ _("包帯がドリルのように%sを穿った。",
        "You form your bandages into a drill and drive it into %s."),   MELEE_MODE_KASEN,10, 3, 3, 5, 0 ,5},
	{ _("包帯の手が%sに食い込んだ。",
        "Your bandaged arm bites %s."),			MELEE_MODE_KASEN,15, 0, 5, 5, MELEE_KASEN ,6},
	{ _("竿打が%sへ突撃した！",
        "You hit %s with a thrusting strike!"),				MELEE_MODE_KASEN,20, 10, 4, 7, MELEE_STUN ,3},
	{ _("務光が%sへ電撃を食らわせた！",
        "You hit %s with electric discharge!"),		MELEE_MODE_KASEN,24, 11, 5, 5, MELEE_ELEC ,3},
	{ _("包帯の手が%sを貫いた！",
        "You thrust your bandaged arm into %s!"),				MELEE_MODE_KASEN,28, 20, 7, 7, MELEE_KASEN ,8},
	{ _("彭祖が%sへ飛びかかった！",
        "Your pet tiger leaps at %s!"),			MELEE_MODE_KASEN,33, 27, 9, 9, MELEE_STUN2 ,12},
	{ _("黄帝が%sへ水塊を吐いた！",
        "Your pet dragon breathes water at %s!"),			MELEE_MODE_KASEN,37, 25, 8, 8, MELEE_WATER ,7},
	{ _("包帯の手が%sを握り潰した！",
        "You crush %s with your bandaged arm!"),			MELEE_MODE_KASEN,40, 25, 10, 10, MELEE_KASEN ,10},
	{ _("%sを包帯で絡め取り、振り回して叩きつけた！",
        "You wrap %s with your bandages and slam them into the ground!"),		MELEE_MODE_KASEN,45, 40, 12, 12, MELEE_KASEN ,16},

	{ _("%sを払い除けた。",
        "You sweep %s."),					MELEE_MODE_ONI_KASEN,1, 0, 1, 7, 0 ,3 },
	{ _("%sを殴った。",
        "You punch %s."),						MELEE_MODE_ONI_KASEN,6, 0, 2, 5, 0 ,4 },
	{ _("%sを右手の爪で引っ掻いた。",
        "You slash %s with claws on your right hand."),			MELEE_MODE_ONI_KASEN,10, 3, 3, 5, MELEE_VAMP ,5 },
	{ _("%sを殴り飛ばした！",
        "You punch and knock back %s!"),					MELEE_MODE_ONI_KASEN,15, 0, 5, 5, MELEE_STUN ,6 },
	{ _("%sを鋭い爪で掻き毟った。",
        "You viciously cut %s with your sharp claws!"),			MELEE_MODE_ONI_KASEN,20, 10, 4, 7, MELEE_VAMP ,3 },
	{ _("%sを投げ飛ばした！",
        "You throw %s!"),					MELEE_MODE_ONI_KASEN,24, 11, 5, 5, MELEE_STUN ,3 },
	{ _("%sを鋭い爪で切り裂いた！",
        "You cleave %s with your sharp claws!"),			MELEE_MODE_ONI_KASEN,28, 20, 7, 7, MELEE_VAMP ,8 },
	{ _("%sに石柱を叩きつけた！",
        "You slam %s with a stone pillar!"),			MELEE_MODE_ONI_KASEN,33, 27, 9, 9, MELEE_STUN2 ,12 },
	{ _("%sを鋭い爪で貫いた！",
        "You pierce %s with your sharp claws!"),				MELEE_MODE_ONI_KASEN,37, 25, 8, 8, MELEE_VAMP ,7 },
	{ _("%sを気合で吹き飛ばした！",
        "You knock %s away with your sheer spirit!"),			MELEE_MODE_ONI_KASEN,40, 25, 10, 10, MELEE_STUN2 ,10 },
	{ _("%sを鬼の爪でナマス切りにした！",
        "You slice %s up with your oni claws!"),		MELEE_MODE_ONI_KASEN,43, 40, 12, 12, MELEE_VAMP ,12 },
	{ _("四天王の剛拳が%sに叩き込まれた！",
        "You slam %s with an iron fist of the Big Four!"),	MELEE_MODE_ONI_KASEN,45, 40, 14, 14, MELEE_STUN3 ,15 },

	//シールドバッシュ　重量値は特殊処理で盾重量を基準に決まる
	{ _("盾で%sを打った。",
        "You strike %s with your shield."),         MELEE_MODE_SHIELD,1, 0, 1, 5, 0 ,4},
	{ _("盾で%sを殴りつけた。",
        "You deliver a powerful blow to %s with your shield."),				MELEE_MODE_SHIELD,10, 0,3, 5, MELEE_STUN ,1},
	{ _("盾を振り回して%sを打ち据えた。",
        "You swing your shield, striking %s."),		MELEE_MODE_SHIELD,20, 5,4, 6, MELEE_STUN ,1},
	{ _("盾を構えて%sへ体当たりした。",
        "You hold your shield out and tackle %s."),		MELEE_MODE_SHIELD,30,10,7, 7, MELEE_STUN ,1},
	{ _("盾の猛撃で%sを吹き飛ばした！",
        "You knock %s back with a mighty shield strike!"),		MELEE_MODE_SHIELD,40,20,9, 9, MELEE_STUN2,1},

	{ _("%sに頭突きを食らわせた。",
        "You headbutt %s."),     MELEE_MODE_HEADBUTT,1, 0, 2, 5, MELEE_STUN ,3},
	{ _("%sに強烈な頭突きを食らわせた。",
        "You fiercely headbutt %s."),     MELEE_MODE_HEADBUTT,15, 0, 4, 5, MELEE_STUN ,5},
	{ _("鋼鉄のような石頭が%sに叩き込まれた！",
        "You slam %s with your steel-hard head!"),     MELEE_MODE_HEADBUTT,35, 20, 8, 8, MELEE_STUN2 ,8},

	{ _("%sを角で突いた。",
        "You thrust at %s with your horns."),             MELEE_MODE_HORNS,1, 0, 1, 10, 0 ,3},
	{ _("%sを何度も角で突いた。",
        "You thrust at %s with your horns multiple times."),         MELEE_MODE_HORNS,15, 0, 2, 10, 0 ,4},
	{ _("%sへ角を向け強烈な体当たりをかけた！",
        "You lower your horns at %s and charge!"),     MELEE_MODE_HORNS,35, 15, 5, 10, MELEE_DEC_DEF ,8},

	{ _("%sを大きな角で突いた。",
        "You thrust at %s with your large horns."),             MELEE_MODE_BIGHORN,1, 0, 3, 10, 0 ,3},
	{ _("%sを角でひっかけ空中へ投げ上げた！",
        "You throw %s into the air with your horns!"), MELEE_MODE_BIGHORN,15, 0, 4, 10, MELEE_DEC_DEF ,6},
	{ _("%sを巨大な角で貫いた！",
        "You pierce %s with your huge horns!"),				MELEE_MODE_BIGHORN,30, 10, 6, 10, MELEE_DEC_DEF ,8},
	{ _("%sを巨大な角で引き裂いた！",
        "You cleave %s with your huge horns!"),			MELEE_MODE_BIGHORN,40, 15, 10, 10, MELEE_DEC_DEF ,12},

	{ _("%sを太い尻尾で打った。",
        "You slam %s with your big tail."),       MELEE_MODE_BIGTAIL,1, 0, 2, 7, 0 ,4},
	{ _("%sを強靭な尻尾で打ち据えた。",
        "You strike %s with your tough tail."),   MELEE_MODE_BIGTAIL,15, 0, 4, 7, MELEE_STUN ,6},
	{ _("%sを強靭な尻尾で薙ぎ払った。",
        "You sweep %s with your tough tail."),   MELEE_MODE_BIGTAIL,30, 10, 6, 7, MELEE_STUN ,8},
	{ _("強靭な尻尾がうなりを上げて%sに叩きつけられた！",
        "You raise your tough tail, roar, and slam it down on %s!"), MELEE_MODE_BIGTAIL,40, 30, 9,9, MELEE_STUN2 ,12},

	{ _("%sを踏みつけた！", "You trample %s!"),       MELEE_MODE_GIGA_KICK,1, 0, 9, 10, MELEE_DELAY ,10},
	{ _("%sを蹴り飛ばした！",
        "Your kick sends %s flying!"),       MELEE_MODE_GIGA_KICK,10, 10, 11, 10, MELEE_DELAY ,15},
	{ _("%sを踏み潰した！",
        "You stomp %s into the ground!"),       MELEE_MODE_GIGA_KICK,20, 20, 11, 12, MELEE_DELAY ,20},

	{ _("%sを払い飛ばした！",
        "Your blow sends %s flying!"),       MELEE_MODE_GIGA_PUNCH,1,  0, 8, 10, MELEE_STUN2 ,10},
	{ _("%sをぶん投げた！",
        "You hurl %s!"),       MELEE_MODE_GIGA_PUNCH,20, 20, 10, 12, MELEE_STUN3 ,15},
	{ _("巨大な拳が%sを叩き潰した！",
        "You slam %s with your gigantic fist!"),       MELEE_MODE_GIGA_PUNCH,40, 25, 13, 13, MELEE_STUN3 ,20},

	{ _("あなたの体からリスが飛び出して%sへ喰い付いた！",
        "A squirrel jumps out of your body at %s!"),     MELEE_MODE_ULTIMATE,1, 5, 6, 10, MELEE_DEC_DEF ,4},
	{ _("巨大なタコのような触手が%sを締め上げた！",
        "You crush %s with a massive octopus tentacle!"),       MELEE_MODE_ULTIMATE,10,  0, 8, 10, MELEE_STUN2 ,10},
	{ _("腕から刃が生え、%sを切り裂いた！",
        "You grow a blade in your arm and cleave %s!"),       MELEE_MODE_ULTIMATE,20,  0, 10, 10, MELEE_DEC_ATK ,10},
	{ _("硬質化した羽が射出され、さらにそれがピラニアに変身して%sへ食らいついた！",
        "You shoot out feathers, then turn them into piranhas that bite at %s!"),       MELEE_MODE_ULTIMATE,40,  20, 12, 10, MELEE_DEC_MAG ,10},
	{ _("「は　も　ん　し　っ　そ　う　だとォーッ！？」",
        "'HAMON OVERDRIVE!?'"),       MELEE_MODE_ULTIMATE,48, 40, 15, 15, MELEE_STUN3 ,20},

	{ _("%sへ通背拳を食らわせた。",
        "You extend your fist and punch %s."),           MELEE_MODE_LONGARM,1, 0, 1, 8, 0 ,3},
	{ _("%sへゴムゴムの銃を放った。",
        "You hit %s with Gomu Gomu no Pistol."),         MELEE_MODE_LONGARM,10, 0, 2, 8, 0 ,4},
	{ _("あなたの腕が蛇のように伸びて%sを締め上げた。",
        "Your arm extends like a snake and crushes %s."),     MELEE_MODE_LONGARM,20, 15, 4, 8, MELEE_STUN ,8},
	{ _("%sへゴムゴムの機関銃を放った！",
        "You hit %s with Gomu Gomu no Machinegun!"),         MELEE_MODE_LONGARM,30, 20, 6, 8, MELEE_STUN ,4},
	{ _("%sへクリプティックニードルを放った！",
        "You hit %s with Cryptic Needle!"),     MELEE_MODE_LONGARM,40, 25, 8, 8, MELEE_DEC_MAG ,8},

	{ _("%sへ鋭い爪が食い込んだ。",
        "You slash %s with your sharp claws."),           MELEE_MODE_VAMP,1, 0, 1, 8, MELEE_VAMP ,2},
	{ _("%sへ鋭い牙を突き立てた。",
        "You sink your sharp fangs into %s."),           MELEE_MODE_VAMP,20, 10, 2, 8, MELEE_VAMP ,3},
	{ _("%sに噛み付き、そのまま空中に投げ上げた！",
        "You throw %s in the air with your fangs!"),           MELEE_MODE_VAMP,30, 10, 5, 8, MELEE_VAMP ,3},
	{ _("無数の蝙蝠が%sをズタズタにした！",
        "Countless bats assault %s!"),           MELEE_MODE_VAMP,40, 30, 8, 8, MELEE_VAMP ,8},

	{ _("%sへチョップを食らわせた。",
        "You hit %s with a chop."),					    MELEE_MODE_PUNCH_NINJA,1, 0, 3, 5, 0 ,6},
	{ _("%sへカワラ割りを食らわせた。",
        "You hit %s with Kawara-wari."),				    MELEE_MODE_PUNCH_NINJA,5, 0, 5, 5, 0 ,8},
	{ _("%sへワン・インチ・パンチを食らわせた！",
        "You hit %s with One Inch Punch!"),			MELEE_MODE_PUNCH_NINJA,10, 5, 7, 5, 0 ,10},
	{ _("%sへアラバマオトシを食らわせた！",
        "You hit %s with Arabama-Otoshi!"),				MELEE_MODE_PUNCH_NINJA,20, 10, 8, 8, MELEE_STUN2 ,12},
	{ _("%sへ対空ポムポム・パンチを食らわせた！",
        "You hit %s with anti-aerial pom-pom punch!"),         MELEE_MODE_PUNCH_NINJA,30, 20,10,10, MELEE_DELAY ,14},
	{ _("%sへダブル・ポン・パンチを食らわせた！",
        "You hit %s with a Double Pon Punch!"),         MELEE_MODE_PUNCH_NINJA,40, 30,12,12, MELEE_DEC_DEF ,16},

	{ _("%sへケリ・キックを食らわせた。",
        "You hit %s with a kick."),				    MELEE_MODE_KICK_NINJA,10, 0, 5, 5, MELEE_DELAY ,6},
	{ _("%sへ伝説のサマーソルトキックを食らわせた！",
        "You hit %s with Legendary Somersault Kick!"),		    MELEE_MODE_KICK_NINJA,20, 10, 7, 7, MELEE_DEC_ATK ,8},
	{ _("%sへドラゴン・トビゲリを食らわせた！",
        "You hit %s with Dragon Tobigeri!"),		    MELEE_MODE_KICK_NINJA,30, 20, 9, 9, MELEE_DEC_MAG ,10},
	{ _("%sへタツマキケンを食らわせた！",
        "You hit %s with Tatsumaki-ken!"),				    MELEE_MODE_KICK_NINJA,40, 30, 12, 12, MELEE_STUN2 ,15},

	{ _("%sを巨大な爪で引っ掻いた！",
        "You rip %s with your huge claws!"),     MELEE_MODE_BEAST,1,   0, 6, 10, MELEE_DEC_ATK ,4},
	{ _("%sを噛んだ！", "You bite %s!"),					MELEE_MODE_BEAST,10,  0, 8, 10, MELEE_DEC_DEF ,7},
	{ _("%sを後ろ脚で蹴った！",
        "You kick %s with your hind legs!"),			MELEE_MODE_BEAST,20, 10, 10, 10, MELEE_DELAY ,10},
	{ _("%sへ強烈な体当たりを仕掛けた！",
        "You deliver a fierce bodyblow to %s!"), MELEE_MODE_BEAST,30, 20, 12, 10, MELEE_STUN2 ,13},
	{ _("%sへ巨大な牙を突き立てた！",
        "You sink your huge fangs into %s!"),     MELEE_MODE_BEAST,40, 30, 13, 14, MELEE_STUN3 ,20},

	{ _("%sを鋭い爪で突いた。",
        "You thrust your sharp claws into %s."),			MELEE_MODE_EX_CLAW,1,   0, 3, 9, 0 ,3},
	{ _("%sを鋭い爪で切り裂いた！",
        "You cleave %s with your sharp claws!"),		MELEE_MODE_EX_CLAW,12,  5, 5, 9, MELEE_DEC_DEF ,4},
	{ _("%sを鋭い爪で貫いた！",
        "You pierce %s with your sharp claws!"),			MELEE_MODE_EX_CLAW,20, 10, 7, 9, MELEE_DEC_DEF ,5},
	{ _("%sをぶった斬った！",
        "You deeply cut %s!"),				MELEE_MODE_EX_CLAW,27, 15, 9, 9, MELEE_DEC_DEF ,7},
	{ _("%sをなます切りにした！",
        "You slice %s up!"),			MELEE_MODE_EX_CLAW,33, 20,10, 9, MELEE_DEC_DEF ,8},
	{ _("%sを斬って斬って斬りまくった！",
        "You cut %s over and over and over!"),	MELEE_MODE_EX_CLAW,39, 25,11, 9, MELEE_DEC_DEF ,9},
	{ _("輝く爪が%sを滅多切りにした！",
        "You gouge %s with your shining claws!"),   MELEE_MODE_EX_CLAW,43, 30,14, 9, MELEE_DEC_DEF ,12},

	{ _("%sへ纏わりついた。",
        "You cling to %s."),     MELEE_MODE_SLIME,1, 0, 2, 2, MELEE_SLOW ,4},
	{ _("%sを溶かした！",
        "You melt %s!"),     MELEE_MODE_SLIME,20, 30, 5, 5, MELEE_MELT ,8},
	{ _("%sを消化した！",
        "You dissolve %s!"),     MELEE_MODE_SLIME,40, 30, 8, 8, MELEE_MELT ,10},

	{ _("愛宕様の火が%sを焼いた！",
        "%s is scorched by Atago-sama's flames!"),     MELEE_MODE_ATAGO,1, 0, 13, 16, MELEE_ATAGO,10},

	{ _("%sを触った。",
        "You touch %s."),     MELEE_MODE_KOISHI,1, 0, 1, 1, 0 ,1},
	{ _("体が%sへ当たった。",
        "You hit %s with a bodyblow."),     MELEE_MODE_KOISHI,5, 0, 3, 3, 0 ,3},
	{ _("%sに踵が当たった。",
        "You hit %s with your heel."),     MELEE_MODE_KOISHI,7, 0, 5, 4, MELEE_STUN ,5},
	{ _("くしゃみをした。",
        "You sneeze."),     MELEE_MODE_KOISHI,10, 10, 2, 7, MELEE_DEC_MAG ,3},
	{ _("帽子を取ろうとした手が%sに当たった。",
        "You grab your hat and strike %s."),     MELEE_MODE_KOISHI,15, 0, 2, 10, MELEE_STUN2 ,5},
	{ _("膝が%sに当たった。",
        "You hit %s with your knee."),     MELEE_MODE_KOISHI,20, 0, 2, 10, MELEE_DEC_MAG ,5},
	{ _("花びらをまとった跳躍に%sが跳ね飛ばされた。",
        "You bounce at %s with petals flying around you."),     MELEE_MODE_KOISHI,25, 20, 6, 6, MELEE_STUN ,5},
	{ _("巨大な電球が現れて%sを吹き飛ばした！",
        "A giant lightbulb appears and sends %s flying!"),     MELEE_MODE_KOISHI,30, 0, 4, 10, MELEE_STUN ,5},
	{ _("突然薔薇が咲いて%sへ棘が刺さった。",
        "A rose suddenly springs up and pierces %s with its thorns."),     MELEE_MODE_KOISHI,33, 0, 4, 9, MELEE_DEC_MAG ,4},
	{ _("サードアイのコードが鞭のように%sを打ち据えた。",
        "You strike %s with your third eye's cord like a whip."),     MELEE_MODE_KOISHI,36, 10, 3, 10, MELEE_STUN2 ,6},
	{ _("中空に描いたハートマークが%sに当たった。",
        "A heart mark drawn in midair strikes %s."),     MELEE_MODE_KOISHI,39, 0, 4, 9, MELEE_DEC_MAG ,4},
	{ _("%sは薔薇に覆い尽くされた。",
        "%s is covered in roses."),     MELEE_MODE_KOISHI,44, 40, 8, 10, MELEE_DEC_ALL ,10},

	{ _("%sへ体当たりした。",
        "You tackle %s."),     MELEE_MODE_MIST,1, 0, 2, 5, MELEE_SLOW ,4},
	{ _("%sを覆った。",
        "You surround %s."),     MELEE_MODE_MIST,12, 0, 3, 6, MELEE_SLOW ,4},
	{ _("%sを飲み込んだ。",
        "You envelop %s."),     MELEE_MODE_MIST,23, 0, 4, 7, MELEE_SLOW ,7},
	{ _("錐のように尖って%sを突いた。",
        "You take the shape of a cone and thrust at %s."),     MELEE_MODE_MIST,36, 20, 5, 8, 0 ,10},
	{ _("巨大な獣の形をとって%sへ突進した！",
        "You take the shape of a huge beast and charge at %s!"),     MELEE_MODE_MIST,44, 40, 7, 9, MELEE_STUN2 ,15},

	{ _("巨大な爪が%sを切り裂いた！",
        "You cleave %s with your huge claws!"),       MELEE_MODE_DRAGON,1,  0, 10, 10, MELEE_DEC_DEF ,10},
	{ _("巨大な尻尾が%sを薙ぎ払った！",
        "You sweep %s with your huge tail!"),       MELEE_MODE_DRAGON,1,  0, 10, 12, MELEE_STUN3 ,15},
	{ _("%sへ向かって急降下し、そのまま押し潰した！",
        "You dive at and crush %s!"),       MELEE_MODE_DRAGON,1, 0, 13, 13, MELEE_STUN3 ,20},
	{ _("巨大な角が%sを貫いた！",
        "You pierce %s with your huge horns!"),       MELEE_MODE_DRAGON,1, 0, 15, 12, MELEE_DEC_DEF ,12},
	{ _("巨大な牙が%sを引き裂いた！",
        "You rip %s with your huge fangs!"),       MELEE_MODE_DRAGON,1, 0, 15, 15, MELEE_DEC_DEF ,20},
	{ _("%sへ強烈な火炎を吹き付けた！",
        "You breathe intense flames at %s!"),       MELEE_MODE_DRAGON,1, 0, 16, 16,MELEE_ATAGO ,10},

	{ _("%sを叩いた。",
        "You strike %s."),						MELEE_MODE_CIRNO,1, 0, 1, 3, 0 ,2},
	{ _("%sを殴った。",
        "You punch %s."),						MELEE_MODE_CIRNO,3, 5, 2, 3, 0 ,2},
	{ _("%sへヘッドスライディングした。",
        "You slide at %s head forward."),		MELEE_MODE_CIRNO,10, 5, 3, 4, MELEE_DELAY ,4},
	{ _("氷を持って%sへ体当たりした。",
        "You grab ice in your hands and tackle %s."),		MELEE_MODE_CIRNO,15, 10, 3, 4, MELEE_COLD ,6},
	{ _("%sをげしげし蹴った。",
        "You hit %s with a sharp kick."),				MELEE_MODE_CIRNO,20, 10, 4, 6, MELEE_DELAY ,4},
	{ _("%sへ氷塊を投げつけた。",
        "You throw a lump of ice at %s."),				MELEE_MODE_CIRNO,24, 16, 3, 6, MELEE_COLD ,4},
	{ _("周囲の気温を急激に下げた！",
        "Temperature in your vicinity sharply decreases!"),			MELEE_MODE_CIRNO,30, 20, 4, 6, MELEE_COLD ,5},
	{ _("%sへスーパーアイスキックを食らわせた！",
        "You hit %s with a Super Ice Kick!"),   MELEE_MODE_CIRNO,35, 25, 6, 6, MELEE_COLD ,8},
	{ _("%sを氷の剣で斬った！",
        "You slash %s with an ice sword!"),				MELEE_MODE_CIRNO,40, 30, 7, 7, MELEE_COLD ,10},
	{ _("%sへ巨大な氷塊を投げつけた！",
        "You throw a huge lump of ice at %s!"),		MELEE_MODE_CIRNO,43, 40, 10, 10, MELEE_STUN2 ,15},

	{ _("%sへ掌底を食らわせた。",
        "You strike %s with your palm bottom."),   				MELEE_MODE_PUNCH2,1, 0, 1, 7, 0 ,6},
	{ _("%sへ正拳突きを食らわせた。",
        "You strike %s with your palm."),   			MELEE_MODE_PUNCH2,4, 0, 2, 5, 0 ,8},
	{ _("%sへワンツーパンチを食らわせた。",
        "You strike %s with a one-two punch."),   	MELEE_MODE_PUNCH2,8, 5, 3, 5, MELEE_STUN ,6},
	{ _("%sを手刀で突いた。",
        "You hit %s with a thrusting chop."),                 	MELEE_MODE_PUNCH2,12, 8, 4, 5, 0 ,3},
	{ _("%sへ脳天肘打ちを食らわせた。",
        "You hit %s with your elbow."),   		MELEE_MODE_PUNCH2,16, 10, 5, 5, MELEE_STUN2 ,5},
	{ _("%sへガゼルパンチを食らわせた。",
        "You hit %s with a gazelle punch."),   		MELEE_MODE_PUNCH2,19, 10, 5, 6, MELEE_STUN ,6},
	{ _("%sへハンマーパンチを喰らわせた。",
        "You hit %s with a hammer punch."),       MELEE_MODE_PUNCH2,21, 15, 6, 5, 0 ,10},
	{ _("%sへ崩拳を喰らわせた。",
        "You slam %s hard with your fist."),                 MELEE_MODE_PUNCH2,24, 20, 6, 7, 0 ,10},
	{ _("%sへアッパーカットを食らわせた。",
        "You hit %s with an uppercut."),   	MELEE_MODE_PUNCH2,27, 20, 7, 6, MELEE_STUN2 ,8},
	{ _("%sへロシアンフックを食らわせた。",
        "You hit %s with a Russian hook."),   	MELEE_MODE_PUNCH2,30, 25, 7, 7, 0 ,8},
	{ _("%sへスマッシュを食らわせた。",
        "You fiercely smash %s."),   		MELEE_MODE_PUNCH2,33, 30, 8, 7, MELEE_STUN2 ,10},
	{ _("%sへマシンガンジャブを食らわせた。",
        "You hit %s with machinegun jabs."),   	MELEE_MODE_PUNCH2,36, 25, 8, 8, MELEE_STUN ,6},
	{ _("鋭い手刀が%sを穿った！",
        "You hit %s with a sharp hand thrust!"),                 MELEE_MODE_PUNCH2,39, 30, 9, 9, 0 ,6},
	{ _("%sへ正中線四連突きを食らわせた！",
        "You hit %s with a quadruple strike!"),   	MELEE_MODE_PUNCH2,42, 35, 8, 12, MELEE_STUN ,10},
	{ _("%sへ羅刹掌を食らわせた！",
        "You hit %s with a Rakshasa Fist!"),   			MELEE_MODE_PUNCH2,45, 43, 10, 11, MELEE_STUN2 ,12},
	{ _("%sへ菩薩掌を食らわせた！",
        "You hit %s with a Bodhisattva Fist!"),   			MELEE_MODE_PUNCH2,48, 45, 12, 12, MELEE_STUN3 ,15},

	{ _("%sへローキックを放った。",
        "You hit %s with a low kick."),               MELEE_MODE_KICK2,1, 0, 1, 7, 0 ,5},
	{ _("%sへ前蹴りを食らわせた。",
        "You hit %s with a front kick."),   			MELEE_MODE_KICK2,7, 0, 2, 7, 0 ,8},
	{ _("%sへドロップキックを喰らわせた。",
        "You hit %s with a dropkick."),  		MELEE_MODE_KICK2,10, 10, 3, 7, MELEE_STUN ,9},
	{ _("%sへ踵落としを喰らわせた。",
        "You hit %s with a heel drop."),  			MELEE_MODE_KICK2,15, 10, 3, 8, MELEE_STUN ,8},
	{ _("%sへローリングソバットを食らわせた。",
        "You hit %s with a rolling sobat."),   MELEE_MODE_KICK2,20, 15, 4, 7, 0 ,10},
	{ _("%sへ顔面膝蹴りを食らわせた。",
        "You knee %s in the face."),   		MELEE_MODE_KICK2,25, 20, 6, 8, MELEE_STUN2 ,10},
	{ _("%sへ水月足刀蹴りを食らわせた！",
        "You hit %s with a sharp sweep!"), 		MELEE_MODE_KICK2,30, 30, 8, 8, MELEE_STUN2 ,11},
	{ _("%sへメイア・ルーア・ジ・コンパッソを食らわせた！",
        "You hit %s with Meir Lua the Compasso!"), MELEE_MODE_KICK2,35, 35, 10, 8, MELEE_STUN ,11},
	{ _("%sへ旋風脚を食らわせた！",
        "You hit %s with a whirlwind kick!"),				MELEE_MODE_KICK2,39, 35, 10, 9, MELEE_STUN2 ,10},
	{ _("%sへサマーソルトキックを食らわせた！",
        "You hit %s with a somersault kick!"),	MELEE_MODE_KICK2,44, 40, 10, 12, MELEE_STUN3 ,12},

	{ _("%sへ腕を振り回した。",
        "You swing your arms at %s."),                 	MELEE_MODE_YOSHIKA,1, 0, 1, 5, 0 ,3},
	{ _("%sをひっかいた。",
        "You scratch %s."),           		MELEE_MODE_YOSHIKA,3, 0, 2, 6, 0 ,3},
	{ _("%sへ体当たりした。",
        "You tackle %s."),                 	MELEE_MODE_YOSHIKA,8, 10, 4, 4, 0 ,7},
	{ _("%sを汚い爪で突いた。",
        "You thrust at %s with your toxic claws."),                 	MELEE_MODE_YOSHIKA,12, 15, 3, 6, MELEE_POIS ,4},
	{ _("%sへ両腕を振り下ろした。",
        "You slam both of your arms down on %s."),                 	MELEE_MODE_YOSHIKA,20, 40, 6, 4, MELEE_STUN ,6},
	{ _("腐臭のする口で%sを噛んだ。",
        "You bite %s with your foul-smelling mouth."),              	MELEE_MODE_YOSHIKA,27, 30, 7, 5, MELEE_POIS ,5},
	{ _("%sへ頭から突撃した！",
        "You charge at %s head first!"),                 	MELEE_MODE_YOSHIKA,31, 40, 7, 7, MELEE_STUN2 ,10},
	{ _("毒液滴る爪が%sを切り裂いた！",
        "You cleave %s with your poison-dripping claws!"),           MELEE_MODE_YOSHIKA,36, 30, 8, 7, MELEE_POIS ,8},
	{ _("呪われた牙が%sを引き裂いた！",
        "You rip %s with your cursed fangs!"),          MELEE_MODE_YOSHIKA,40, 40,  9, 10, MELEE_POIS ,12},
	{ _("妖しく輝く爪が%sを滅多切りにした！",
        "You slice %s up with your bewitchingly glowing claws!"),     MELEE_MODE_YOSHIKA,47, 44, 11, 13, MELEE_POIS ,12},

	{ _("目にも留まらぬ動きで%sを突いた！",
        "You thrust at %s at imperceivable speed!"),       	MELEE_MODE_LIGHTSPEED,1, 0, 5, 5, MELEE_STUN ,3},
	{ _("衝撃波と共に%sへ突撃した！",
        "You charge at %s with a shockwave!"),       	MELEE_MODE_LIGHTSPEED,10, 30, 8, 8, MELEE_STUN3 ,12},
	{ _("%sの周りを駆け巡りズタズタにした！",
        "You run circles around %s while dealing blows!"),       	MELEE_MODE_LIGHTSPEED,20, 30, 10, 10, MELEE_DEC_DEF ,6},
	{ _("一瞬で数十発の打撃が%sに叩き込まれた！",
        "You land tens of blows on %s in an instant!"),       	MELEE_MODE_LIGHTSPEED,30, 40, 14, 14, MELEE_STUN2 ,9},

	{ _("%sを触った。",
        "You touch %s."),                 	MELEE_MODE_MEDI,1, 0, 1, 5, MELEE_POIS ,1},
	{ _("%sを叩いた。",
        "You strike %s."),                 	MELEE_MODE_MEDI,5, 0, 2, 5, MELEE_POIS ,3},
	{ _("%sへ体当たりした。",
        "You tackle %s."),             MELEE_MODE_MEDI,12, 0, 3, 6, MELEE_POIS ,4},
	{ _("%sへ毒を吹き付けた。",
        "You breathe poison at %s."),         MELEE_MODE_MEDI,20, 20, 5, 7, MELEE_POIS ,4},
	{ _("%sへ毒を吹き込んだ！",
        "You envelop %s in poison!"),         MELEE_MODE_MEDI,30, 25, 8, 8, MELEE_POIS ,6},
	{ _("%sの体に劇毒が浸透した！",
        "You inject severe poison into %s!"),  MELEE_MODE_MEDI,40, 40, 10, 10, MELEE_POIS ,10},

	{ _("転がっていた石が%sへ飛んだ。",
        "You launch a pebble at %s."),			MELEE_MODE_MIND,1, 0, 3, 3, 0 ,4},
	{ _("岩が飛んで%sへ直撃した。",
        "You launch a rock at %s."),				MELEE_MODE_MIND,7, 10, 4, 4, MELEE_STUN ,8},
	{ _("%sは地面に激しく押し付けられた。",
        "You violently press %s into ground."),		MELEE_MODE_MIND,12, 20, 5, 5, MELEE_DELAY ,6},
	{ _("%sへ電撃を放った。",
        "You throw lightning at %s."),						MELEE_MODE_MIND,18, 20, 6, 6, MELEE_ELEC ,6},
	{ _("%sが宙に浮き、地面に叩きつけられた！",
        "%s floats in midair, and then is slammed down!"),   MELEE_MODE_MIND,24, 15, 7, 7, MELEE_STUN ,6},
	{ _("%sにエネルギー衝撃波を食らわせた！",
        "You hit %s with an energy shockwave!"),     MELEE_MODE_MIND,30, 20, 8, 9, MELEE_STUN2 ,10},
	{ _("突然%sの体が凍りついた！",
        "%s is suddenly covered in frost!"),				MELEE_MODE_MIND,36, 20, 9, 9, MELEE_COLD,5},
	{ _("突然%sの体が燃え上がった！",
        "%s is suddenly set ablaze!"),				MELEE_MODE_MIND,38, 20, 9, 10, MELEE_FIRE,5},
	{ _("%sの体が激しく捻られた！",
        "%s is twisted in an unnatural way!"),				MELEE_MODE_MIND,40, 25, 10, 10, MELEE_DEC_MAG,7},
	{ _("地響きと共に大地が裂け、%sを呑み込んだ！",
        "The earth rumbles as a large crack opens up, swallowing %s!"),    MELEE_MODE_MIND,45, 40, 12, 12, MELEE_STUN2 ,12},

	{ _("%sへ小さな蝶を飛ばした。",
        "You send a small butterfly at %s."),           MELEE_MODE_YUYUKO,1, 0, 2, 5, MELEE_DEC_ATK ,2},
	{ _("幽霊が%sへ体当たりした。",
        "A ghost slams into %s."),           MELEE_MODE_YUYUKO,6, 5, 2, 7, MELEE_STUN ,3},
	{ _("幽霊が足元から%sを払った。",
        "A ghost sweeps %s."),           MELEE_MODE_YUYUKO,11, 10, 2, 9, MELEE_STUN ,4},
	{ _("大きな蝶が弧を描いて%sを薙ぎ払った。",
        "A large butterfly flies in an arc and sweeps %s."),  MELEE_MODE_YUYUKO,16, 10, 4, 6, MELEE_DEC_ATK ,6},
	{ _("蝶を放ちながら宙返りした。",
        "You do a somersault while scattering butterflies around."),			  MELEE_MODE_YUYUKO,22, 20, 5, 7, MELEE_DEC_ATK ,8},
	{ _("指先から五条の光が%sへ放たれた。",
        "You fire five rays of light from your fingers at %s."),       MELEE_MODE_YUYUKO,28, 25, 7, 8, MELEE_DEC_ALL ,1},
	{ _("空中で蝶たちと共に大きく回転した。",
        "You spin in midair, surrounded by butterflies."),     MELEE_MODE_YUYUKO,33, 20, 8, 9, MELEE_DEC_ATK ,8},
	{ _("幽霊たちが%sへ一斉に突撃した。",
        "A swarm of ghosts charges at %s."),         MELEE_MODE_YUYUKO,39, 25, 9, 10, MELEE_STUN2 ,9},
	{ _("輝く蝶が%sを覆い尽くした。",
        "Glowing butterflies surround %s."),           MELEE_MODE_YUYUKO,44, 35, 10, 12, MELEE_DEC_ALL ,12},

	{ _("%sを睨んだ。",
        "You gaze at %s."),           MELEE_MODE_TOZIKO,1, 0, 1, 6, 0 ,2},
	{ _("%sへ火花を飛ばした。",
        "You throw sparks at %s."),           MELEE_MODE_TOZIKO,8, 0, 2, 6, 0 ,2},
	{ _("%sへ体当たりした。",
        "You tackle %s."),           MELEE_MODE_TOZIKO,14, 0, 3, 6, 0 ,5},
	{ _("%sへ放電した。",
        "You discharge electricity at %s."),           MELEE_MODE_TOZIKO,20, 20, 4, 6, MELEE_ELEC ,4},
	{ _("%sへ激しい電撃を食らわせた！",
        "You hit %s with an intense electric shock!"),           MELEE_MODE_TOZIKO,27, 30, 5, 7, MELEE_ELEC ,4},
	{ _("%sの頭上に雷が落ちた！",
        "You drop a thunderbolt on top of %s!"),           MELEE_MODE_TOZIKO,34, 35, 7, 7, MELEE_ELEC ,7},
	{ _("%sへ怒りの雷霆を見舞った！",
        "You assault %s with an intense thunderstorm!"),           MELEE_MODE_TOZIKO,40, 40, 10, 13, MELEE_ELEC ,10},

	{ _("%sの上に落下した。",
        "You fall on top of %s."),           MELEE_MODE_KISUME1,1, 0, 3, 8, MELEE_STUN ,8},
	{ _("%sの頭上へ強烈に落下した！",
        "You drop on top of %s with force!"), MELEE_MODE_KISUME2,1, 0, 5, 11, MELEE_STUN ,12},
	{ _("轟音と共に%sへ落下した！",
        "There is a loud bang as you drop on top of %s!"),     MELEE_MODE_KISUME3,1, 0, 8, 15, MELEE_STUN2 ,16},
	{ _("風を切って%sへ落下した！",
        "You drop on top of %s faster than wind!"),     MELEE_MODE_KISUME4,1, 0, 12, 20, MELEE_STUN3 ,20},
	{ _("大地を揺るがして%sの上に落下した！",
        "You drop on top of %s, making the ground shake!"),           MELEE_MODE_KISUME5,1, 0, 22, 22, MELEE_STUN3 ,20},

	{ _("%sを笏でぺちんと叩いた。",
        "You strike %s with your shaku."),		MELEE_MODE_MIKO,1, 0, 2, 3, 0 ,2},
	{ _("%sを笏で突いた。",
        "You thrust at %s with your shaku."),			MELEE_MODE_MIKO,5, 2, 3, 3, 0 ,2},
	{ _("笏が回転し%sを打ち据えた。",
        "You spin your shaku, beating %s up."),		MELEE_MODE_MIKO,11, 5, 4, 3, 0 ,3},
	{ _("%sを笏で思い切り引っぱたいた！",
        "You intensively strike at %s with your shaku!"),	MELEE_MODE_MIKO,16, 8, 5, 5, MELEE_STUN ,4},
	{ _("炎を纏った足で%sを蹴った。",
        "You wreathe your foot in flames and kick %s."),		MELEE_MODE_MIKO,20, 12, 6, 8, MELEE_FIRE ,6},
	{ _("大きく振った両腕が%sを切り裂いた！",
        "You cleave %s with two wide swings!"),	MELEE_MODE_MIKO,24, 10, 7, 5, MELEE_DEC_DEF ,5},
	{ _("%sを蹴って燃え上がらせた！",
        "You kick and set %s on fire!"),	MELEE_MODE_MIKO,28, 15, 8, 8, MELEE_FIRE ,8},
	{ _("宙に描いた光輪が%sを切り裂いた！",
        "You draw a ring of light in midair, launching it to cleave %s!"),	MELEE_MODE_MIKO,32, 25, 9, 8, MELEE_DEC_DEF ,7},
	{ _("巨大な刃が虚空から%sへ突き出した！",
        "A huge blade pierces %s out of nowhere!"),	MELEE_MODE_MIKO,38, 30, 10, 10, MELEE_DEC_DEF ,9},
	{ _("輝く剣が天から%sへ向けて降り注いだ！",
        "A shining sword drops down on %s from above!"),	MELEE_MODE_MIKO,45, 35, 11, 12, MELEE_DEC_DEF ,12},

	{ _("扇を取出し%sを叩いた。",
        "You take out your fan and strike %s."),			MELEE_MODE_KOKORO,1, 0, 2, 3, 0 ,2},
	{ _("扇で%sを激しく打ち据えた。",
        "You violently slap %s with your fan."),			MELEE_MODE_KOKORO,7, 0, 3, 3, 0 ,3},
	{ _("%sへ突進した。",
        "You charge at %s."),				MELEE_MODE_KOKORO,12, 10, 4, 4, 0 ,7},
	{ _("面の一つが%sへ被さった。",
        "You slam one of your masks into %s."),			MELEE_MODE_KOKORO,16, 25, 5, 3, MELEE_STUN2 ,4},
	{ _("光る薙刀を構え、%sへ斬りかかった。",
        "You swing at %s with a glowing naginata."),		MELEE_MODE_KOKORO,21, 10, 5, 5, MELEE_DELAY ,6},
	{ _("両手に扇を持ち%sへ向けて激しく回転した！",
        "You grab fans in both of your hands and swiftly spin at %s!"),	MELEE_MODE_KOKORO,27, 20, 6, 5, 0 ,6},
	{ _("気の放出で%sを弾き飛ばした！",
        "You knock %s back with your sheer spirit release!"),		MELEE_MODE_KOKORO,30, 20, 7, 5, MELEE_STUN ,6},
	{ _("%sを薙刀で続けざまに切り裂いた！",
        "You keep slashing at %s with your naginata!"),		MELEE_MODE_KOKORO,36, 25, 9, 9, MELEE_DELAY ,8},
	{ _("多数の面が%sへ飛んだ！",
        "You send several masks flying at %s!"),			MELEE_MODE_KOKORO,40, 35, 8, 10, MELEE_STUN3 ,8},
	{ _("%sを舞うように切り刻んだ！",
        "You dance as you slice %s up!"),		MELEE_MODE_KOKORO,48, 45, 12, 12, MELEE_DELAY ,15},

	{ _("%sを手刀で打った。",
        "You strike %s with a hand knife."),						MELEE_MODE_NINJA,1, 0, 1, 3, 0 ,1},
	{ _("%sを手刀で突いた。",
        "You thrust a hand knife at %s."),						MELEE_MODE_NINJA,6, 0, 1, 6, 0 ,2},
	{ _("あなたの腕がうねるように%sへ伸びた。",
        "You quickly strike %s with your arm."),	MELEE_MODE_NINJA,15, 0, 2, 4, 0 ,2},
	{ _("地を滑るように%sへ飛びかかった。",
        "You swiftly slide towards %s and strike."),		MELEE_MODE_NINJA,21, 10, 2, 6, 0 ,3},
	{ _("剃刀のような手刀が%sを切り裂いた。",
        "You slice %s with a razor-sharp hand knife."),		MELEE_MODE_NINJA,27, 20, 3, 6, 0 ,4},
	{ _("隼のように%sを強襲した。",
        "You assault %s like a falcon."),				MELEE_MODE_NINJA,33, 30, 4, 6, 0 ,5},
	{ _("鋼鉄のような貫手が%sを貫いた！",
        "You pierce %s with a steel-hard blow!"),			MELEE_MODE_NINJA,40, 35, 5, 7, 0 ,6},
	{ _("死角から%sを奇襲した！",
        "You assault %s from a blind spot!"),					MELEE_MODE_NINJA,46, 40, 8, 8, MELEE_DELAY ,10},

	{ _("%sへ体当たりした。",
        "You tackle %s."),						MELEE_MODE_CHEN,1, 0, 1, 9, 0 ,3},
	{ _("%sへ飛びかかった。",
        "You leap at %s."),						MELEE_MODE_CHEN,6, 0, 2, 9, MELEE_STUN ,3},
	{ _("%sを縦横無尽に引っ掻いた！",
        "You scratch %s all over!"),				MELEE_MODE_CHEN,15, 5, 3, 9, 0 ,5},
	{ _("%sへ天を衝くようなアッパーを放った！",
        "You hit %s with a heaven-shaking uppercut!"),   MELEE_MODE_CHEN,22, 12, 5, 9, MELEE_STUN ,6},
	{ _("%sの背後へ素早く回りこみ奇襲した！",
        "You quickly run behind %s and strike!"),		MELEE_MODE_CHEN,30, 20, 7, 9, 0 ,8},
	{ _("高速回転し%sへ突っ込んだ！",
        "You charge at %s while spinning at high speed!"),				MELEE_MODE_CHEN,36, 20, 8, 10, MELEE_STUN ,10},
	{ _("%sへ赤青の気弾を叩きつけた！",
        "You throw red and blue bullets at %s!"),			MELEE_MODE_CHEN,45, 35, 10, 11, MELEE_STUN2 ,12},


	{ _("%sを柄杓の角で叩いた。",
        "You strike %s with a corner of your ladle."),                 MELEE_MODE_MURASA1, 1, 0, 1, 7, 0 ,1},
	{ _("%sを蹴った。",
        "You kick %s."),         		        	MELEE_MODE_MURASA1, 6, 0, 2, 5, 0 ,4},
	{ _("%sを水の入ったバケツで殴った！",
        "You strike %s with a bucket full of water!"),         MELEE_MODE_MURASA1,11, 0, 3, 5, 0 ,6},
	{ _("%sを蹴り上げた！",
        "You hit %s with a rising kick!"),         		        MELEE_MODE_MURASA1,16, 5, 4, 5, 0 ,5},
	{ _("%sの上に錨が落ちた！",
        "You drop an anchor on top of %s!"),                 	MELEE_MODE_MURASA1,21, 10, 5, 7, 0 ,8},
	{ _("%sを錨で殴った！",
        "You strike %s with an anchor!"),                 		MELEE_MODE_MURASA1,25, 20, 6, 7, MELEE_STUN ,10},
	{ _("%sを蹴って蹴って蹴りまくった！",
        "You keep kicking %s over and over!"),         MELEE_MODE_MURASA1,30, 25, 6, 8, 0 ,5},
	{ _("%sへ錨を叩き付けた！",
        "You slam %s with an anchor!"),              	   	MELEE_MODE_MURASA1,35, 30, 7, 9, MELEE_STUN2 ,10},
	{ _("巨大な錨が%sを叩き潰した！",
        "You crush %s with a huge anchor!"),             MELEE_MODE_MURASA1,40, 35, 8, 10, MELEE_STUN2 ,12},

	{ _("%sを柄杓の角で叩いた。",
        "You strike %s with a corner of your ladle."),                  	MELEE_MODE_MURASA2, 1, 0, 1, 9, 0 ,3},
	{ _("水中から%sを奇襲した。",
        "You leap out of water at %s."),  	               	MELEE_MODE_MURASA2, 8, 0, 3, 8, 0 ,4},
	{ _("%sを大波が襲った！",
        "You hit %s with a large wave!"),            	     		MELEE_MODE_MURASA2, 15, 0, 5, 7, MELEE_WATER ,8},
	{ _("%sにしがみつき、水中に引きずり込んだ！",
        "You drag %s into the water!"),     MELEE_MODE_MURASA2, 22, 10, 6, 8, MELEE_SINK ,7},
	{ _("%sに錨をぶつけて水中に叩き込んだ！",
        "You slam %s down into the water with an anchor!"),			MELEE_MODE_MURASA2, 28, 20, 7, 8, MELEE_SINK ,10},
	{ _("水面から無数の鎖が%sへ伸びた・・",
        "Countless chains rise up from the water surface, grabbing at %s..."),			MELEE_MODE_MURASA2, 35, 30, 9, 10, MELEE_SINK ,8},
	{ _("大渦が巻き起こり、%sを呑み込んだ！",
        "You summon a large whirlpool, enveloping %s!"),       	MELEE_MODE_MURASA2, 43, 40, 10, 12, MELEE_SINK ,13},

	{ _("%sを殴った。",
        "You punch %s."),								MELEE_MODE_SHINMYOU2, 1, 0, 1, 7, 0 ,1},
	{ _("%sを蹴った。",
        "You kick %s."),         		        		MELEE_MODE_SHINMYOU2, 7, 0, 2, 7, 0 ,4},
	{ _("%sに椀を蹴り当てた。",
        "You kick your bowl at %s."),						MELEE_MODE_SHINMYOU2,13, 0, 3, 6, MELEE_DELAY ,6},
	{ _("%sへ体当りした。",
        "You tackle %s."),         					MELEE_MODE_SHINMYOU2,18, 5, 5, 5, 0 ,5},
	{ _("%sへ椀を叩きつけた。",
        "You slam %s with your bowl."),                 		MELEE_MODE_SHINMYOU2,24, 10, 6, 7,MELEE_DELAY ,8},
	{ _("椀に乗ってコマネズミのように%sへ突進した！",
        "You ride your bowl, charging at %s!"), MELEE_MODE_SHINMYOU2,28, 20, 7, 7, MELEE_DELAY ,5},
	{ _("打出の小槌で%sを殴った！",
        "You strike %s with Miracle Mallet!"),					MELEE_MODE_SHINMYOU2,33, 25, 8, 8, MELEE_STUN ,8},
	{ _("高速回転する椀が%sを巻き込んだ！",
        "Your bowl spins at high speed and slams into %s!"),           MELEE_MODE_SHINMYOU2,39, 30, 9, 9, MELEE_DELAY ,10},
	{ _("%sへ向けて打ち出の小槌をぶん回した！",
        "You slam your Miracle Mallet into %s!"),       MELEE_MODE_SHINMYOU2,43, 35, 10, 11, MELEE_STUN2 ,12},

	{ _("%sを引っ叩いた。",
        "You strike %s."),               MELEE_MODE_REIMU1,1, 0, 1, 7, 0 ,3},
	{ _("%sを蹴った。",
        "You kick %s."),					MELEE_MODE_REIMU1,4, 0, 2, 5, 0 ,5},
	{ _("%sへ横蹴りを食らわせた。",
        "You hit %s with a side kick."),		MELEE_MODE_REIMU1,7, 0, 2, 6, 0 ,6},
	{ _("%sへハイキックを食らわせた。",
        "You hit %s with a high kick."),	MELEE_MODE_REIMU1,10, 0, 2, 8, MELEE_STUN ,6},
	{ _("%sへ掌底を食らわせた。",
        "You strike %s with your palm."),			MELEE_MODE_REIMU1,14, 5, 3, 8, 0 ,6},
	{ _("%sへ飛び蹴りを食らわせた。",
        "You hit %s with a flying kick."),     MELEE_MODE_REIMU1,18, 10, 4, 7, 0 ,7},
	{ _("%sへ浴びせ蹴りを食らわせた。",
        "You hit %s with a brutal kick."),   MELEE_MODE_REIMU1,23, 15, 5, 7, 0 ,7},
	{ _("%sへ双掌打を食らわせた！",
        "You hit %s with a twin palm strike!"),       MELEE_MODE_REIMU1,27, 15, 6, 7, MELEE_STUN ,8},
	{ _("%sへ逆立ち蹴りを食らわせた！",
        "You hit %s with a handstand kick!"),   MELEE_MODE_REIMU1,32, 20, 7, 7, 0 ,8},
	{ _("%sへ三角飛び蹴りを食らわせた！",
        "You hit %s with a triangle flying kick!"), MELEE_MODE_REIMU1,36, 25,  8,  8, MELEE_STUN ,8},
	{ _("%sへ昇天脚を食らわせた！",
        "You hit %s with Ascension Kick!"),		MELEE_MODE_REIMU1,40, 25,  9, 10, MELEE_STUN2 ,10},
	{ _("%sへ天覇風神脚を放った！",
        "You hit %s with Sky-Conquering Wind God Kick!"),		MELEE_MODE_REIMU1,45, 35, 12, 12, MELEE_STUN3 ,14},

	{ _("%sへお札を貼り付けた。",
        "You stick an ofuda on %s."),         MELEE_MODE_REIMU2,1, 0, 2, 7, MELEE_SLAY_EVIL ,3},
	{ _("%sへ巨大な護符を放った。",
        "You throw a huge seal at %s."),		MELEE_MODE_REIMU2,6, 0, 3, 6, MELEE_SLAY_EVIL ,6},
	{ _("結界を展開し%sを絡めとった。",
        "You restrain %s with a barrier."),	MELEE_MODE_REIMU2,12, 5, 5, 7, MELEE_SLAY_EVIL ,6},
	{ _("%sへ雨のように札を降らせた！",
        "You rain ofuda down upon %s!"),   MELEE_MODE_REIMU2,18, 10, 7, 7, MELEE_SLAY_EVIL ,7},
	{ _("結界を射出し%sをふっ飛ばした！",
        "You knock %s back with a barrier!"), MELEE_MODE_REIMU2,24, 15, 7, 9, MELEE_STUN2 ,8},
	{ _("瞬間移動し%sの上から奇襲した！",
        "You teleport above %s and strike!"), MELEE_MODE_REIMU2,30, 20,  8, 10, MELEE_STUN2 ,8},
	{ _("%sへ陰陽宝玉を放った！",
        "You hit %s with Yin-Yang Treasured Orb!"),			MELEE_MODE_REIMU2,35, 25, 10, 12, MELEE_SLAY_EVIL ,10},
	{ _("%sへ八方龍殺陣を放った！",
        "You hit %s with Omnidirectional Dragon-Slaying Circle!"),		MELEE_MODE_REIMU2,40, 35, 13, 13, MELEE_STUN3 ,14},
	{ _("%sへ陰陽鬼神玉を放った！",
        "You hit %s with Yin-Yang Kishin Orb!"),		MELEE_MODE_REIMU2,45, 40, 16, 16, MELEE_SLAY_EVIL ,14},

	{ _("%sを睨んだ。",
        "You gaze at %s."),								MELEE_MODE_D_LORD,1, 0, 2, 7, 0 ,3},
	{ _("%sへ獄炎ナックルを食らわせた！",
        "You hit %s with Hellfire Knuckle!"),				MELEE_MODE_D_LORD,20, 10, 12, 12, MELEE_ATAGO ,6},
	{ _("%sへネオサタンインパクトを食らわせた！",
        "You hit %s with Neo Satan Impact!"),		MELEE_MODE_D_LORD,31, 30, 8, 8, MELEE_POIS ,3},
	{ _("%sへカラミティエンドを食らわせた！",
        "You hit %s with Calamity End!"),			MELEE_MODE_D_LORD,32, 10, 10, 10, 0 ,7},
	{ _("%sへサイコキネシスを食らわせた！",
        "You hit %s with Psychokinesis!"),			MELEE_MODE_D_LORD,33, 20, 12, 12, MELEE_STUN3 ,7},
	{ _("%sへダークネスイリュージョンを食らわせた！",
        "You hit %s with Darkness Illusion!"), MELEE_MODE_D_LORD,40, 35, 13, 13, MELEE_STUN3 ,10},
	{ _("%sへトレルダルグルグルパンチを食らわせた！",
        "You hit %s with Toroidal Spinning Punch!"), MELEE_MODE_D_LORD,47, 45, 16, 16, MELEE_STUN3 ,10},

	{ _("%sを引っ掻いた。",
        "You scratch %s."),							MELEE_MODE_REMY_HAND,1, 0, 1, 7, 0 ,3},
	{ _("%sを鋭い爪で切り裂いた！",
        "You rip %s with your sharp claws!"),					MELEE_MODE_REMY_HAND,7, 0, 3, 5, MELEE_DEC_DEF ,5},
	{ _("%sを鋭い爪で切り上げた！",
        "You hit %s with a rising claw attack!"),					MELEE_MODE_REMY_HAND,12, 0, 6, 6, MELEE_DEC_DEF ,6},
	{ _("%sへ触れた。",
        "You touch %s."),								MELEE_MODE_REMY_HAND,18, 0, 6, 7, MELEE_VAMP ,6},
	{ _("%sへ引き裂くようなフックを放った！",
        "You hit %s with a side cleave!"),			MELEE_MODE_REMY_HAND,26, 5, 7, 9, MELEE_STUN ,6},
	{ _("%sを大きく続けざまに切り裂いた！",
        "You deeply slash %s up!"),			MELEE_MODE_REMY_HAND,34, 20, 10, 11, MELEE_DEC_DEF ,7},
	{ _("紅い十字のオーラが%sを吹き飛ばした！",
        "You launch a scarlet cross aura at %s!"),		MELEE_MODE_REMY_HAND,45, 40, 13, 13, MELEE_STUN3 ,18},

	{ _("%sを爪先で蹴った。",
        "You kick %s, striking with your claws."),							MELEE_MODE_REMY_KICK,1, 0, 2, 5, 0 ,3},
	{ _("%sを強烈に蹴り上げた！",
        "You violently kick %s!"),						MELEE_MODE_REMY_KICK,10, 0, 3, 8, MELEE_STUN ,5},
	{ _("足元から蝙蝠が現れ%sへ飛んだ。",
        "Bats appear from your feet and fly at %s."),				MELEE_MODE_REMY_KICK,17, 0, 5, 8, MELEE_VAMP ,6},
	{ _("%sへ叩きつけるような空中回転蹴りを放った！",
        "You hit %s with a midair spinning kick!"),	MELEE_MODE_REMY_KICK,24, 10, 8, 8, MELEE_STUN ,7},
	{ _("%sへ切り裂くような蹴りを見舞った！",
        "You slice %s up with your kicks!"),			MELEE_MODE_REMY_KICK,33, 15, 8, 11, MELEE_STUN ,8},
	{ _("踊るように%sを蹴りまくった！",
        "You keep kicking %s as if you were dancing!"),				MELEE_MODE_REMY_KICK,40, 25, 10, 12, MELEE_STUN2 ,10},

	{ _("翼で%sを打った。",
        "You strike %s with your wings."),							MELEE_MODE_REMY_OTHER,1, 0, 1, 7, 0 ,3},
	{ _("%sへ滑るようなスライディングを放った。",
        "You hit %s with a sliding attack."),		MELEE_MODE_REMY_OTHER,8, 0, 3, 5, MELEE_DELAY ,5},
	{ _("大きくしなった翼が%sへ叩きこまれた！",
        "You strike %s with giant wings!"),		MELEE_MODE_REMY_OTHER,12, 0, 4, 6, MELEE_STUN ,6},
	{ _("%sへ吸血コウモリを放った。",
        "You release vampire bats at %s."),					MELEE_MODE_REMY_OTHER,20, 10, 6, 8, MELEE_VAMP ,6},
	{ _("%sへ弾丸のように突進した！",
        "You charge at %s like a bullet!"),					MELEE_MODE_REMY_OTHER,28, 10, 8, 8, MELEE_STUN2 ,10},
	{ _("突如姿を消し、%sの背後から奇襲した！",
        "You suddenly disappear, then appear behind %s and strike!"),       MELEE_MODE_REMY_OTHER,32, 20, 9, 10, MELEE_DELAY ,8},
	{ _("翼がドリルのように%sを穿った！",
        "You fold your wings like a drill and drive them into %s!"),				MELEE_MODE_REMY_OTHER,38, 25, 10, 10, MELEE_DELAY ,12},
	{ _("無数の蝙蝠が%sをズタズタにした！",
        "Countless bats assault %s!"),			MELEE_MODE_REMY_OTHER,40, 30, 11, 11, MELEE_VAMP ,7},
	{ _("紅いオーラを纏って%sへ錐揉み突撃した！",
        "You shroud yourself in a scarlet aura and charge at %s!"),		MELEE_MODE_REMY_OTHER,43, 35, 12, 12, MELEE_STUN3 ,14},

	{ _("%sに二弾蹴りを食らわせた。",
        "You double-kick %s."),						MELEE_MODE_NITORI,1, 0, 2, 3, 0 ,2},
	{ _("回転するプロペラを%sに当てた！",
        "You hit %s with a spinning propeller!"),					MELEE_MODE_NITORI,7, 0, 4, 4, MELEE_DELAY ,3},
	{ _("巨大なバネで%sを弾き飛ばした！",
        "You knock %s back with a huge spring!"),					MELEE_MODE_NITORI,12, 0, 5, 6, MELEE_DELAY ,6},
	{ _("リュックからグローブが飛び出して%sへアッパーを食らわせた！",
        "A glove flies out of your rucksack and uppercuts %s!"),	MELEE_MODE_NITORI,18, 12, 6, 7, MELEE_STUN2 ,7},
	{ _("リュックからドリルが飛び出して%sを穿った！",
        "A drill flies out of your rucksack and drives into %s!"),			MELEE_MODE_NITORI,26, 20, 7, 8, MELEE_DEC_DEF ,8},
	{ _("リュックから鉄球が飛び出して%sに直撃した！",
        "An iron ball flies out of your rucksack and slams into %s!"),			MELEE_MODE_NITORI,34, 30, 9, 9, MELEE_STUN2 ,10},
	{ _("ドリルとジェットが生えたリュックで%sへ突撃した！",
        "Your rucksack grows a jetpack and a drill, and you charge at %s!"),	MELEE_MODE_NITORI,45, 40, 11, 11, MELEE_DEC_DEF ,12},



	{ _("%sへチョップした。",
        "You chop %s."),							  	MELEE_MODE_HIZIRI,1, 0, 2, 5, 0 ,4},
	{ _("%sへ体当たりした。",
        "You tackle %s."),								MELEE_MODE_HIZIRI,3, 0, 3, 5, MELEE_STUN ,6},
	{ _("%sを手刀で突いた。",
        "You thrust at %s with your hand."),							  	MELEE_MODE_HIZIRI,5, 0, 4, 5, 0 ,5},
	{ _("%sへ切り裂くような手刀を喰らわせた。",
        "You deliver a cleaving blow to %s with your hand."),           MELEE_MODE_HIZIRI,8, 3, 5, 5, 0 ,6},
	{ _("%sへ強烈なフックを喰らわせた。",
        "You hit %s with a powerful hook."),                 MELEE_MODE_HIZIRI,10, 5, 6, 5, MELEE_STUN ,7},
	{ _("%sを独鈷杵の剣で斬った。",
        "You slash %s with Vajra sword."),   					MELEE_MODE_HIZIRI,12, 5, 7, 5, MELEE_SLAY_EVIL ,5},
	{ _("数珠が巨大化し%sを打った。",
        "You enlarge your bead chain and strike %s."),                 	MELEE_MODE_HIZIRI,15, 10, 6, 7, MELEE_SLAY_EVIL ,5},
	{ _("%sを独鈷杵の剣で斬り上げた。",
        "You hit %s with a rising slash of Vajra sword."),                 	MELEE_MODE_HIZIRI,18, 10, 6, 7, MELEE_SLAY_EVIL ,9},
	{ _("%sへ飛び蹴りを喰らわせた。",
        "You hit %s with a flying kick."),                 	MELEE_MODE_HIZIRI,20, 10, 7, 7, MELEE_STUN ,10},
	{ _("独鈷杵の剣を構えて%sへ突進した！",
        "You hold out your Vajra sword and charge at %s!"),				MELEE_MODE_HIZIRI,23, 15, 8, 8, MELEE_STUN ,8},
	{ _("%sを独鈷杵の剣で貫いた！",
        "You pierce %s with your Vajra sword!"),			         	MELEE_MODE_HIZIRI,27, 20, 8, 8, MELEE_SLAY_EVIL ,9},
	{ _("%sを強烈な気合いで弾き飛ばした！",
        "You knock %s back with your sheer spirit release!"),				MELEE_MODE_HIZIRI,30, 20, 8, 8, MELEE_STUN3 ,5},
	{ _("%sを独鈷杵の剣で続けざまに斬った！",
        "You keep slashing %s with your Vajra sword!"),			    MELEE_MODE_HIZIRI,32, 25, 8, 9, MELEE_SLAY_EVIL ,9},
	{ _("%sへ法力の衝撃波を食らわせた！",
        "You hit %s with a magic shockwave!"),				 	MELEE_MODE_HIZIRI,35, 25, 9, 9, MELEE_SLAY_EVIL ,8},
	{ _("%sを独鈷杵の剣でぶった斬った！",
        "You cleave %s with your Vajra sword!"),				 	MELEE_MODE_HIZIRI,38, 25, 10, 10, MELEE_SLAY_EVIL ,12},
	{ _("%sへ引き裂くような飛び蹴りを喰らわせた！",
        "You cleave %s with a flying kick!"),       MELEE_MODE_HIZIRI,40, 30, 11, 11, MELEE_STUN2 ,12},
	{ _("%sへ目にも留まらぬ連撃を浴びせた！",
        "You assault %s at a blinding speed!"),   			MELEE_MODE_HIZIRI,42, 35, 12, 12, MELEE_STUN ,10},
	{ _("%sへ太陽のような威光を放った！",
        "You unleash light bright like the sun at %s!"),   				MELEE_MODE_HIZIRI,45, 40, 12, 13, MELEE_SLAY_EVIL ,12},
	{ _("天から降ってきた巨大な掌が%sを叩き潰した！",
        "A giant fist smashes into %s from above!"),   	MELEE_MODE_HIZIRI,48, 45, 13, 13, MELEE_STUN3 ,15},


	{ _("%sを睨んだ。",
        "You gaze at %s."),					MELEE_MODE_NUE,1, 0, 2, 6, MELEE_CONFUSE ,4},
	{ _("%sを噛んだ！",
        "You bite %s!"),					MELEE_MODE_NUE,6, 0, 4, 6, 0 ,7},
	{ _("蛇の尻尾が%sを締め上げた！",
        "You crush %s with a snake tail!"),     MELEE_MODE_NUE,11,0, 5, 7, MELEE_STUN ,8},
	{ _("%sへ突進した！",
        "You charge at %s!"),					MELEE_MODE_NUE,17, 10, 7, 9, MELEE_STUN ,12},
	{ _("%sへ吠えた。",
        "You howl at %s."),					MELEE_MODE_NUE,21, 10, 7, 9, MELEE_CONFUSE ,6},
	{ _("%sへ放電した！",
        "You discharge lightning at %s!"),					MELEE_MODE_NUE,25, 10, 8, 8, MELEE_ELEC ,12},
	{ _("蛇の尻尾が%sへ牙を突き立てた！",
        "You bite %s with your snake tail!"), MELEE_MODE_NUE,30, 10, 8, 9, MELEE_POIS ,10},
	{ _("%sへ不吉な言葉を囁いた。",
        "You ominously whisper to %s."),		MELEE_MODE_NUE,34, 20, 10, 10, MELEE_CONFUSE ,12},
	{ _("鋭い爪で%sを掻き毟った！",
        "You tear into %s with your sharp claws!"),		MELEE_MODE_NUE,39, 10, 12, 12, MELEE_DEC_DEF ,10},
	{ _("%sに雷が落ちた！",
        "You drop a thunderbolt down on %s!"),				MELEE_MODE_NUE,42, 20, 13, 13, MELEE_ELEC ,12},
	{ _("%sは謎の黒煙に包まれた。",
        "%s is engulfed in mysterious black smoke."),		MELEE_MODE_NUE,46, 35, 13, 14, MELEE_DEC_ALL ,15},

	{ _("%sを制御棒で殴った。",
        "You strike %s with your control rod."),				MELEE_MODE_UTSUHO,1, 0, 2, 4, 0 ,4},
	{ _("%sを岩のような足で蹴った。",
        "You kick %s with your concrete-encased foot."),			MELEE_MODE_UTSUHO,4, 0, 2, 5, 0 ,4},
	{ _("%sへ火炎を放射した！",
        "You shoot fire at %s!"),				MELEE_MODE_UTSUHO,8, 0, 1, 7, MELEE_FIRE ,1},
	{ _("%sを制御棒で薙ぎ払った。",
        "You sweep %s with your control rod."),			MELEE_MODE_UTSUHO,12, 0, 2, 6, MELEE_STUN ,5},
	{ _("%sを岩のような足で踏みつけた。",
        "You stomp %s with your concrete-encased foot."),		MELEE_MODE_UTSUHO,15, 0, 3, 5, 0 ,6},
	{ _("%sを触って燃やした！",
        "Your touch sets %s ablaze!"),				MELEE_MODE_UTSUHO,18, 10, 2, 6, MELEE_FIRE ,2},
	{ _("%sへ突進した！",
        "You charge at %s!"),						MELEE_MODE_UTSUHO,20, 15, 3, 7, MELEE_STUN ,5},
	{ _("%sへ制御棒を振り下ろした。",
        "You slam your control rod down on %s."),			MELEE_MODE_UTSUHO,23, 10, 4, 6, 0 ,8},
	{ _("%sへヘルゲイザーを放った！",
        "You fire your Hell Gazer at %s!"),			MELEE_MODE_UTSUHO,25, 20, 4, 8, MELEE_FIRE ,9},
	{ _("%sを岩のような足で蹴り上げた！",
        "You hit %s with a rising kick from your concrete-encased foot!"),		MELEE_MODE_UTSUHO,29, 15, 6, 7, MELEE_STUN ,8},
	{ _("%sへサマーソルトキックを放った！",
        "You hit %s with a somersault kick!"),	MELEE_MODE_UTSUHO,32, 20, 7, 7, MELEE_STUN ,8},
	{ _("%sの周囲で続けざまに爆発が起こった！",
        "You cause explosions around %s!"),MELEE_MODE_UTSUHO,36, 30, 5, 7, MELEE_FIRE ,8},
	{ _("光弾が%sを打ち据えた！",
        "You strike %s with a glowing bullet!"),				MELEE_MODE_UTSUHO,39, 30,  7,  7, MELEE_STUN ,5},
	{ _("%sへ巨大な火球を投げつけた！",
        "You throw a huge fireball at %s!"),		MELEE_MODE_UTSUHO,41, 30,  7, 8, MELEE_FIRE ,12},
	{ _("%sへ核反応制御不能ダイブを放った！",
        "You hit %s with Uncontainable Nuclear Reaction Dive!"),MELEE_MODE_UTSUHO,43, 35, 11, 11, MELEE_STUN2 ,15},
	{ _("%sの下から巨大な火柱が噴き上がった！",
        "A huge pillar of flame rises up from below %s!"),MELEE_MODE_UTSUHO,46, 37, 10, 18, MELEE_ATAGO ,16},

	{ _("%sへしゃがみ小キックを放った。",
        "You hit %s with a crouching kick."),             MELEE_MODE_MA,1, 0, 1, 3, 0 ,3},
	{ _("%sへラヴ・ミー・ドゥーを喰らわせた！",
        "You hit %s with Love Me Do!"),       MELEE_MODE_MA,2, 20, 1, 1, 0 ,30},
	{ _("%sへジャン拳(グー)を放った！",
        "You hit %s with Rock, Scissors 'N' Paper!"),               MELEE_MODE_MA,3, 0, 2, 5, 0 ,3},
	{ _("%sへ双掌打を喰らわせた！",
        "You hit %s with a twin palm strike!"),            	    MELEE_MODE_MA,4, 2, 2, 6, 0 ,5},
	{ _("%sへ鉄菱を放った！",
        "You hit %s with caltrop punch!"),            	    		MELEE_MODE_MA,5, 3, 2, 9, 0 ,1},
	{ _("%sへブーメランフックを放った！",
        "You hit %s with a boomerang hook!"),      	    MELEE_MODE_MA,6, 3, 2, 7, MELEE_STUN ,6},
	{ _("%sへカンガルーキックを放った！",
        "You hit %s with a kangaroo kick!"),            	MELEE_MODE_MA,7, 5, 3, 5, 0 ,4},
	{ _("%sへスーパー頭突きを放った！",
        "You hit %s with a super headbutt!"),            	MELEE_MODE_MA,8, 4, 3, 6, MELEE_STUN ,8},
	{ _("%sへ寸勁を放った！",
        "You hit %s with an one-inch punch!"),            				MELEE_MODE_MA,9, 2, 3, 6, 0 ,3},
	{ _("%sへ竜巻旋風脚を放った！",
        "You hit %s with a tornado hurricane kick!"),                 	MELEE_MODE_MA,10, 3, 3, 7, 0 ,5},
	{ _("%sへ雷電光を放った！",
        "You throw a ball of lightning at %s!"),                 		MELEE_MODE_MA,11, 7, 4, 7, 0 ,10},
	{ _("%sへ打震を喰らわせた！",
        "You hit %s with a quake strike!"),                 	MELEE_MODE_MA,12, 10, 5, 5, MELEE_STUN2 ,1},
	{ _("%sへ北斗十字斬を喰らわせた！",
        "You hit %s with North Star Cross Slash!"),               MELEE_MODE_MA,13, 7, 5, 6, 0 ,5},
	{ _("%sへ残影拳を喰らわせた！",
        "You hit %s with Afterglow Fist!"),  					MELEE_MODE_MA,14, 12, 6, 6, MELEE_STUN ,7},
	{ _("%sへパロスペシャルを喰らわせた！",
        "You hit %s with Paros Special!"),  			MELEE_MODE_MA,15, 13, 5, 7, 0 ,5},
	{ _("%sへジェノサイドカッターを放った！",
        "You hit %s with Genocide Cutter!"),  		MELEE_MODE_MA,16, 10, 6, 6, 0 ,8},
	{ _("%sへ空圧拳を喰らわせた！",
        "You hit %s with Pneumatic Fist!"),  					MELEE_MODE_MA,17, 7, 5, 5, MELEE_STUN ,5},
	{ _("%sへ狼牙風風拳を喰らわせた！",
        "You hit %s with Wolf Fang Wind Fist!"),  				MELEE_MODE_MA,18, 15, 7, 7, 0 ,10},
	{ _("%sへ白華擺脚を喰らわせた！",
        "You hit %s with White Flower Kick!"),  				MELEE_MODE_MA,19, 12, 7, 8, 0 ,6},
	{ _("%sへDDTを喰らわせた！",
        "You hit %s with DDT!"),						MELEE_MODE_MA,20, 18, 8, 8, MELEE_STUN2 ,10},
	{ _("%sへヒートナックルを放った！",
        "You hit %s with Heat Knuckle!"),               MELEE_MODE_MA,21, 15, 6, 6, MELEE_FIRE ,5},
	{ _("%sへマッハパンチを放った！",
        "You hit %s with a mach punch!"),                 MELEE_MODE_MA,22, 12, 7, 7, MELEE_STUN ,4},
	{ _("%sへ虎咬拳を放った！",
        "You hit %s with Tiger Fist!"),  						MELEE_MODE_MA,23, 18, 8, 8, 0 ,10},
	{ _("%sへダイヤモンドダストを放った！",
        "You hit %s with Diamond Dust!"),           MELEE_MODE_MA,24, 15, 6, 7, MELEE_COLD ,5},
	{ _("%sへ北斗百裂拳を放った！",
        "You hit %s with North Star Hundred Fists!"),  					MELEE_MODE_MA,25, 18, 9, 9, MELEE_STUN ,8},
	{ _("%sへ地獄の断頭台を喰らわせた！",
        "You hit %s with Hell Guillotine!"),  			MELEE_MODE_MA,26, 21, 8, 7, 0 ,12},
	{ _("%sへパワーゲイザーを放った！",
        "You hit %s with Power Gazer!"),               MELEE_MODE_MA,27, 16, 6, 7, MELEE_FIRE ,4},
	{ _("%sへ天の乱光脚龍を放った！",
        "You hit %s with Heavenly Light Dragon Kick!"),  				MELEE_MODE_MA,28, 20, 7, 8, MELEE_STUN ,9},
	{ _("%sへフルムーンスパイラルを喰らわせた！",
        "You hit %s with Full Moon Spiral!"),  	MELEE_MODE_MA,29, 25, 10, 10, MELEE_DEC_MAG ,14},
	{ _("%sへハンティングスワンを放った！",
        "You hit %s with Hunting Swan!"),           MELEE_MODE_MA,30, 28, 8, 9, MELEE_DEC_DEF ,18},
	{ _("%sへ七星点心を放った！",
        "You hit %s with Seven Star Heart Strike!"),                 	MELEE_MODE_MA,31, 25, 8, 9, 0 ,18},
	{ _("%sへ悪魔風脚・画竜点睛を喰らわせた！",
        "You hit %s with Demon Wind Kick, Painted Dragon Strike!"),       MELEE_MODE_MA,32, 27, 7, 8, MELEE_FIRE ,10},
	{ _("%sへ空手裏剣を喰らわせた！",
        "You hit %s with Aerial Shuriken!"),               	MELEE_MODE_MA,33, 30, 10, 10, MELEE_DEC_DEF,5},
	{ _("%sへギャラクティカマグナムを喰らわせた！",
        "You hit %s with Galactica Magnum!"),   MELEE_MODE_MA,34, 25, 8, 8, MELEE_STUN ,7},
	{ _("%sへアンパンチを放った！",
        "You hit %s with Un-Punch!"),      				MELEE_MODE_MA,35, 30, 4, 12, MELEE_STUN3 ,12},
	{ _("%sへジェットソニックマッハパンチを放った！",
        "You hit %s with Jet Sonic Mach Punch!"),	MELEE_MODE_MA,36, 27, 6, 11, MELEE_DEC_MAG ,9},
	{ _("%sへダークネスイリュージョンを喰らわせた！",
        "You hit %s with Darkness Illusion!"),	MELEE_MODE_MA,37, 32, 10, 10, MELEE_STUN ,10},
	{ _("%sへカラミティエンドを喰らわせた！",
        "You hit %s with Calamity End!"),			MELEE_MODE_MA,38, 30, 9, 9, MELEE_DEC_DEF ,15},
	{ _("%sへタイガーブレイクを喰らわせた！",
        "You hit %s with Tiger Break!"),			MELEE_MODE_MA,39, 36, 9, 9, MELEE_STUN2 ,10},
	{ _("%sへドゴーンパンチを放った！",
        "You hit %s with Dogone Punch!"),               MELEE_MODE_MA,40, 35, 10, 10, MELEE_STUN3 ,12},
	{ _("%sへ南斗水鳥拳奥義飛燕流舞を放った！",
        "You hit %s with North Star Crane Meteor Dance!"),       MELEE_MODE_MA,41, 40, 11, 12, MELEE_DEC_DEF ,10},
	{ _("%sへペガサス流星拳を放った！",
        "You hit %s with Pegasus Meteor Fist!"),       		MELEE_MODE_MA,42, 38, 11, 11, MELEE_STUN2 ,11},
	{ _("%sへファイナルヘヴンを喰らわせた！",
        "You hit %s with Final Heaven!"),       	MELEE_MODE_MA,43, 37, 10, 12, MELEE_STUN2 ,16},
	{ _("「無駄無駄無駄無駄無駄無駄無駄無駄ァ！！」",
        "'Mudamudamudamudamudamudamudamuda!!'"),	MELEE_MODE_MA,44, 35, 11, 12, MELEE_STUN ,8},
	{ _("%sへ邪王炎殺煉獄焦を喰らわせた！",
        "You hit %s with Evil King Flame Purgatory!"),       	MELEE_MODE_MA,45, 40, 10, 10, MELEE_ATAGO ,12},
	{ _("%sへオーロラエクスキューションを放った！",
        "You hit %s with Aurora Execution!"),   MELEE_MODE_MA,46, 40, 10, 10, MELEE_COLD ,12},
	{ _("%sへ夢幻闘舞を放った！",
        "You hit %s with Dream Battle Dance!"),       				MELEE_MODE_MA,47, 40, 12, 12, MELEE_DELAY ,16},
	{ _("%sへビッグバンインパクトを喰らわせた！",
        "You hit %s with Big Bang Impact!"),		MELEE_MODE_MA,48, 43, 12, 14, MELEE_STUN2 ,15},
	{ _("%sへジェット・トゥ・ジェット・アパカーを喰らわせた！",
        "You hit %s with Jet-to-Jet Uppercut!"),MELEE_MODE_MA,49, 45, 13, 13, MELEE_STUN3 ,12},
	{ _("%sへ超級覇王電影弾を放った！",
        "You hit %s with Super Dynast Lightning Bullet!"),				MELEE_MODE_MA,50, 48, 13, 15, MELEE_DELAY ,20},

	{ _("%sをはたいた。",
        "You hit %s."),								MELEE_MODE_SUWAKO,1, 0, 1, 7, 0 ,3},
	{ _("%sを蹴りまくった！",
        "You kick %s!"),							MELEE_MODE_SUWAKO,4, 0, 2, 5, 0 ,5},
	{ _("%sへ飛びかかった。",
        "You leap at %s."),							MELEE_MODE_SUWAKO,7, 0, 2, 6, 0 ,6},
	{ _("%sを鉄輪で打ち据えた。",
        "You strike %s with an iron ring."),						MELEE_MODE_SUWAKO,10, 0, 2, 8, 0 ,3},
	{ _("%sへカエル跳びアッパーを喰らわせた！",
        "You hit %s with a leapfrog uppercut!"),		MELEE_MODE_SUWAKO,14, 5, 3, 8, MELEE_STUN2 ,7},
	{ _("岩の蛙に乗って%sへ体当りした！",
        "You climb a stone frog statue and tackle %s!"),				MELEE_MODE_SUWAKO,18, 10, 4, 7, 0 ,9},
	{ _("%sの足元から間欠泉が噴き出した！",
        "A geyser spouts out from below %s!"),			MELEE_MODE_SUWAKO,22, 15, 5, 7, MELEE_WATER ,7},
	{ _("大岩が地中から飛び出し%sへ直撃した！",
        "A boulder flies out of the earth at %s!"),       MELEE_MODE_SUWAKO,26, 15, 7, 7, MELEE_STUN ,8},
	{ _("回転する鉄輪が%sを切り裂いた！",
        "You slice %s with a spinning iron ring!"),				MELEE_MODE_SUWAKO,29, 20, 8, 7, MELEE_DEC_MAG ,8},
	{ _("蛙のようなオーラが%sを弾き飛ばした！",
        "You launch a frog-shaped aura at %s!"),		MELEE_MODE_SUWAKO,33, 20, 8, 8, MELEE_DEC_MAG ,8},
	{ _("巨大な岩の手が現れ%sを挟み打った！",
        "A huge rock hand appears and strikes %s!"),			MELEE_MODE_SUWAKO,37, 30,  9,  9, MELEE_STUN ,12},
	{ _("巨大な翡翠の球が%sへ降り注いだ！",
        "A huge jade globe crashes down on %s!"),			MELEE_MODE_SUWAKO,41, 30, 10, 10, MELEE_DEC_MAG ,8 },
	{ _("大蛇のような巨岩が現れ%sを呑み込んだ！",
        "A massive frog-shaped rock appears and swallows %s!"),		MELEE_MODE_SUWAKO,45, 40, 12, 12, MELEE_STUN3 ,18},

	{ _("%sを尻尾でモフモフした。",
        "You envelop %s with your fluffy tails."),					MELEE_MODE_RAN,1, 0, 1, 10, MELEE_STUN3 ,1},
	{ _("%sを尻尾で締め上げた！",
        "You constrict %s with your tails!"),						MELEE_MODE_RAN,25, 0, 5, 7, MELEE_STUN ,3},
	{ _("跳ねるように%sへ体当りした！",
        "You bounce and tackle %s!"),				MELEE_MODE_RAN,35, 15, 8, 9, MELEE_STUN ,8},
	{ _("激しく回転しながら%sへ突撃した！",
        "You charge at %s while quickly spinning!"),			MELEE_MODE_RAN,40, 30, 12, 12, MELEE_STUN2 ,10},

	{ _("%sを突き飛ばした。",
        "You thrust at %s."),							  	MELEE_MODE_TENSHI,1, 0, 2, 5, 0 ,4},
	{ _("%sを蹴った。",
        "You kick %s."),							  	MELEE_MODE_TENSHI,5, 0, 4, 5, 0 ,5},
	{ _("%sへ頭突きを喰らわせた。",
        "You headbutt %s."),						MELEE_MODE_TENSHI,10, 3, 5, 5, MELEE_STUN ,6},
	{ _("%sへ肘打ちを喰らわせた。",
        "You hit %s with your elbow."),   					MELEE_MODE_TENSHI,14, 5, 7, 5, 0 ,5},
	{ _("%sへ飛び蹴りを喰らわせた。",
        "You hit %s with a flying kick."),                 	MELEE_MODE_TENSHI,18, 10, 6, 7,0 ,5},
	{ _("%sを要石で殴った。",
        "You strike %s with a keystone."),                 			MELEE_MODE_TENSHI,22, 10, 6, 7, MELEE_STUN ,9},
	{ _("要石を振りかぶって%sへ叩きつけた！",
        "You slam a keystone into %s!"),				MELEE_MODE_TENSHI,25, 15, 8, 8, MELEE_STUN2 ,9},
	{ _("%sへサマーソルトキックを喰らわせた！",
        "You hit %s with a somersault kick!"),			MELEE_MODE_TENSHI,30, 20, 8, 8, MELEE_DELAY ,9},
	{ _("%sの足元から要石が発射された！",
        "A keystone flies out from below %s!"),					MELEE_MODE_TENSHI,36, 25, 8, 8, MELEE_STUN ,5},
	{ _("要石に乗って%sへ落下した！",
        "You drop down on %s, riding a keystone!"),						MELEE_MODE_TENSHI,40, 25, 9, 9, MELEE_STUN2 ,8},
	{ _("岩が集まってきて%sを押しつぶした！",
        "You gather rocks together and slam them into %s!"),				 	MELEE_MODE_TENSHI,44, 35, 10, 10, MELEE_DELAY ,12},
	{ _("天から降ってきた巨大な要石が%sを叩き潰した！",
        "A huge keystone slams down onto %s from above!"),   	MELEE_MODE_TENSHI,48, 45, 12, 12, MELEE_STUN2 ,15},

	{ _("%sへ掌底を食らわせた。",
        "You hit %s with a palm strike."),   				MELEE_MODE_MEIRIN,1, 0, 2, 5, 0 ,6},
	{ _("%sへ中段突きを食らわせた。",
        "You hit %s with a middle thrust."),   			MELEE_MODE_MEIRIN,4, 0, 3, 5, 0 ,8},
	{ _("%sを手刀で突いた。",
        "You thrust at %s with your hand."),                 	MELEE_MODE_MEIRIN,9, 5, 4, 5, 0 ,3},
	{ _("%sへ側拳腿を食らわせた。",
        "You hit %s from the side."),   			MELEE_MODE_MEIRIN,12, 8, 5, 5, 0 ,5},
	{ _("%sへ背折靠を食らわせた。",
        "You hit %s with a back fold."),   			MELEE_MODE_MEIRIN,16, 10, 6, 5, MELEE_STUN ,6},
	{ _("%sへ降華蹴を食らわせた。",
        "You hit %s with Kick of Showering Brilliance."),				MELEE_MODE_MEIRIN,19, 12, 7, 5, 0 ,6},
	{ _("%sへ破山砲を喰らわせた。",
        "You hit %s with Mountain-Breaking Cannon."),               MELEE_MODE_MEIRIN,22, 18, 7, 6, MELEE_DEC_DEF ,10},
	{ _("%sへ気砲を放った。",
        "You hit %s with a Ki blast."),						MELEE_MODE_MEIRIN,25, 20, 7, 7, MELEE_STUN ,8},
	{ _("%sへ黄震脚を食らわせた。",
        "You hit %s with Yellow Quake Kick."),				MELEE_MODE_MEIRIN,28, 20, 8, 7, 0 ,8},
	{ _("%sへ紅寸剄を食らわせた。",
        "You hit %s with Crimson Energy Release."),   			MELEE_MODE_MEIRIN,31, 25, 8, 8, MELEE_STUN ,10},
	{ _("%sへ地龍波を放った。",
        "You hit %s with Earth Dragon Wave."),   				MELEE_MODE_MEIRIN,34, 25, 8, 9, 0 ,12},
	{ _("%sへ天龍脚を食らわせた。",
        "You hit %s with Sky Dragon Kick."),   			MELEE_MODE_MEIRIN,37, 25, 9, 9, 0 ,6},
	{ _("%sへ大鵬拳を食らわせた！",
        "You hit %s with Dapeng Fist!"),   			MELEE_MODE_MEIRIN,40, 30, 9, 10, MELEE_STUN ,10},
	{ _("%sへ烈虹真拳を食らわせた！",
        "You hit %s with Intense Rainbow Fist!"),   			MELEE_MODE_MEIRIN,42, 35, 10, 10, MELEE_DEC_DEF ,10},
	{ _("%sへ星脈地転弾を食らわせた！",
        "You hit %s with Earth-Moving Star Pulse Shot!"),   		MELEE_MODE_MEIRIN,44, 40, 11, 11, MELEE_STUN2 ,12},
	{ _("%sへ崩山彩極砲を食らわせた！",
        "You hit %s with Colorful Ultimate Mountain-Breaking Cannon!"),   		MELEE_MODE_MEIRIN,47, 45, 12, 12, MELEE_STUN3 ,15},

	{ _("%sをポコポコ叩いた。",
        "You hit %s."),                 				MELEE_MODE_SUMIREKO,1, 0, 1, 3, 0 ,3},
	{ _("%sへヒップアタックした。",
        "You hit %s with a hip attack."),           				MELEE_MODE_SUMIREKO,6, 0, 2, 3, 0 ,3},
	{ _("%sへカードを飛ばした。",
        "You throw a card at %s."),								MELEE_MODE_SUMIREKO,10, 3, 3, 4, 0 ,7},
	{ _("%sへバス停標識を投げつけた。",
        "You throw a bus stop sign at %s."),                 		MELEE_MODE_SUMIREKO,15, 10, 3, 6, MELEE_DELAY ,4},
	{ _("%sへ道路標識を振り下ろした。",
        "You slam a road sign on top of %s."),                 		MELEE_MODE_SUMIREKO,20, 10, 4, 4, 0 ,6},
	{ _("%sの足元からマンホールの蓋と水が噴き出した！",
        "A manhole cover and a spout of water springs out from beneath %s!"),       MELEE_MODE_SUMIREKO,26, 20, 6, 5, MELEE_WATER ,5},
	{ _("瓦礫が跳ねて%sを挟んだ！",
        "You sandwich %s between pieces of rubble!"),                 			MELEE_MODE_SUMIREKO,31, 20, 7, 7, MELEE_DELAY ,7},
	{ _("%sへ向かって電柱が倒れた。",
        "An utility pole falls on top of %s."),							MELEE_MODE_SUMIREKO,36, 30, 8, 9, MELEE_STUN ,8},
	{ _("%sへ鉄骨を投げつけた！",
        "You throw a steel girder at %s!"),								MELEE_MODE_SUMIREKO,40, 30, 10, 10, MELEE_DELAY ,12},
	{ _("巨大な電波塔が地響きを立てて%sの上へ倒れた！",
        "A huge radio tower collapses on top of %s with a rumbling sound!"),		MELEE_MODE_SUMIREKO,45, 40, 8, 14, MELEE_STUN2 ,14},

	{ _("雲山が%sをにらんだ。",
        "Unzan gazes at %s."),                 		MELEE_MODE_ICHIRIN,1, 0, 1, 5, 0 ,1},
	{ _("雲山が%sを引っぱたいた。",
        "Unzan grabs and pulls %s."),           		MELEE_MODE_ICHIRIN,7, 0, 2, 6, 0 ,4},
	{ _("雲山が%sを殴りつけた！",
        "Unzan strikes %s!"),                 	MELEE_MODE_ICHIRIN,12, 6, 3, 5, 0 ,8},
	{ _("雲山が%sへワンツーパンチを放った！",
        "Unzan hits %s with a one-two punch!"),             MELEE_MODE_ICHIRIN,16, 10, 3, 6, MELEE_STUN ,6},
	{ _("雲山が%sへ激しく放電した！",
        "Unzan fiercely discharges lightning at %s!"),                 	MELEE_MODE_ICHIRIN,21, 15, 4, 5, MELEE_ELEC ,3},
	{ _("雲山が%sを掴み投げ飛ばした！",
        "Unzan grabs and throws %s!"),              	MELEE_MODE_ICHIRIN,27, 20, 6, 6, MELEE_DELAY ,8},
	{ _("雲山の巨大な拳が%sに落ちた！",
        "Unzan's huge fist drops down on %s!"),                 	MELEE_MODE_ICHIRIN,31, 20, 7, 7, MELEE_STUN ,10},
	{ _("雲山が雷光と共に両手を打ち合わせた！",
        "Unzan slams his fists together, releasing a flash of thunder!"),        MELEE_MODE_ICHIRIN,36, 30, 8, 8, MELEE_ELEC ,6},
	{ _("雲山が%sへ怒りの乱打を放った！",
        "Unzan wrathfully beats down %s!"),          	MELEE_MODE_ICHIRIN,40, 30, 10, 10, 0 ,10},
	{ _("雲山が%sへ渾身の巨大ストレートを放った！",
        "Unzan hits %s with a full-body straight!"),    MELEE_MODE_ICHIRIN,44, 40, 12, 12, MELEE_STUN2 ,15},

	{ _("雲山が%sをタコ殴りにした！",
        "Unzan beats down %s over and over!"),        MELEE_MODE_ICHIRIN2,1, 0, 8, 8, MELEE_STUN ,5},

	{ _("%sへローキックを食らわせた。",
        "You hit %s with a low kick."),   	MELEE_MODE_MOKOU,1, 0, 1, 5, 0 ,3},
	{ _("%sへヤクザキックを食らわせた。",
        "You hit %s with a yakuza kick."),   	MELEE_MODE_MOKOU,6, 0, 2, 4, 0 ,4},
	{ _("%sへ小さな火球を飛ばした。",
        "You throw a small ball of fire at %s."),   		MELEE_MODE_MOKOU,10, 0, 1, 8, MELEE_FIRE ,3},
	{ _("%sへボディブローを食らわせた。",
        "You bodyblow %s."),   	MELEE_MODE_MOKOU,15, 6, 3, 4, 0 ,6},
	{ _("%sを燃える足で蹴り上げた！",
        "You hit %s with a rising blazing kick!"),   		MELEE_MODE_MOKOU,19, 10, 4, 5, MELEE_STUN ,5},
	{ _("%sに手をかざし爆発を起こした！",
        "You put your hands on %s and cause an explosion!"),   	MELEE_MODE_MOKOU,23, 16, 3, 6, MELEE_FIRE ,8},
	{ _("赤熱する羽根が舞って%sを焦がした！",
        "Red-hot feathers scatter around and scorch %s!"), MELEE_MODE_MOKOU,28, 20, 4, 5, MELEE_FIRE ,1},
	{ _("燃え盛る拳で%sを殴りつけた！",
        "You slam %s with a burning fist!"),   	MELEE_MODE_MOKOU,32, 26, 6, 7, MELEE_STUN ,8},
	{ _("%sを火爪で斬り裂いた！",
        "You cleave %s with a flame claw!"),   			MELEE_MODE_MOKOU,36, 25, 4, 10, MELEE_FIRE ,5},
	{ _("巨大な火球を%sへ叩きつけた！",
        "You hit %s with a huge fireball!"),   	MELEE_MODE_MOKOU,40, 32, 8, 8, MELEE_FIRE ,10},
	{ _("%sを火爪で滅多斬りにした！",
        "You slice %s up with a flame claw!"),   		MELEE_MODE_MOKOU,43, 35, 6, 12, MELEE_FIRE ,8},
	{ _("%sへ凱風快晴飛翔脚を食らわせた！",
        "You hit %s with South Wind, Clear Sky Soaring Kick!"),   MELEE_MODE_MOKOU,47, 45, 10, 12, MELEE_FIRE ,12},

	{ _("%sを平手打ちした。",
        "You slap %s."),		      				MELEE_MODE_KANAKO,1, 0, 1, 7, 0 ,2},
	{ _("%sを細めの御柱で打ち据えた。",
        "You strike %s with an onbashira."),     			MELEE_MODE_KANAKO,7, 0, 2, 6, 0 ,4},
	{ _("%sはつむじ風に巻き込まれた。",
        "%s is engulfed in a whirlwind."),   			MELEE_MODE_KANAKO,14, 7, 3, 5, 0 ,6},
	{ _("御柱が伸びて%sを突いた。",
        "You extend your onbashira, striking %s."),       			MELEE_MODE_KANAKO,19, 5, 4, 5, 0 ,7},
	{ _("%sの頭上から御柱が落ちてきた！",
        "You slam your onbashira on top of %s!"),       		MELEE_MODE_KANAKO,24, 10, 4, 9, MELEE_STUN ,8},
	{ _("%sに怒りの雷霆を見舞った！",
        "%s is struck by a wrathful thunderstorm!"),		      		MELEE_MODE_KANAKO,28, 25, 3, 12, MELEE_ELEC ,10},
	{ _("%sへ御柱のフルスイングを食らわせた！",
        "You swing your onbashira at %s!"),       MELEE_MODE_KANAKO,32, 25, 5, 12, MELEE_STUN ,8},
	{ _("迸る神気が%sへ叩き付けられた！",
        "You strike %s down with your divine spirit!"),   			MELEE_MODE_KANAKO,36, 30, 8, 8, MELEE_SLAY_EVIL ,5},
	{ _("大地から巨大な御柱が飛び出して%sを吹き飛ばした！",
        "A huge onbashira rises up from the ground and knocks %s away!"),  	MELEE_MODE_KANAKO,40, 37, 10, 13, MELEE_STUN ,12},
	{ _("天から巨大な御柱が降ってきて%sを叩き潰した！",
        "A huge onbashira slams down on %s from above!"),   	MELEE_MODE_KANAKO,47, 45, 10, 15, MELEE_STUN2 ,16},

	{ _("%sを袖ではたいた。",
        "You slap %s with your sleeve."),					MELEE_MODE_FUTO,1, 0, 1, 3, 0 ,2},
	{ _("%sへ回転攻撃を食らわせた。",
        "You hit %s with a spinning attack."),			MELEE_MODE_FUTO,10, 5, 2, 4, 0 ,7},
	{ _("%sへ小さな竜巻を起こした。",
        "You launch a small tornado at %s."),			MELEE_MODE_FUTO,15, 10, 3, 5, MELEE_DELAY ,6},
	{ _("%sへ火球を投げつけた。",
        "You throw a fireball at %s."),				MELEE_MODE_FUTO,20, 10, 3, 4, MELEE_FIRE ,4},
	{ _("%sへ大皿を叩きつけた。",
        "You slam %s with a large plate."),				MELEE_MODE_FUTO,25, 20, 4, 7, MELEE_STUN ,5},
	{ _("%sは突然燃え上がった！",
        "%s is suddenly set ablaze!"),				MELEE_MODE_FUTO,30, 20, 4, 6, MELEE_FIRE ,8},
	{ _("%sの足元から岩が飛び出した！",
        "Rocks fly out from beneath %s!"),			MELEE_MODE_FUTO,34, 25, 5, 6, MELEE_STUN ,6},
	{ _("%sは大竜巻に巻き込まれた！",
        "%s is engulfed in a large tornado!"),				MELEE_MODE_FUTO,38, 30, 10, 10, MELEE_DELAY ,10},
	{ _("%sの足元から巨大な火柱が噴き上がった！",
        "A huge pillar of flames spouts out from beneath %s!"),		MELEE_MODE_FUTO,42, 40, 10, 12, MELEE_FIRE ,12},
	{ _("天の磐舟に乗って%sへ突撃した！",
        "You ride Ame-no-Iwafune and charge at %s!"),		MELEE_MODE_FUTO,45, 40, 12, 12, MELEE_STUN2 ,12},

	{ _("%sを箒ではたいた。",
        "You strike %s with your broom."),						MELEE_MODE_MARISA,1, 0, 1, 7, 0 ,1},
	{ _("%sを箒で突いた。",
        "You thrust at %s with your broom."),						MELEE_MODE_MARISA,4, 0, 2, 5, 0 ,3},
	{ _("%sにヒップアタックを食らわせた。",
        "You hit %s with a hip attack."),		MELEE_MODE_MARISA,8, 0, 2, 6, MELEE_STUN ,7},
	{ _("%sに星屑を飛ばした。",
        "You shoot stardust at %s."),					MELEE_MODE_MARISA,12, 10, 2, 8, MELEE_DEC_MAG ,3},
	{ _("%sに箒のフルスイングを喰らわせた！",
        "You swing your broom at %s!"),		MELEE_MODE_MARISA,16, 5, 3, 8, 0 ,6},
	{ _("箒に乗って%sに突進した！",
        "You charge at %s riding your broom!"),				MELEE_MODE_MARISA,20, 15, 4, 7, MELEE_STUN ,12},
	{ _("謎の薬液が入った瓶を%sに投げつけた。",
        "You throw a bottle with mysterious liquid at %s."),	MELEE_MODE_MARISA,23, 10, 5, 6, MELEE_POIS ,7},
	{ _("突然地面から茸が生えて%sを吹っ飛ばした！",
        "Suddenly, a mushroom sprouts out of the ground, knocking %s back!"),MELEE_MODE_MARISA,26, 15, 6, 6, MELEE_STUN ,8 },
	{ _("%sにミアズマスウィープを喰らわせた！",
        "You hit %s with Miasma Sweep!"),	MELEE_MODE_MARISA,29, 20, 5, 7, MELEE_DEC_MAG ,7},
	{ _("%sの頭上から星屑が降り注いだ！",
        "Stardust falls down on top of %s!"),			MELEE_MODE_MARISA,32, 25, 6, 7, MELEE_DEC_MAG ,8},
	{ _("%sにラジアルストライクを喰らわせた！",
        "You hit %s with Radial Strike!"),	MELEE_MODE_MARISA,36, 30, 7, 7, MELEE_STUN ,8},
	{ _("%sにミリ秒パルサーを喰らわせた！",
        "You hit %s with Millisecond Pulsar!"),		MELEE_MODE_MARISA,40, 32,  8,  8, MELEE_DEC_MAG ,8},
	{ _("%sに投げつけた瓶が大爆発した！",
        "You throw an explosive bottle at %s!"),			MELEE_MODE_MARISA,43, 35, 10, 10, MELEE_STUN2 ,10},
	{ _("%sにサングレイザーを喰らわせた！",
        "You hit %s with Sungrazer!"),		MELEE_MODE_MARISA,47, 45, 12, 12, MELEE_ATAGO ,16},

	{ _("音符の弾が%sへ放たれた。",
        "You fire a musical note at %s."),					MELEE_MODE_BENBEN,1, 0, 7, 7, MELEE_STUN ,3},
	{ _("五線譜の光が渦を巻いて%sを襲った！",
        "You attack %s with musical score lasers!"),			MELEE_MODE_BENBEN,33, 20, 8, 8, MELEE_DEC_ATK ,5},
	{ _("衝撃波が%sを吹き飛ばした！",
        "You knock %s back with a shockwave!"),					MELEE_MODE_BENBEN,36, 30, 9, 9, MELEE_STUN ,7},
	{ _("五線譜の光が%sを切り裂いた！",
        "You slice %s with musical score lasers!"),				MELEE_MODE_BENBEN,39, 30, 10, 10, MELEE_DEC_ATK ,7},
	{ _("破滅の旋律が%sへ叩きつけられた！",
        "You strike %s with a destructive melody!"),			MELEE_MODE_BENBEN,44, 35, 11, 11, MELEE_STUN2 ,9},
	{ _("無数の光線が次々に%sを貫いた！",
        "Countless lasers pierce %s!"),				MELEE_MODE_BENBEN,48, 40, 12, 12, MELEE_DEC_ATK ,12},

	{ _("%sを見た。",
        "You look at %s."),				MELEE_MODE_HINA,1, 0, 1, 2, 0 ,5},
	{ _("%sに微笑みかけた。",
        "You smile at %s."),		MELEE_MODE_HINA,8, 0, 2, 2, 0 ,5},
	{ _("%sに近寄った。",
        "You approach %s."),			MELEE_MODE_HINA,15, 5, 3, 4, MELEE_DEC_ALL ,6},
	{ _("%sに語りかけた。",
        "You speak to %s."),		MELEE_MODE_HINA,22, 10, 4, 5, MELEE_DEC_ALL ,6},
	{ _("%sに手を差し出した。",
        "You extend your hand towards %s."),	MELEE_MODE_HINA,28, 20, 5, 5, MELEE_DEC_ALL ,7},
	{ _("%sに触れた。",
        "You touch %s."),			MELEE_MODE_HINA,34, 25, 5, 6, MELEE_STUN ,8},
	{ _("%sに囁きかけた。",
        "You whisper to %s."),		MELEE_MODE_HINA,40, 35, 5, 7, MELEE_DEC_ALL ,10},
	{ _("%sを優しく抱擁した。",
        "You gently hug %s."),	MELEE_MODE_HINA,44, 40, 5, 10, MELEE_STUN2 ,15},

	{ _("サニーが%sを蹴った。",
        "Sunny kicks %s."),					MELEE_MODE_3_FAIRIES,1, 0, 1, 4, 0 ,3},
	{ _("ルナが転んだ。",
        "Luna tumbles."),							MELEE_MODE_3_FAIRIES,6, 5, 1, 1, MELEE_STUN ,3},
	{ _("サニーが%sの前で光った！",
        "Sunny emits a flash of light in front of %s!"),				MELEE_MODE_3_FAIRIES,7, 0, 2, 7, MELEE_SLAY_EVIL ,5},
	{ _("三人で%sに飛びかかった！",
        "The three of you jump at %s!"),				MELEE_MODE_3_FAIRIES,15, 5, 4, 7, 0 ,6},
	{ _("三人で%sをげしげし蹴った！",
        "The three of you keep kicking %s!"),				MELEE_MODE_3_FAIRIES,24, 10, 6, 7, 0 ,8},
	{ _("三人で%sへ強烈な閃光を放った！",
        "The three of you release an intense flash of light!"),			MELEE_MODE_3_FAIRIES,32, 20, 6, 6, MELEE_SLAY_EVIL ,8},
	{ _("%sにグレートトライアングルを食らわせた！",
        "You hit %s with Great Triangle!"),	MELEE_MODE_3_FAIRIES,38, 30, 8, 7, 0 ,10},
	{ _("%sにフェアリーオーバードライブを食らわせた！",
        "You hit %s with Fairy Overdrive!"),	MELEE_MODE_3_FAIRIES,45, 40, 10, 10, MELEE_STUN2 ,12},

	{ _("%sをバチで打った。",
        "You hit %s with a drumstick."),						MELEE_MODE_RAIKO,1, 0, 1, 3, 0 ,2},
	{ _("%sを蹴った。",
        "You kick %s."),							MELEE_MODE_RAIKO,8, 5, 2, 4, 0 ,7},
	{ _("%sを踏みつけた。",
        "You stomp on %s."),						MELEE_MODE_RAIKO,14, 10, 3, 5, 0 ,6},
	{ _("%sに体当りした。",
        "You tackle %s."),						MELEE_MODE_RAIKO,20, 10, 3, 4, 0 ,4},
	{ _("太鼓が%sへ轟音を放った！",
        "Your taiko drum launches sound at %s!"),				MELEE_MODE_RAIKO,24, 20, 4, 7, MELEE_STUN ,5},
	{ _("ドラムが%sに放電した！",
        "Your drum strikes %s with lightning!"),					MELEE_MODE_RAIKO,28, 20, 4, 6, MELEE_ELEC ,5},
	{ _("%sを蹴って蹴って蹴りまくった！",
        "You keep kicking and kicking %s!"),			MELEE_MODE_RAIKO,32, 25, 7, 6, 0 ,6},
	{ _("両手のバチで%sを乱打した！",
        "You beat down on %s with drumsticks held in both hands!"),				MELEE_MODE_RAIKO,35, 30, 8, 8, MELEE_STUN ,8},
	{ _("%sの頭上に雷が落ちた！",
        "A thunderbolt strikes down on %s!"),					MELEE_MODE_RAIKO,39, 32, 8, 10, MELEE_ELEC ,10},
	{ _("%sをハイビートに打ち鳴らした！",
        "You slam %s with a high beat!"),			MELEE_MODE_RAIKO,43, 35, 10, 11, MELEE_STUN ,10},
	{ _("衝撃波が%sを吹き飛ばした！",
        "You knock %s away with a shockwave!"),				MELEE_MODE_RAIKO,48, 43, 12, 12, MELEE_STUN2 ,13},

	{ _("%sを蹴った。",
        "You kick %s."),								MELEE_MODE_MAMIZOU,1, 0, 1, 6, 0 ,3},
	{ _("%sを大徳利で殴った。",
        "You strike %s with your sake bottle."),						MELEE_MODE_MAMIZOU,6, 0, 2, 4, 0 ,4},
	{ _("%sに煙草の煙を吹き付けた。",
        "You blow smoke at %s."),					MELEE_MODE_MAMIZOU,11, 6, 1, 1, MELEE_SLOW ,1},
	{ _("%sを大徳利でぶっ叩いた！",
        "You slam %s with your sake bottle!"),					MELEE_MODE_MAMIZOU,16, 3, 3, 5, MELEE_STUN ,5},
	{ _("化け提灯に変じた配下を%sに叩きつけた！",
        "One of your subordinates transforms into a ghost lantern and slams into %s!"),		MELEE_MODE_MAMIZOU,21, 0, 2, 8, MELEE_FIRE ,3},
	{ _("アミキリに変じた配下が%sへ斬り付けた！",
        "One of your subordinates transforms into an amikiri and slices %s!"),		MELEE_MODE_MAMIZOU,26, 10, 5, 6,  MELEE_DELAY,3},
	{ _("釣瓶落としに変じた配下が%sの上に落下した！",
        "One of your subordinates transforms into a tsurube-otoshi and drops on top of %s!"),	MELEE_MODE_MAMIZOU,30, 11, 3, 12, MELEE_STUN ,3},
	{ _("濃い煙が%sを押し包んだ・・",
        "%s is enveloped in dense smoke..."),					MELEE_MODE_MAMIZOU,33, 20, 6, 6, MELEE_CONFUSE ,8},
	{ _("ぬりかべに変じた配下が%sを押し潰した！",
        "One of your subordinates transforms into a nurikabe and crushes %s!"),		MELEE_MODE_MAMIZOU,37, 27, 9, 9, MELEE_DELAY ,12},
	{ _("地蔵に化けて%sの頭上に落ちた！",
        "You transform into a jizo and drop down on top of %s!"),				MELEE_MODE_MAMIZOU,41, 32, 10, 10, MELEE_STUN2 ,10},
	{ _("配下たちと一緒に%sを揉みくちゃにした！",
        "You assault %s along with your subordinates!"),		MELEE_MODE_MAMIZOU,45, 40, 12, 12, MELEE_DELAY ,12},

	{ _("%sに微笑みかけた。",
        "You smile at %s."),							  	MELEE_MODE_YUKARI,1, 0, 2, 5, MELEE_CONFUSE ,4},
	{ _("扇を取り出し、%sをぺしんと打った。",
        "You take out your fan and slap %s."),				MELEE_MODE_YUKARI,5, 0, 4, 5, 0 ,5},
	{ _("%sを蹴った。",
        "You kick %s."),									MELEE_MODE_YUKARI,10, 3, 5, 5, MELEE_STUN ,6},
	{ _("スキマから光弾が飛び出し%sに炸裂した。",
        "Exploding light bullets fly out of your gap at %s."),   		MELEE_MODE_YUKARI,14, 5, 7, 5, 0 ,5},
	{ _("%sの上から墓石が落下した。",
        "You drop a tombstone on top of %s."),                 	MELEE_MODE_YUKARI,18, 10, 6, 7,MELEE_STUN ,5},
	{ _("スキマから道路標識が飛び出して%sに激突した！",
        "Road signs fly out of your gap and strike %s!"),   MELEE_MODE_YUKARI,22, 10, 6, 7, MELEE_STUN ,9},
	{ _("スキマが%sを切り裂いた！",
        "You cleave %s with your gap!"),						MELEE_MODE_YUKARI,25, 15, 8, 8, MELEE_DEC_DEF ,9},
	{ _("謎の飛行物が%sを強襲した！",
        "A mysterious flying object strikes down %s!"),						MELEE_MODE_YUKARI,30, 20, 8, 8, MELEE_CONFUSE ,9},
	{ _("スキマから卒塔婆が飛び出して%sに突き刺さった！",
        "A grave tablet flies out of your grave and pierces %s!"),	MELEE_MODE_YUKARI,36, 25, 8, 8, MELEE_DEC_MAG ,5},
	{ _("%sを強固な結界に閉じ込めた！",
        "%s is restrained in a solid barrier!"),					MELEE_MODE_YUKARI,40, 25, 9, 9, MELEE_DEC_ATK ,8},
	{ _("黒い蝶が%sを覆い尽くした・・",
        "Black butterflies surround %s..."),					MELEE_MODE_YUKARI,44, 35, 10, 10, MELEE_DEC_ALL ,12},
	{ _("二つのスキマが%sを挟み込んで大爆発を起こした！",
        "You trap %s between two of your gaps and cause a large explosion!"), MELEE_MODE_YUKARI,48, 45, 12, 12, MELEE_STUN2 ,15},

	{ _("%sを銃床で殴った。",
        "You strike %s with your gun stock."),					MELEE_MODE_GUN_HANDGUN,1, 0,  2, 3, 0 ,3},
	{ _("銃身をつかんで%sをぶん殴った！",
        "You grab your gun by the barrel and strike %s!"),		MELEE_MODE_GUN_HANDGUN,25,15, 4, 8, MELEE_STUN ,6},

	{ _("%sを銃身で突いた。",
        "You thrust your gun barrel at %s."),				MELEE_MODE_GUN_LONGBARREL,1, 0,1, 6, 0 ,3},
	{ _("%sへ銃身のフルスイングを食らわせた！",
        "You swing your gun at %s!"),	MELEE_MODE_GUN_LONGBARREL,20,20,3, 8, MELEE_STUN ,8},
	{ _("%sへ銃床を叩き付けた！",
        "You slam %s with your gun stock!"),			MELEE_MODE_GUN_LONGBARREL,35,20,5, 8, 0 ,10},

	{ _("%sを銃剣で突いた。",
        "You thrust at %s with your bayonet."),				MELEE_MODE_GUN_BAYONET,1, 0,2, 8, 0 ,4},
	{ _("%sへ銃剣の乱れ突きを放った！",
        "You thrust at %s with your bayonet over and over!"),		MELEE_MODE_GUN_BAYONET,12,5,4, 8, 0 ,6},
	{ _("銃剣を構えて%sへ突撃した！",
        "You charge at %s with your bayonet held in front!"),			MELEE_MODE_GUN_BAYONET,24,10,6, 8, MELEE_DELAY ,8},
	{ _("%sを銃剣で貫いた！",
        "You pierce %s with your bayonet!"),				MELEE_MODE_GUN_BAYONET,36,25,9, 9, MELEE_DELAY ,10},

	{ _("%sを砲身でぶん殴った。",
        "You strike %s with your barrel."),			MELEE_MODE_GUN_LAUNCHER,1, 0, 1, 12, 0 ,6},
	{ _("%sへ砲身を叩き付けた！",
        "You slam %s with your barrel!"),			MELEE_MODE_GUN_LAUNCHER,30,20,5, 8, MELEE_STUN ,12},

	//この攻撃の時、特殊処理で攻撃力に銃の攻撃力/4が加算される
	//v1.1.21 1/8から1/4にした代わりに残弾を反映
	{ _("両腕の銃を回転させて%sを打ち据えた。",
        "You strike %s, spinning both of your guns."),				MELEE_MODE_GUN_TWOHAND,1, 0,  1, 4, 0 ,4},
	{ _("至近距離から%sへ二丁拳銃を乱射した！",
        "You fire at %s from your guns at close range!"),				MELEE_MODE_GUN_TWOHAND,20,10, 3, 4, MELEE_DELAY ,5},
	{ _("%sの死角から素早く入り込み零距離射撃を放った！",
        "You quickly move into a blind spot and fire at %s from point blank range!"),		MELEE_MODE_GUN_TWOHAND,30,20, 4, 5, MELEE_STUN ,6},
	{ _("%sに向けてエビ反りジャンプしながら射撃した！",
        "You jump at %s while constantly firing!"),		MELEE_MODE_GUN_TWOHAND,35,25, 5, 5, MELEE_DELAY ,8},
	{ _("ムーンサルトしながら%sへ銃を連射した！",
        "You do a moonsault and keep firing at %s!"),				MELEE_MODE_GUN_TWOHAND,40,20, 6, 6, MELEE_DELAY ,10},
	{ _("踊るように%sへ銃弾を叩き込み、華麗に残心を決めた！",
        "You assault %s with gunfire, elegantly as if you were dancing!"),	MELEE_MODE_GUN_TWOHAND,45,40, 8, 8, MELEE_STUN2 ,14},

	//v1.1.19 うどんげ
	{ _("%sに肘打ちを食らわせた。",
        "You hit %s with an elbow strike."),   						MELEE_MODE_UDONGE,1, 0, 1, 5, 0 ,3},
	{ _("%sに横蹴りを食らわせた。",
        "You hit %s with a horizontal kick."),   						MELEE_MODE_UDONGE,7, 5, 2, 5, 0 ,5},
	{ _("%sを睨んだ。",
        "You gaze at %s."),   									MELEE_MODE_UDONGE,15, 5, 4, 5, MELEE_CONFUSE ,2},
	{ _("%sに回し蹴りを食らわせた。",
        "You hit %s with a roundhouse kick."),							MELEE_MODE_UDONGE,21, 10, 5, 5, MELEE_STUN ,7},
	{ _("どこからか取り出した毒薬を%sに投げつけた。",
        "You throw a bottle of poison at %s."),   		MELEE_MODE_UDONGE,27, 20, 6, 6, MELEE_POIS ,6},
	{ _("%sを両足で踏みつけた。",
        "You kick %s with both legs."),								MELEE_MODE_UDONGE,32, 25, 4, 12, MELEE_STUN ,9},
	{ _("%sに後ろ蹴りを食らわせた。",
        "You hit %s with a reverse kick."),							MELEE_MODE_UDONGE,36, 30, 7, 7, MELEE_STUN ,9 },
	{ _("%sに怪光線を放った。",
        "You fire a mysterious ray at %s."),   							MELEE_MODE_UDONGE,40, 30, 8, 8, MELEE_CONFUSE ,5},
	{ _("%sに幻朧月睨（ルナティックレッドアイズ)を食らわせた！",
        "You hit %s with Lunatic Red Eyes!"), MELEE_MODE_UDONGE,44, 40, 10, 10, MELEE_STUN3 ,12},

	//v1.1.20 お燐 重量変更
	{ _("猫車で%sへ体当りした。",
        "You tackle %s with your cart."),						MELEE_MODE_ORIN,1, 0, 2, 6, MELEE_NEKOGURUMA ,1},
	{ _("%sを猫車で跳ね飛ばした！",
        "You bounce off %s with your cart!"),					MELEE_MODE_ORIN,20,10,4, 7, MELEE_NEKOGURUMA ,1},
	{ _("%sを猫車で轢いた！",
        "You run over %s with your cart!"),							MELEE_MODE_ORIN,30,20,6, 8, MELEE_NEKOGURUMA ,1},
	{ _("%sを猫車で吹っ飛ばした！",
        "You knock %s away with your cart!"),					MELEE_MODE_ORIN,40,35,9, 9, MELEE_NEKOGURUMA ,1},

	//v1.1.20 兵士　バックスタッブ用
	{ _("あなたは紐を構えて忍び寄った..",
        "You sneak up to %s holding a string..."),				MELEE_MODE_SNEAKING,1,  0, 3, 3, 0 ,1},
	{ _("あなたは石を詰めた袋を構えて忍び寄った..",
        "You sneak up to %s holding a bag of rocks..."),	MELEE_MODE_SNEAKING,10, 5, 4, 4, 0 ,1},
	{ _("あなたは尖った枝を構えて忍び寄った..",
        "You sneak up to %s holding a pointed branch..."),		MELEE_MODE_SNEAKING,20,15, 5, 5, 0 ,1},
	{ _("あなたは気配を殺して忍び寄った..",
        "You sneak while absolutely concealing your presence..."),			MELEE_MODE_SNEAKING,30,25, 6, 6, 0 ,1},
	{ _("あなたはスプーンを構えて忍び寄った..",
        "You sneak up to %s holding a spoon..."),		MELEE_MODE_SNEAKING,45,40,12,12, 0 ,1},

	//v1.1.37 小鈴変身時
	{ _("影のようなものが%sに絡みついた。",
        "Something shadowy entangles %s."),           MELEE_MODE_HYAKKI,1, 0, 3, 3, MELEE_SLOW ,1},
	{ _("影の鉤爪が%sを引っ掻いた。",
        "You scratch %s with sharp shadow claws."),           		MELEE_MODE_HYAKKI,7, 0, 3, 5, 0 ,4},
	{ _("影の角が%sを突いた。",
        "You thrust shadow horns at %s."),                 		MELEE_MODE_HYAKKI,12, 7, 2, 10, MELEE_STUN ,8},
	{ _("影の鉤爪が%sを掻き毟った。",
        "You rip %s with sharp shadow claws."),					MELEE_MODE_HYAKKI,16, 12, 5, 5, MELEE_DEC_DEF ,6},
	{ _("影の牙が%sへ噛み付いた。",
        "You bite %s with shadow fangs."),                 	MELEE_MODE_HYAKKI,21, 15, 6, 6, MELEE_VAMP ,8},
	{ _("影が%sを締め上げた！",
        "You constrict %s with shadows!"),              			MELEE_MODE_HYAKKI,27, 20, 7, 7, MELEE_SLOW ,2},
	{ _("影の牙が%sを貫いた！",
        "You pierce %s with shadow fangs!"),                 		MELEE_MODE_HYAKKI,32, 25, 5, 10,MELEE_VAMP ,10},
	{ _("巨大な影が%sへ飛びかかった！",
        "A massive shadow flies at %s!"),				MELEE_MODE_HYAKKI,36, 30, 9,  9, MELEE_STUN ,12},
	{ _("影の鉤爪が%sを滅多斬りにした！",
        "You slice %s up with sharp shadow claws!"),          	MELEE_MODE_HYAKKI,40, 30, 11, 11, MELEE_DEC_DEF ,10},
	{ _("影の顎門が%sを呑み込んだ！",
        "You engulf %s with a massive shadow jaw!"),					MELEE_MODE_HYAKKI,45, 40, 12, 12, MELEE_VAMP ,10},

	//v1.1.42 ドレミー
	{ _("帽子が伸びて%sを突いた。",
        "You extend your hat, thrusting at %s."),					MELEE_MODE_DOREMY, 1,  0,  2,  3, 0 ,3 },
	{ _("ハンモックから%sに向かって跳ね起きた。",
        "You bounce from your hammock at %s."),		MELEE_MODE_DOREMY, 5,  0,  2,  5, 0 ,5 },
	{ _("%sの上にクッションダイブした。",
        "You cushion dive on top of %s."),				MELEE_MODE_DOREMY,10,  0,  2,  6, MELEE_STUN ,6 },
	{ _("羊が%sに体当たりした。",
        "A sheep tackles %s."),						MELEE_MODE_DOREMY,14,  5,  2,  8, MELEE_SLEEP ,3 },
	{ _("%sにベッドを投げつけた！",
        "You throw a bed at %s!"),					MELEE_MODE_DOREMY,18, 10,  5,  5, 0 ,7 },
	{ _("%sの耳元でラッパを吹いた！",
        "You blow a trumpet in front of %s!"),					MELEE_MODE_DOREMY,22, 15,  6,  6, MELEE_STUN ,7 },
	{ _("夢塊の大玉に乗って%sに突進した！",
        "You charge at %s riding a big ball of dream mass!"),			MELEE_MODE_DOREMY,26, 20,  5,  8, MELEE_SLEEP ,9 },
	{ _("%sにベッドを山ほど投げつけた！",
        "You throw a mountain of beds at %s!"),				MELEE_MODE_DOREMY,30, 20,  6, 10, 0 ,8 },
	{ _("%sにドレミーポッピングを見舞った！",
        "You hit %s with Doremy Popping!"),			MELEE_MODE_DOREMY,34, 25,  6,  8, MELEE_SLEEP ,8 },
	{ _("%sの耳元で思い切りラッパを吹いた！",
        "You blow a trumpet in front of %s with all of your strength!"),			MELEE_MODE_DOREMY,38, 30,  8,  8, MELEE_STUN2 ,10 },
	{ _("羊たちが%sを揉みくちゃにした！",
        "Several sheep assault %s!"),				MELEE_MODE_DOREMY,42, 30,  7, 10, MELEE_SLEEP ,8 },
	{ _("悪夢の塊が%sを押し潰した！",
        "You crush %s with a lump of nightmares!"),					MELEE_MODE_DOREMY,47, 40, 10, 12, MELEE_SLEEP ,16 },

	//v1.1.46 女苑1
	{ _("%sに金をせがんだ。",
        "You beg %s for money."),								MELEE_MODE_JYOON_1, 1, 0, 1, 4, 0 ,1 },
	{ _("%sへ掴みかかった。",
        "You grab %s."),								MELEE_MODE_JYOON_1, 5, 0, 1, 6, 0 ,4 },
	{ _("%sを殴った。",
        "You punch %s."),									MELEE_MODE_JYOON_1,10, 0, 1, 8, 0 ,5 },
	{ _("%sにアッパーを食らわせた。",
        "You uppercut %s."),						MELEE_MODE_JYOON_1,15, 5, 2, 4, 0 ,6 },
	{ _("%sに頭突きした。",
        "You headbutt %s."),								MELEE_MODE_JYOON_1,20,10, 2, 6, MELEE_STUN ,8 },
	{ _("%sにエルボードロップを見舞った。",
        "You hit %s with an elbow drop."),				MELEE_MODE_JYOON_1,25,10, 3, 5, 0 ,6 },
	{ _("%sに威圧的な腹パンを食らわせた。",
        "You hit %s with a strong stomach punch."),				MELEE_MODE_JYOON_1,30,20, 4, 6, 0 ,6 },
	{ _("%sの胸倉を掴んで持ち上げて揺さぶった。",
        "You grab and shake %s by the chest."),			MELEE_MODE_JYOON_1,35,20, 5, 6, MELEE_STUN ,3 },
	{ _("%sを抱え込んで連続パンチを食らわせた。",
        "You hold and keep punching %s."),			MELEE_MODE_JYOON_1,40,30, 6, 7, 0 ,7 },
	{ _("%sに督促状を叩きつけて思い切りぶん殴った！",
        "You keep striking %s with full force!"),		MELEE_MODE_JYOON_1,45,35, 8, 8, MELEE_STUN ,16},

	//女苑2
	{ _("派手な扇で%sを薙ぎ払った。",
        "You sweep %s with a gaudy fan."),						MELEE_MODE_JYOON_2, 1, 0, 2, 8, 0 ,5 },
	{ _("ブランドバッグで%sをぶっ叩いた。",
        "You bludgeon %s with a brand bag."),				MELEE_MODE_JYOON_2,10, 0, 4, 8, 0 ,6 },
	{ _("あなたの呼び止めたタクシーが%sを跳ねた！",
        "You call a taxi cab to strike %s!"),		MELEE_MODE_JYOON_2,15, 0, 6, 7, 0 ,12 },
	{ _("大粒の宝石が%sの頭上へ降り注いだ。",
        "Large gemstones fall on top of %s."),				MELEE_MODE_JYOON_2,20,10, 8, 8, MELEE_STUN ,3 },
	{ _("紙幣の旋風が%sを襲った。",
        "%s is engulfed in a whirlwind of banknotes."),						MELEE_MODE_JYOON_2,25,20, 9, 9, MELEE_SLOW ,1 },
	{ _("%sへ輝くばかりの連撃を見舞った！",
        "You hit %s with a series of dazzling strikes!"),				MELEE_MODE_JYOON_2,30,20,10,10, 0 ,7 },
	{ _("黄金のトルネードが%sを吹き飛ばした！",
        "%s is knocked back by a golden tornado!"),			MELEE_MODE_JYOON_2,35,25,12,12, MELEE_STUN ,8 },
	{ _("%sへ札束をばら撒いて火をつけた！",
        "You scatter bills at %s and set them on fire!"),				MELEE_MODE_JYOON_2,40,30,13,13, MELEE_FIRE ,1 },
	{ _("金銀財宝を撒き散らしながら%sへ突撃した！",
        "You charge at %s, throwing gold and silver!"),		MELEE_MODE_JYOON_2,44,30,15,15, MELEE_STUN2 ,12 },
	{ _("眩いスポットライトを浴びて踊りまくった！",
        "You dance in a dazzling spotlight!"),		MELEE_MODE_JYOON_2,48,40,18,18, MELEE_STUN3 ,20 },

	//v1.1.92 女苑専用性格
	{ _("%sを殴った。",
        "You punch %s."),									MELEE_MODE_JYOON_3, 1, 0, 1, 7, 0 ,1 },
	{ _("%sにワンツーパンチを食らわせた。",
        "You hit %s with a one-two punch."),				MELEE_MODE_JYOON_3, 5, 0, 2, 5, 0 ,4 },
	{ _("%sに火を放った！",
        "You shoot fire at %s!"),								MELEE_MODE_JYOON_3,10, 0, 3, 3, MELEE_FIRE ,1 },
	{ _("姉が%sに纏わりついた。",
        "Your sister possesses %s."),							MELEE_MODE_JYOON_3,15, 5, 3, 5, MELEE_STUN ,4 },
	{ _("%sに爆熱の右ストレートを食らわせた！",
        "You hit %s with an explosive right straight!"),			MELEE_MODE_JYOON_3,20,10, 4, 5, MELEE_FIRE ,6 },
	{ _("%sに向かってロケットのように打ち上がった！",
        "You launch yourself at %s like a rocket!"),		MELEE_MODE_JYOON_3,25,10, 3,12, MELEE_STUN ,10 },
	{ _("%sに燃え盛る大振りアッパーを食らわせた！",
        "You hit %s with a blazing uppercut!"),		MELEE_MODE_JYOON_3,30,20, 5, 8, MELEE_FIRE ,7 },
	{ _("%sに向けて姉をぶん投げた！",
        "You throw your sister at %s!"),						MELEE_MODE_JYOON_3,35,20, 8, 8, MELEE_STUN ,6 },
	{ _("爆炎とともに%sに突撃した！",
        "You charge at %s with an explosion!"),						MELEE_MODE_JYOON_3,40,30, 9, 9, MELEE_FIRE ,9 },
	{ _("%sに姉妹のツープラトンアタックを決めた！",
        "You and your sister perform a two-platoon attack on %s!"),		MELEE_MODE_JYOON_3,45,35,12,12, MELEE_STUN2 ,15 },

	//v1.1.48 紫苑(スーパー貧乏神時)
	{ _("負のオーラが%sに絡みついた。",
        "%s is entangled in a negative aura."),					MELEE_MODE_SUPER_SHION,1,0,12,12, MELEE_STUN ,1 },
	{ _("恐怖の暗黒オーラが%sを包んだ。",
        "A terrible black aura surrounds %s."),					MELEE_MODE_SUPER_SHION,20,10,12,12, MELEE_STUN2 ,10 },
	{ _("%sは不幸のオーラに呑み込まれた！",
        "%s is swallowed by misfortune aura!"),				MELEE_MODE_SUPER_SHION,30,20,20,20, MELEE_STUN2 ,12 },
	{ _("%sの運気を根こそぎ吸い取った！",
        "You drain %s of good fortune!"),					MELEE_MODE_SUPER_SHION,40,30,25,25, MELEE_DEC_ALL ,16 },

	//v1.1.59 舟に乗っているとき
	{ _("舟の舳先が%sにぶつかった。",
        "You strike %s with your boat bow."),			MELEE_MODE_BOAT,1, 0, 3, 6, MELEE_STUN ,5 },
	{ _("舟に勢いをつけて%sに体当たりした。",
        "You ram your boat into %s."), MELEE_MODE_BOAT,15, 0, 6, 7, MELEE_STUN2 ,10 },
	{ _("%s目掛けて魚雷のように突っ込んだ！",
        "You charge at %s like a torpedo!"), MELEE_MODE_BOAT,35, 40, 12,12, MELEE_STUN3 ,20 },

	//v1.1.68 三妖精専用性格
	{ _("サニーが%sを蹴った。",
        "Sunny kicks %s."),					MELEE_MODE_3_FAIRIES_2,1, 0, 2, 3, 0 ,3 },
	{ _("ルナが転んだ。",
        "Luna tumbles."),							MELEE_MODE_3_FAIRIES_2,3, 3, 1, 1, MELEE_STUN ,3 },
	{ _("チルノが氷塊で%sを殴りつけた！",
        "Cirno hits %s with a lump of ice!"),			MELEE_MODE_3_FAIRIES_2,6,  0, 2, 5, MELEE_COLD ,8 },
	{ _("ピースが松明で%sを焦がした！",
        "Piece scorches %s with her torch!"),			MELEE_MODE_3_FAIRIES_2,8,  0, 2, 5, MELEE_FIRE ,5 },
	{ _("スターは後ろから皆を応援している！",
        "Star supports everyone from behind!"),		MELEE_MODE_3_FAIRIES_2,10,  5, 1, 1, MELEE_DEC_ATK ,10 },
	{ _("ラルバが%sに悪臭を放った。",
        "Larva lets out foul breath at %s."),				MELEE_MODE_3_FAIRIES_2,12,  6,  3, 4, MELEE_POIS ,10 },
	{ _("サニーが%sの前で光った！",
        "Sunny emits a flash of light in front of %s!"),				MELEE_MODE_3_FAIRIES_2,14,  8, 2, 7, MELEE_SLAY_EVIL ,5 },
	{ _("チルノが氷の剣で%sを切り裂いた！",
        "Cirno slashes %s with an ice sword!"),		MELEE_MODE_3_FAIRIES_2,16, 10, 3, 7, MELEE_COLD ,10 },
	{ _("ルナがつんのめって転んだ！",
        "Luna trips and tumbles!"),				MELEE_MODE_3_FAIRIES_2,18, 10, 1, 1, MELEE_STUN ,3 },
	{ _("ピースが%sを燃やした！",
        "Piece burns %s!"),					MELEE_MODE_3_FAIRIES_2,20, 10, 4, 5, MELEE_FIRE ,6 },
	{ _("全員で%sに飛びかかった！",
        "All of you leap at %s!"),				MELEE_MODE_3_FAIRIES_2,22, 15, 5, 5, MELEE_DELAY ,8 },
	{ _("スターは水筒のお茶で一服している！",
        "Star takes a tea break!"),		MELEE_MODE_3_FAIRIES_2,24, 20, 1, 1, MELEE_DEC_ATK ,1 },
	{ _("ラルバが%sに鱗粉を振り撒いた！",
        "Larva scatters scales at %s!"),			MELEE_MODE_3_FAIRIES_2,26, 20, 5, 5, MELEE_POIS ,5 },
	{ _("ルナがもんどりうって転んだ！",
        "Luna trips and falls down hard!"),			MELEE_MODE_3_FAIRIES_2,28, 25, 1, 50, MELEE_STUN3 ,20 },
	{ _("サニーが%sへ強烈な閃光を放った！",
        "Sunny emits intense light at %s!"),		MELEE_MODE_3_FAIRIES_2,30, 25, 6, 6, MELEE_SLAY_EVIL ,8 },
	{ _("チルノが%sにグレートクラッシャーを食らわせた！",
        "Cirno hits %s with Great Crusher!"),	MELEE_MODE_3_FAIRIES_2,32, 25, 6, 10, MELEE_COLD ,12 },
	{ _("大妖精たちが一斉にビームを放った！",
        "You together fire a large beam!"),		MELEE_MODE_3_FAIRIES_2,34, 20, 7, 7, MELEE_DEC_MAG ,5 },
	{ _("%sにグレートトライアングルを食らわせた！",
        "You hit %s with Great Triangle!"),	MELEE_MODE_3_FAIRIES_2,36, 30, 8, 7, MELEE_DELAY ,10 },
	{ _("全員で%sをげしげし蹴った！",
        "All of you keep kicking %s over and over!"),				MELEE_MODE_3_FAIRIES_2,38, 30, 8, 8, MELEE_DELAY ,6 },
	{ _("チルノが%sを氷柱に閉じ込めた！",
        "Cirno encases %s into an ice pillar!"),			MELEE_MODE_3_FAIRIES_2,40, 30, 9, 9, MELEE_COLD ,9 },
	{ _("ピースが%sにバースティンググラッジを食らわせた！",
        "Piece hits %s with Bursting Grudge!"),	MELEE_MODE_3_FAIRIES_2,42, 30, 10, 10, MELEE_ATAGO ,15 },
	{ _("スターの爆弾が%sを吹き飛ばした！",
        "Star blows %s away with a bomb!"),		MELEE_MODE_3_FAIRIES_2,43, 40, 11, 11, MELEE_STUN2 ,20 },
	{ _("%sにフェアリーオーバードライブを食らわせた！",
        "You hit %s with Fairy Overdrive!"),	MELEE_MODE_3_FAIRIES_2,45, 40, 12, 12, MELEE_STUN2 ,12 },
	{ _("全員で%sを叩きのめした！",
        "All of you beat %s up!"),				MELEE_MODE_3_FAIRIES_2,48, 45, 13, 13, MELEE_DELAY ,12 },

	//v1.1.78 酔拳
	{ _("%sの目の前で叫んだ！",
        "You scream in front of %s!"),						MELEE_MODE_SUIKEN,1, 0, 1, 1, MELEE_CONFUSE ,4 },
	{ _("%sを突いた。",
        "You thrust at %s."),								MELEE_MODE_SUIKEN,4, 0, 2, 4, 0 ,6 },
	{ _("%sに頭突きした。",
        "You headbutt %s."),							MELEE_MODE_SUIKEN,8, 0, 3, 4, MELEE_STUN ,5 },
	{ _("%sの懐に滑り込んで肘打ちを食らわせた！",
        "You hit %s with an elbow strike!"),     MELEE_MODE_SUIKEN,12, 3, 4, 4, 0 ,6 },
	{ _("地面を転がりながら%sを蹴りまくった！",
        "You kick %s while rolling on the ground!"),		MELEE_MODE_SUIKEN,15, 5, 5, 5, MELEE_SLOW ,7 },
	{ _("%sに連続裏拳を食らわせた！",
        "You keep hitting %s with back of your fist!"),   				MELEE_MODE_SUIKEN,18, 5, 5, 6, 0 ,5 },
	{ _("%sにしがみついて引きずり倒した！",
        "You cling and drag down %s!"),           MELEE_MODE_SUIKEN,21, 10, 2, 12, MELEE_SLOW ,10 },
	{ _("腰をクネクネさせながら%sへ乱撃を放った！",
        "You keep hitting %s while swaying!"),   MELEE_MODE_SUIKEN,24, 10, 6, 6, 0 ,9 },
	{ _("%sに抱きついて連続頭突きを食らわせた！",
        "You hug %s and deliver multiple headbutts!"),     MELEE_MODE_SUIKEN,27, 10, 7, 6, MELEE_STUN ,10 },
	{ _("%sの下に滑り込んで背後から蹴り倒した！",
        "You slide under %s and deliver a kick from behind!"),		MELEE_MODE_SUIKEN,30, 15, 7, 7, MELEE_DELAY ,8 },
	{ _("%sに執拗な連続目潰しを見舞った！",
        "You keep relentlessly hitting %s in the eyes!"),			MELEE_MODE_SUIKEN,33, 20, 5, 8, MELEE_CONFUSE ,3 },
	{ _("%sに大ジャンプからの空中三段蹴りを見舞った！",
        "You jump and kick %s three times in the air!"),MELEE_MODE_SUIKEN,36, 25, 8, 8, MELEE_DELAY ,10 },
	{ _("%sにカエル跳び頭突きを食らわせた！",
        "You leap and headbutt %s!"),			MELEE_MODE_SUIKEN,39, 30, 8, 10, MELEE_STUN2 ,10 },
	{ _("%sに向けて火を吹いた！",
        "You breathe fire at %s!"),					 	MELEE_MODE_SUIKEN,42, 30, 8, 8, MELEE_FIRE ,5 },
	{ _("%sの頭を掴んでぶん回した！",
        "You grab %s by the head and twist it!"),					MELEE_MODE_SUIKEN,45, 35, 9, 9, MELEE_CONFUSE ,8 },
	{ _("%sにローリング頭突きを決めた！",
        "You strike %s with a rolling headbutt!"),				MELEE_MODE_SUIKEN,48, 40, 10, 12, MELEE_STUN3 ,12 },

	//v2.0.11 あうん追加攻撃用
	{ _("あなたの分身が%sへ追撃を見舞った。",
        "Your clone follows up with a strike at %s."),				MELEE_MODE_AUNN_2, 1, 0, 5, 5, 0 ,6 },
	{ _("あなたの分身が%sへ回転体当たりを食らわせた！",
        "Your clone hits %s with a spinning tackle!"),   MELEE_MODE_AUNN_2,15, 15, 7, 7, MELEE_STUN ,6 },
	{ _("あなたの分身が%sへ錐揉み頭突きを食らわせた！。",
        "Your clone headbutts %s with her horn!"),	MELEE_MODE_AUNN_2,30, 25, 9, 9, MELEE_STUN ,8 },
	{ _("あなたたちは%sに鮮やかなツープラトンを決めた！",
        "You, along with your clone, deliver a brilliant two-platoon strike to %s!"), MELEE_MODE_AUNN_2,45, 40, 12,12, MELEE_STUN2 ,12 },

	//v2.0.12 慧ノ子
	{ _("%sを噛んだ。",
        "You bite %s."),           					MELEE_MODE_ENOKO, 1, 0,   2,  4, 0 ,2 },
	{ _("%sをトラバサミで殴った。",
        "You hit %s with a beartrap."),           		MELEE_MODE_ENOKO, 5, 3,   2,  5, MELEE_STUN ,3 },
	{ _("トラバサミで%sに食いついた。",
        "You bite %s with a beartrap."),				MELEE_MODE_ENOKO,10, 5,   2,  7, MELEE_SLOW ,4 },
	{ _("%sにワンツー噛み付きを食らわせた。",
        "You strike %s with a one-two punch."),  		MELEE_MODE_ENOKO,15, 10,  4,  5, 0 ,5 },
	{ _("%sをトラバサミで掴んでねじり上げた。",
        "You grab %s with a beartrap and twist it."),		MELEE_MODE_ENOKO,20, 12,  5,  5, MELEE_DEC_ATK ,5 },
	{ _("%sに両手から火を吹き付けた！",
        "You breathe fire from both of your arms at %s!"), 				MELEE_MODE_ENOKO,24, 15,  6,  6, MELEE_FIRE ,3 },
	{ _("%sに右ストレート噛みつきを食らわせた。",
        "You hit %s with a right straight punch."),		MELEE_MODE_ENOKO,28, 20,  3, 15,  0 ,12 },
	{ _("%sをトラバサミで掴んで振り回した！",
        "You grab %s with a beartrap, swinging it around!"),     	MELEE_MODE_ENOKO,32, 25,  6,  8, MELEE_DEC_MAG ,6 },
	{ _("%sにトラバサミの刃が勢い良く食い込んだ！",
        "You deeply drive the blades of your beartrap into %s!"), 	MELEE_MODE_ENOKO,36, 30,  7,  8, MELEE_SLOW ,8 },
	{ _("%sにダブルアッパー噛みつきを食らわせた！",
        "You strike %s with a double uppercut!"), 	MELEE_MODE_ENOKO,39, 35,  8,  8, MELEE_STUN ,8 },
	{ _("赤熱する刃が%sを焼き焦がした！",
        "You scorch %s with red-hot blades!"), 			MELEE_MODE_ENOKO,42, 35,  9,  9, MELEE_FIRE ,6 },
	{ _("%sにトラバサミのデスロールを見舞った！",
        "You hit %s with a beartrap death roll!"),   	MELEE_MODE_ENOKO,45, 40, 10, 10, MELEE_DEC_ATK ,10 },
	{ _("%sを三つの顎で噛んで噛んで噛みまくった！",
        "You keep chomping and chomping and chomping on %s with your three jaws!"),   MELEE_MODE_ENOKO,47, 40, 12, 12, MELEE_DELAY ,12 },


	//v2.0.19 養蜂家の蜂
	{ _("蜂たちが威嚇的な羽音を立てた。",
        "Your bees buzz menacingly."),			MELEE_MODE_BEES, 1,  0, 1, 1, 0 ,1 },
	{ _("小さな蜂が%sを刺した。",
        "A small bee stings %s."),				MELEE_MODE_BEES,10,  0, 2, 8, MELEE_POIS ,1 },
	{ _("蜂の群れが%sに群がった。",
        "A swarm of bees engulfs %s."),			MELEE_MODE_BEES,20, 10, 3, 8, MELEE_POIS ,3 },
	{ _("無数の蜂が%sを押し包んだ！",
        "Countless bees envelop %s!"),			MELEE_MODE_BEES,28, 15, 4, 8, MELEE_POIS ,4 },
	{ _("蜂たちが%sに次々に毒針を突き立てた！",
        "Bees stab %s over and over with their poisoned stingers!"),	MELEE_MODE_BEES,35, 25, 7, 8, MELEE_POIS ,6 },
	{ _("妖怪蜂の大群が%sを呑み込んだ！",
        "A large swarm of youkai bees swallows %s!"),			MELEE_MODE_BEES,43, 35, 10,10, MELEE_DEC_ATK ,8 },

	//v2.1.0 瑞霊
	{ _("%sを殴りつけた。",
        "You punch %s hard."),             			MELEE_MODE_MIZUCHI, 1,  0,  1, 8, 0 ,3 },
	{ _("%sを殴り倒した。",
        "You beat %s down."),  	               		MELEE_MODE_MIZUCHI, 7,  0,  2, 8, 0 ,4 },
	{ _("%sに触って力を吸い取った。",
        "Your touch drains power from %s."),    			MELEE_MODE_MIZUCHI, 15, 0,  3, 7, MELEE_DEC_ATK ,4 },
	{ _("%sを殴り飛ばした。",
        "You strike and knock %s away."),            	     	MELEE_MODE_MIZUCHI, 20, 0,  4, 8, 0,8 },
	{ _("%sに目にもとまらぬ拳打を見舞った。",
        "You punch %s at an imperceivable speed."),     MELEE_MODE_MIZUCHI, 25, 10, 6, 8, MELEE_STUN  ,6 },
	{ _("%sを掴んで魔力を吸い取った。",
        "You drain magical power residing in %s."),    		MELEE_MODE_MIZUCHI, 30, 15, 7, 7, MELEE_DEC_MAG ,4 },
	{ _("%sに怨みのエネルギーを叩きつけた！",
        "You strike %s with grudge energy!"),		MELEE_MODE_MIZUCHI, 35, 20, 8, 8, MELEE_DELAY ,8 },
	{ _("%sに怒りの鉄拳制裁を食らわせた！",
        "You hit %s with a furious blow of vengeance!"),		MELEE_MODE_MIZUCHI, 40, 30, 10, 10, MELEE_STUN2 ,10 },
	{ _("強大な憎悪のパワーが%sを吹き飛ばした！",
        "Power of intense hatred blows %s away!"),	MELEE_MODE_MIZUCHI, 45, 40, 12, 12, MELEE_DELAY ,12 },


	{ _("終端用dummy", "terminator dummy"),0,0,0,1,1,0}
};

///sys 素手攻撃時エフェクトと威力一覧表
/*:::文章,最低レベル,失敗率,dd,ds,特殊効果*/
/*
const martial_arts ma_blows[MAX_MA] =
{
#ifdef JP
	{ "%sを殴った。",                          1, 0, 1, 5, 0 },
	{ "%sを蹴った。",                           2, 0, 1, 7, 0 },
	{ "%sに正拳突きをくらわした。",                         3, 0, 1, 9, 0 },
	{ "%sに膝蹴りをくらわした。",             5, 5, 2, 4, MA_KNEE },
	{ "%sに肘打ちをくらわした。",            7, 5, 1, 12, 0 },
	{ "%sに体当りした。",                           9, 10, 2, 6, 0 },
	{ "%sを蹴った。",                           11, 10, 3, 6, MA_SLOW },
	{ "%sにアッパーをくらわした。",                       13, 12, 5, 5, 6 },
	{ "%sに二段蹴りをくらわした。",                    16, 15, 5, 6, 8 },
	{ "%sに猫爪撃をくらわした。",          20, 20, 5, 8, 0 },
	{ "%sに跳空脚をくらわした。",           24, 25, 6, 8, 10 },
	{ "%sに鷲爪襲をくらわした。",       28, 25, 7, 9, 0 },
	{ "%sに回し蹴りをくらわした。",         32, 30, 8, 10, 10 },
	{ "%sに鉄拳撃をくらわした。",          35, 35, 8, 11, 10 },
	{ "%sに飛空脚をくらわした。",         39, 35, 8, 12, 12 },
	{ "%sに昇龍拳をくらわした。",         43, 35, 9, 12, 16 },
	{ "%sに石破天驚拳をくらわした。",       48, 40, 10, 13, 18 },
#else
	{ "You punch %s.",                          1, 0, 1, 4, 0 },
	{ "You kick %s.",                           2, 0, 1, 6, 0 },
	{ "You strike %s.",                         3, 0, 1, 7, 0 },
	{ "You hit %s with your knee.",             5, 5, 2, 3, MA_KNEE },
	{ "You hit %s with your elbow.",            7, 5, 1, 8, 0 },
	{ "You butt %s.",                           9, 10, 2, 5, 0 },
	{ "You kick %s.",                           11, 10, 3, 4, MA_SLOW },
	{ "You uppercut %s.",                       13, 12, 4, 4, 6 },
	{ "You double-kick %s.",                    16, 15, 5, 4, 8 },
	{ "You hit %s with a Cat's Claw.",          20, 20, 5, 5, 0 },
	{ "You hit %s with a jump kick.",           25, 25, 5, 6, 10 },
	{ "You hit %s with an Eagle's Claw.",       29, 25, 6, 6, 0 },
	{ "You hit %s with a circle kick.",         33, 30, 6, 8, 10 },
	{ "You hit %s with an Iron Fist.",          37, 35, 8, 8, 10 },
	{ "You hit %s with a flying kick.",         41, 35, 8, 10, 12 },
	{ "You hit %s with a Dragon Fist.",         45, 35, 10, 10, 16 },
	{ "You hit %s with a Crushing Blow.",       48, 35, 10, 12, 18 },
#endif

};
*/
/*:::構えや職ごとの格闘職の平均ベースダメージ*100 ステータス画面での表示用*/
const int monk_ave_damage[PY_MAX_LEVEL+1][3] =
{
  {0, 0, 0},
  {249, 249, 249},
  {324, 324, 324},
  {382, 438, 382},
  {382, 439, 382},
  {390, 446, 390},
  {394, 473, 394},
  {425, 528, 425},
  {430, 535, 430},
  {505, 560, 435},
  {517, 575, 444},
  {566, 655, 474},
  {585, 713, 486},
  {653, 843, 527},
  {678, 890, 544},
  {703, 973, 558},
  {765, 1096, 596},
  {914, 1146, 614},
  {943, 1240, 629},
  {971, 1276, 643},
  {1018, 1350, 667},
  {1063, 1464, 688},
  {1099, 1515, 705},
  {1128, 1559, 721},
  {1153, 1640, 735},
  {1336, 1720, 757},
  {1387, 1789, 778},
  {1430, 1893, 794},
  {1610, 2199, 863},
  {1666, 2280, 885},
  {1713, 2401, 908},
  {1755, 2465, 925},
  {1909, 2730, 984},
  {2156, 2891, 1009},
  {2218, 2970, 1031},
  {2319, 3107, 1063},
  {2404, 3290, 1098},
  {2477, 3389, 1125},
  {2544, 3483, 1150},
  {2771, 3899, 1228},
  {2844, 3982, 1259},
  {3129, 4064, 1287},
  {3200, 4190, 1313},
  {3554, 4674, 1432},
  {3614, 4738, 1463},
  {3679, 4853, 1485},
  {3741, 4905, 1512},
  {3785, 4943, 1538},
  {4141, 5532, 1652},
  {4442, 5581, 1679},
  {4486, 5636, 1702},
};

/*
 * Table of game-generated inscriptions (indexed by the defines in
 * defines.h). -- RG
 */
const cptr game_inscriptions[] =
{
	NULL,            /* FEEL_NONE */
#ifdef JP
	"壊れている",    /* FEEL_BROKEN */
	"恐ろしい",      /* FEEL_TERRIBLE */
	"無価値",        /* FEEL_WORTHLESS */
	"呪われている",  /* FEEL_CURSED */
	"上質以上",      /* FEEL_UNCURSED */
	"並",            /* FEEL_AVERAGE */
	"上質",          /* FEEL_GOOD */
	"高級品",        /* FEEL_EXCELLENT */
	"特別製",        /* FEEL_SPECIAL */
#else
	"broken",        /* FEEL_BROKEN */
	"terrible",      /* FEEL_TERRIBLE */
	"worthless",     /* FEEL_WORTHLESS */
	"cursed",        /* FEEL_CURSED */
	"uncursed",      /* FEEL_UNCURSED */
	"average",       /* FEEL_AVERAGE */
	"good",          /* FEEL_GOOD */
	"excellent",     /* FEEL_EXCELLENT */
	"special",       /* FEEL_SPECIAL */
#endif

};

const kamae kamae_shurui[MAX_KAMAE] =
{
#ifdef JP
	{"玄武", 25, ""},
	{"白虎", 30, ""},
	{"青竜", 35, ""},
	{"朱雀", 40, ""},
#else
	{"Genbu", 25, "(Black Tortoise) "},
	{"Byakko", 30, "(White Tiger) "},
	{"Seiryuu", 35, "(Blue Dragon) "},
	{"Suzaku", 40, "(Red Phoenix) "},
#endif
};

const kamae kata_shurui[MAX_KATA] =
{
#ifdef JP
	{"居合", 25, ""},
	{"風塵", 30, ""},
	{"降鬼", 35, ""},
	{"無想", 40, ""},
#else
	{"Iai", 25, ""},
	{"Huujin", 30, ""},
	{"Kouki", 35, ""},
	{"Musou", 40, ""},
#endif
};

const cptr exp_level_str[5]=
#ifdef JP
{"[初心者]", "[入門者]", "[熟練者]", "[エキスパート]", "[達人]"};
#else
{"[Unskilled]", "[Beginner]", "[Skilled]", "[Expert]", "[Master]"};
#endif

/* Weird melee attack types when hallucinating */
///system 幻覚時のジョークメッセージ
#ifdef JP
const cptr silly_attacks[MAX_SILLY_ATTACK] =
{
	"はあなたの家の漬物を残らず食い尽くした。",
	"があなたの回りを3回回ってワンと言った。",
	"にしばきまわされた。",
	"は一人で背水の陣を敷いた。",
	"は慈悲のあるドヤ顔をした。",
	"にジャン拳で攻撃された。",
	"があなたの頬を札束でしばいた。",
	"があなたの前でポージングをした。",
	"にアカンベーされた。",
	"に「神の国」発言の撤回を求められた。",
	"にメッ○ールを飲まされた。",
	"につっこみを入れられた。",
	"はあなたと踊った。",
	"に顔にらく書きをされた。",
	"に借金の返済をせまられた。",
	"にスカートをめくられた。",
	"はあなたの手相を占った。",
	"から役満を上がられた。",
	"から愛の告白をされた。",
	"はあなたを時給500円で雇った。",
	"はあなたの100の秘密について熱く語った。",
	"がニャーと鳴いた。",
	"はあなたに気をつけた。",
	"はあなたをポリゴン化させた。",
	"に少しかじられた。",
	"はアルテマの呪文を唱えた！",
	"はあなたのスパイクをブロックした。",
	"はスライド移動した。",
	"は昇龍拳コマンドの入力に失敗した。",
	"は拡散波動砲を発射した。",
	"はデスラー戦法をしかけた。",
	"にライダーキックで攻撃された。",
	"に二週間以内でビデオを人に見せないと死ぬ呪いをかけられた。",
	"はパルプンテを唱えた。",
	"はスーパーウルトラギャラクティカマグナムを放った。",
	"にしゃがみ小キックでハメられた。",
	"にジェットストリームアタックをかけられた。",
	"はあなたに卍固めをかけて「1、2、3、ダーッ！」と叫んだ。",
	"は「いくじなし！ばかばかばか！」といって駆け出した。",
	"が「ごらん、ルーベンスの絵だよ」と言って静かに目を閉じた。",
	"は言った。「変愚蛮怒、絶賛公開中！」",
};

/* Note: %s for strfmt() */
const cptr silly_attacks2[MAX_SILLY_ATTACK] =
{
	"%sに襲い掛かりのした。",
	"%sの回りを3回回ってワンと言った。",
	"%sをしばきまわした。",
	"%sに一人で背水の陣を敷いた。",
	"%sに慈悲のあるドヤ顔をした。",
	"%sをジャン拳で攻撃した。",
	"%sの頬を札束でしばいた。",
	"%sの前でポージングをした。",
	"%sにアカンベーした。",
	"%sに「神の国」発言の撤回を求めた。",
	"%sにメッ○ールを飲ませた。",
	"%sにつっこみを入れた。",
	"%sと踊った。",
	"%sの顔にらく書きをした。",
	"%sに借金の返済をせまった。",
	"%sのスカートをめくった。",
	"%sの手相を占った。",
	"%sから役満を上がった。",
	"%sに愛の告白をした。",
	"%sを時給500円で雇った。",
	"%sの100の秘密について熱く語った。",
	"ニャーと鳴いた。",
	"%sに気をつけた。",
	"%sをポリゴン化させた。",
	"%sを少しかじった。",
	"アルテマの呪文を唱えた！",
	"%sのスパイクをブロックした。",
	"スライド移動した。",
	"昇龍拳コマンドの入力に失敗した。",
	"%sに拡散波動砲を発射した。",
	"%sにデスラー戦法をしかけた。",
	"%sをライダーキックで攻撃した。",
	"%sに二週間以内でビデオを人に見せないと死ぬ呪いをかけた。",
	"パルプンテを唱えた。",
	"%sにスーパーウルトラギャラクティカマグナムを放った。",
	"%sをしゃがみ小キックでハメた。",
	"%sにジェットストリームアタックをかけた。",
	"%sに卍固めをかけて「1、2、3、ダーッ！」と叫んだ。",
	"「いくじなし！ばかばかばか！」といって駆け出した。",
	"「ごらん、ルーベンスの絵だよ」と言って静かに目を閉じた。",
	"言った。「変愚蛮怒、絶賛公開中！」",
};
#else
const cptr silly_attacks[MAX_SILLY_ATTACK] =
{
	"eats all the pickles in your house.",
	"runs around you three times while barking.",
	"beats you continuously.",
	"makes a final desperate stand against you.",
	"gives you a piteous smug look.",
	"attacks you with rock-paper-scissors.",
	"slaps you with a bundle of bills.",
	"strikes a pose in front of you.",
	"expresses contempt for you.",
	"asks you to withdraw the 'Kingdom of God' statement.",
	"makes you drink me***l.",
	"makes a comment about you.",
	"dances with you.",
	"doodles on your face.",
	"demands you repay debts.",
	"flips your skirt.",
	"reads your palm.",
	"wins a Yakuman from you.",
	"confesses love for you.",
	"hires you for an hourly wage of 500 yen.",
	"gossips about your 100 secrets.",
	"meows.",
	"makes you stand to attention.",
	"simplifies you into polygons.",
	"nibbles a little bit out of you.",
	"casts the Ultima spell!",
	"blocks your spike.",
	"moves the slide.",
	"fails to enter the Shoryuken command.",
	"fires the Diffusion Wave Cannon.",
	"initiates Dessler's tactics.",
	"attacks you with a Rider Kick.",
	"curses you to die if the video isn't shown within two weeks.",
	"casts Hocus Pocus.",
	"hits you with a Super Ultra Galactica Magnum.",
	"interrupts you with a crouching short kick.",
	"uses a Jet Stream Attack on you.",
	"puts you in an octopus hold and yells \"One, two, three, out!\".",
	"says, \"You chicken! Stupid, stupid!\" and runs away.",
	"says, \"Look, it's a Reubens.\" and quietly contemplates.",
	"says, \"Hengband's publicly acclaimed!\"."
};
/* {
	"smothers",
	"hugs",
	"humiliates",
	"whips",
	"kisses",

	"disgusts",
	"pees all over",
	"passes the gas on",
	"makes obscene gestures at",
	"licks",

	"stomps on",
	"swallows",
	"drools on",
	"misses",
	"shrinks",

	"emasculates",
	"evaporates",
	"solidifies",
	"digitizes",
	"insta-kills",

	"massacres",
	"slaughters",
	"drugs",
	"psychoanalyzes",
	"deconstructs",

	"falsifies",
	"disbelieves",
	"molests",
	"pusupusu",
}; */

const cptr silly_attacks2[MAX_SILLY_ATTACK] =
{
	"comes out of nowhere and goes for %s.",
	"runs around %s three times while barking.",
	"beats %s continuously.",
	"makes a final desperate stand against %s.",
	"gives %s a piteous smug look.",
	"attacks %s with rock-paper-scissors.",
	"slaps %s with a bundle of bills.",
	"strikes a pose in front of %s.",
	"expresses contempt for %s.",
	"asks %s to withdraw the 'Kingdom of God' statement.",
	"makes %s drink me***l.",
	"makes a comment about %s.",
	"dances with %s.",
	"doodles on the face of %s.",
	"demands %s repay debts.",
	"flips the skirt of %s.",
	"does a palm reading for %s.",
	"wins a Yakuman from %s.",
	"confesses love to %s.",
	"hires %s for an hourly wage of 500 yen.",
	"gossips about the 100 secrets of %s.",
	"meows.",
	"makes %s stand to attention.",
	"simplifies %s into polygons.",
	"nibbles a little bit out of %s.",
	"casts the Ultima spell!",
	"blocks the spike of %s.",
	"moves the slide.",
	"fails to enter the Shoryuken command.",
	"fires the Diffusion Wave Cannon at %s.",
	"initiates Dessler's tactics against %s.",
	"attacks %s with a Rider Kick.",
	"curses %s to die if the video isn't shown within two weeks.",
	"casts Hocus Pocus.",
	"hits %s with a Super Ultra Galactica Magnum.",
	"interrupts %s with a crouching short kick.",
	"uses a Jet Stream Attack on %s.",
	"puts %s in an octopus hold and yells \"One, two, three, out!\".",
	"says, \"You chicken! Stupid, stupid!\" to %s and runs away.",
	"says, \"Look, it's a Reubens.\" to %s and quietly contemplates.",
	"says, \"Hengband's publicly acclaimed!\" to %s."
};
#endif


/*
 * The table of "symbol info" -- each entry is a string of the form
 * "X:desc" where "X" is the trigger, and "desc" is the "info".
 */
/*:::各文字の説明文。ident_info[][0]が対象の文字になっている。[2]以降は思い出などの説明文のためのもの*/
///mod131231 モンスターシンボル変更
const cptr ident_info[] =
{
#ifdef JP
	" :暗闇",
	"!:薬, オイル",
	"\":鈍器",
	"#:壁(隠しドア)/植物/気体",
	"$:財宝(金か宝石)",
	"%:鉱脈(溶岩か石英)",
	"&:箱",
	"':開いたドア",
	"(:軟らかい防具",
	"):盾",
	"*:財宝を含んだ鉱脈または球形の怪物",
	"+:閉じたドア",
	",:食べ物, おばけキノコ",
	"-:魔法棒, ロッド",
	".:床",
	"/:竿状武器(アックス/パイク/等)",
	"0:エントランスへの入口",
	"1:雑貨屋の入口",
	"2:防具屋の入口",
	"3:武器専門店の入口",
	"4:薬と酒の店への入口",
	"5:機械店の店の入口",
	"6:魔法の店の入口",
	"7:ブラックマーケットの入口",
	"8:拠点への入口",
	"9:書店の入口",
	"::岩石",
	";:回避の彫像/爆発のルーン",
	"<:上り階段",
	"=:指輪",
	">:下り階段",
	"?:巻物",
	"@:プレイヤー",
	"A:天使",
	"B:鳥",
	"C:犬",
	"D:古代ドラゴン/ワイアーム",
	"E:エレメンタル",
	"F:妖精",
	"G:ゴースト",
	"H:キメラ/雑種大型生物",
	"I:昆虫",
	"J:ヘビ",
	"K:河童",
	"L:リッチ",
	"M:多首の爬虫類",
	"N:謎の生物",
	"O:オーガ/鬼",
	"P:巨大人型生物",
	"Q:クイルスルグ(脈打つ肉塊)",
	"R:爬虫類/両生類",
	"S:神格",
	"T:トロル",
	"U:上級デーモン",
	"V:バンパイア",
	"W:ワイト/レイス/等",
	"X:ゾーン/ザレン/等",
	"Y:大型妖怪/人型妖怪",
	"Z:ゼファーハウンド",
	"[:堅いアーマー",
	"\\:鈍器(メイス/ムチ/等)",
	"]:種々の防具",
	"^:トラップ",
	"_:杖",
	"`:人形，彫像",
	"a:アリ",
	"b:コウモリ",
	"c:ムカデ/蜘蛛/蠍など",
	"d:ドラゴン",
	"e:目玉",
	"f:ネコ科の獣",
	"g:ゴーレム/人形/機械",
	"h:亜人間",
	"i:ベトベト",
	"j:ゼリー",
	"k:コボルド・獣人",
	"l:水棲生物",
	"m:モルド",
	"n:ナーガ",
	"o:オーク",
	"p:人間/人間型生物",
	"q:四足獣",
	"r:ネズミ/兎",
	"s:スケルトン",
	"t:天狗",
	"u:下級デーモン",
	"v:ボルテックス",
	"w:イモムシ/大群",
	/* "x:unused", */
	"y:小型妖怪",
	"z:ゾンビ/ミイラ",
	"{:飛び道具の弾(矢/弾)",
	"|:刀剣類(ソード/ダガー/等)",
	"}:飛び道具(弓/クロスボウ/スリング)",
	"~:水/溶岩流(種々のアイテム)",
#else
	" :A dark grid",
	"!:A potion (or oil)",
	"\":An amulet (or necklace)",
	"#:A wall (or secret door) / a plant / a gas",
	"$:Treasure (gold or gems)",
	"%:A vein (magma or quartz)",
	"&:A chest",
	"':An open door",
	"(:Soft armor",
	"):A shield",
	"*:A vein with treasure or a ball monster",
	"+:A closed door",
	",:Food (or mushroom patch)",
	"-:A wand (or rod)",
	".:Floor",
	"/:A polearm (Axe/Pike/etc)",
	"0:Entrance to Museum",
	"1:Entrance to General Store",
	"2:Entrance to Armory",
	"3:Entrance to Weapon store",
	"4:Entrance to Potion/Liquor store",
	"5:Entrance to Machine shop",
	"6:Entrance to Magic store",
	"7:Entrance to Black Market",
	"8:Entrance to your exploration base",
	"9:Entrance to the bookstore",
	"::Rubble",
	";:A glyph of warding / an explosive rune",
	"<:An up staircase",
	"=:A ring",
	">:A down staircase",
	"?:A scroll",
	"@:You",
	"A:Angel",
	"B:Bird",
	"C:Canine",
	"D:Ancient Dragon/Wyrm",
	"E:Elemental",
	"F:Fairy",
	"G:Ghost",
	"H:Hybrid",
	"I:Insect",
	"J:Snake",
	"K:Kappa",
	"L:Lich",
	"M:Multi-Headed Reptile",
	"N:Mysterious Being",
	"O:Ogre/Oni",
	"P:Giant Humanoid",
	"Q:Quylthulg (Pulsing Flesh Mound)",
	"R:Reptile/Amphibian",
	"S:Deity",
	"T:Troll",
	"U:Major Demon",
	"V:Vampire",
	"W:Wight/Wraith/etc",
	"X:Xorn/Xaren/etc",
	"Y:Greater Youkai/Humanoid Youkai",
	"Z:Zephyr Hound",
	"[:Hard armor",
	"\\:A hafted weapon (mace/whip/etc)",
	"]:Misc. armor",
	"^:A trap",
	"_:A staff",
	"`:A figurine or statue",
	"a:Ant",
	"b:Bat",
	"c:Centipede/Spider/etc",
	"d:Dragon",
	"e:Floating Eye",
	"f:Feline",
	"g:Golem/Doll/Automaton",
	"h:Demihuman",
	"i:Icky Thing",
	"j:Jelly",
	"k:Kobold/Werebeast",
	"l:Aquatic monster",
	"m:Mold",
	"n:Naga",
	"o:Orc",
	"p:Human/Humanoid",
	"q:Quadruped",
	"r:Rodent/Rabbit",
	"s:Skeleton",
	"t:Tengu",
	"u:Minor Demon",
	"v:Vortex",
	"w:Worm/Worm-Mass",
	/* "x:unused", */
	"y:Lesser Youkai",
	"z:Zombie/Mummy",
	"{:A missile (arrow/bolt/shot)",
	"|:An edged weapon (sword/dagger/etc)",
	"}:A launcher (bow/crossbow/sling)",
	"~:Fluid terrain (or miscellaneous item)",
#endif

	NULL
};


/*
 * The table of monsters' blow effects
 */
const mbe_info_type mbe_info[MAX_RBE] =
{
	{  0, 0,             }, /* None      */
	{ 60, GF_MISSILE,    }, /* HURT      */
	{  5, GF_POIS,       }, /* POISON    */
	{ 20, GF_DISENCHANT, }, /* UN_BONUS  */
	{ 15, GF_MISSILE,    }, /* UN_POWER  */ /* ToDo: Apply the correct effects */
	{  5, GF_MISSILE,    }, /* EAT_GOLD  */
	{  5, GF_MISSILE,    }, /* EAT_ITEM  */
	{  5, GF_MISSILE,    }, /* EAT_FOOD  */
	{  5, GF_MISSILE,    }, /* EAT_LITE  */
	{  0, GF_ACID,       }, /* ACID      */
	{ 10, GF_ELEC,       }, /* ELEC      */
	{ 10, GF_FIRE,       }, /* FIRE      */
	{ 10, GF_COLD,       }, /* COLD      */
	{  2, GF_MISSILE,    }, /* BLIND     */
	{ 10, GF_CONFUSION,  }, /* CONFUSE   */
	{ 10, GF_MISSILE,    }, /* TERRIFY   */
	{  2, GF_OLD_SLEEP,    }, /* PARALYZE  */ ///mod160130 MISSILEから変更
	{  0, GF_MISSILE,    }, /* LOSE_STR  */
	{  0, GF_MISSILE,    }, /* LOSE_INT  */
	{  0, GF_MISSILE,    }, /* LOSE_WIS  */
	{  0, GF_MISSILE,    }, /* LOSE_DEX  */
	{  0, GF_MISSILE,    }, /* LOSE_CON  */
	{  0, GF_MISSILE,    }, /* LOSE_CHR  */
	{  2, GF_MISSILE,    }, /* LOSE_ALL  */
	{ 60, GF_ROCKET,     }, /* SHATTER   */
	{  5, GF_MISSILE,    }, /* EXP_10    */
	{  5, GF_MISSILE,    }, /* EXP_20    */
	{  5, GF_MISSILE,    }, /* EXP_40    */
	{  5, GF_MISSILE,    }, /* EXP_80    */
	{  5, GF_POIS,       }, /* DISEASE   */
	{  5, GF_TIME,       }, /* TIME      */
	{  5, GF_MISSILE,    }, /* EXP_VAMP  */
	{  5, GF_MANA,       }, /* DR_MANA   */
	{ 60, GF_MISSILE,    }, /* SUPERHURT */
	///mod150609 今更気づいて追加
	{ 10, GF_INACT,  }, /* INERTIA   */
	{ 20, GF_SOUND,  }, /* STUN   */
	{ 10, GF_CHAOS,  }, /* CHAOS   */
	{ 10, GF_FIRE,  }, /* ELEMENT   */
	{ 10, GF_CHAOS,  }, /* MUTATE   */
	{ 30, GF_HOLY_FIRE,  }, /* SMITE   */
	{ 10, GF_WATER,  }, /* DROWN   */
	{ 30, GF_NETHER,  }, /* KILL   */
	{ 10, GF_NETHER,  }, /* CURSE   */
	{ 10, GF_LITE,  }, /* PHOTO   */
	{ 10, GF_ACID,  }, /* MELT   */
	{ 60, GF_SHARDS,  }, /* BLEED   */
	{ 20, GF_REDEYE,  }, /* INSANITY   */
	{ 10, GF_MISSILE,  }, /* HUNGER   */

};


/*
 * The table of features' actions
 */
const byte feature_action_flags[FF_FLAG_MAX] =
{
	0, /* LOS */
	0, /* PROJECT */
	0, /* MOVE */
	0, /* PLACE */
	0, /* DROP */
	0, /* SECRET */
	0, /* NOTICE */
	0, /* REMEMBER */
	0, /* OPEN */
	0, /* CLOSE */
	FAF_CRASH_GLASS, /* BASH */
	0, /* SPIKE */
	FAF_DESTROY, /* DISARM */
	0, /* STORE */
	FAF_DESTROY | FAF_CRASH_GLASS, /* TUNNEL */
	0, /* MAY_HAVE_GOLD */
	0, /* HAS_GOLD */
	0, /* HAS_ITEM */
	0, /* DOOR */
	0, /* TRAP */
	0, /* STAIRS */
	0, /* GLYPH */
	0, /* LESS */
	0, /* MORE */
	0, /* RUN */
	0, /* FLOOR */
	0, /* WALL */
	0, /* PERMANENT */
	0, /* INNER */
	0, /* OUTER */
	0, /* SOLID */
	0, /* HIT_TRAP */

	0, /* BRIDGE */
	0, /* RIVER */
	0, /* LAKE */
	0, /* BRIDGED */
	0, /* COVERED */
	0, /* GLOW */
	0, /* ENSECRET */
	0, /* WATER */
	0, /* LAVA */
	0, /* SHALLOW */
	0, /* DEEP */
	0, /* FILLED */
	FAF_DESTROY | FAF_CRASH_GLASS, /* HURT_ROCK */
	0, /* HURT_FIRE */
	0, /* HURT_COLD */
	0, /* HURT_ACID */
	0, /* ICE */
	0, /* ACID */
	0, /* OIL */
	0, /* XXX04 */ //←PLATE
	0, /* CAN_CLIMB */
	0, /* CAN_FLY */
	0, /* CAN_SWIM */
	0, /* CAN_PASS */
	0, /* CAN_OOZE */
	0, /* CAN_DIG */
	0, /* HIDE_ITEM */
	0, /* HIDE_SNEAK */
	0, /* HIDE_SWIM */
	0, /* HIDE_DIG */
	0, /* KILL_HUGE */
	0, /* KILL_MOVE */

	0, /* PICK_TRAP */
	0, /* PICK_DOOR */
	0, /* ALLOC */
	0, /* CHEST */
	0, /* DROP_1D2 */
	0, /* DROP_2D2 */
	0, /* DROP_GOOD */
	0, /* DROP_GREAT */
	0, /* HURT_POIS */
	0, /* HURT_ELEC */
	0, /* HURT_WATER */
	0, /* HURT_BWATER */
	0, /* USE_FEAT */
	0, /* GET_FEAT */
	0, /* GROUND */
	0, /* OUTSIDE */
	0, /* EASY_HIDE */
	0, /* EASY_CLIMB */
	0, /* MUST_CLIMB */
	0, /* TREE */
	0, /* NEED_TREE */
	0, /* BLOOD */
	0, /* DUST */
	0, /* SLIME */
	0, /* PLANT */
	0, /* XXX2 */ //←SPIDER_NEST
	0, /* INSTANT */
	0, /* EXPLODE */
	0, /* TIMED */
	0, /* ERUPT */
	0, /* STRIKE */
	0, /* SPREAD */

	0, /* SPECIAL */
	FAF_DESTROY | FAF_NO_DROP | FAF_CRASH_GLASS, /* HURT_DISI */
	0, /* QUEST_ENTER */
	0, /* QUEST_EXIT */
	0, /* QUEST */
	0, /* SHAFT */
	0, /* MOUNTAIN */
	0, /* BLDG */
	0, /* MINOR_GLYPH */
	0, /* PATTERN */
	0, /* TOWN */
	0, /* ENTRANCE */
	0, /* MIRROR */
	0, /* UNPERM */
	0, /* TELEPORTABLE */
	0, /* CONVERT */
	0, /* GLASS */
};


/*
 * Define flags, effect type, name for dragon breath activation
 */
 /*:::ドラゴン鎧のブレス　その鎧が持つ耐性から一つランダムに選ばれる*/
 ///item res ドラゴン鎧のブレス
 ///mod131229 ドラゴン鎧のブレス　水と神聖追加　混乱のブレス削除
const dragonbreath_type dragonbreath_info[] = {
	{ TR_RES_ACID, GF_ACID, _("酸", "acid") },
	{ TR_RES_ELEC, GF_ELEC, _("電撃", "lightning") },
	{ TR_RES_FIRE, GF_FIRE, _("火炎", "fire") },
	{ TR_RES_COLD, GF_COLD, _("冷気", "cold") },
	{ TR_RES_POIS, GF_POIS, _("毒", "poison") },
	{ TR_RES_WATER, GF_WATER, _("水", "water") },
	{ TR_RES_HOLY, GF_HOLY_FIRE, _("破邪", "holy") },
	{ TR_RES_LITE, GF_LITE, _("閃光", "light") },
	{ TR_RES_DARK, GF_DARK, _("暗黒", "dark") },
	{ TR_RES_SHARDS, GF_SHARDS, _("破片", "shard") },
//	{ TR_RES_CONF, GF_CONFUSION, _("混乱", "confusion") },
	{ TR_RES_SOUND, GF_SOUND, _("轟音", "sound") },
//	{ TR_RES_NEXUS, GF_NEXUS, _("因果混乱", "nexus") },
	{ TR_RES_NETHER, GF_NETHER, _("地獄", "nether") },
	{ TR_RES_CHAOS, GF_CHAOS, _("カオス", "chaos") },
	{ TR_RES_DISEN, GF_DISENCHANT, _("劣化", "disenchant") },
	{ 0, 0, NULL }
};

/*
 * Define flags, levels, values of activations
 */
const activation_type activation_info[] =
{
	{ "SUNLIGHT", ACT_SUNLIGHT, 10, 250, {10, 0},
	  _("太陽光線", "beam of sunlight") },
	{ "BO_MISS_1", ACT_BO_MISS_1, 10, 250, {2, 0},
	  _("マジック・ミサイル(2d6)", "magic missile (2d6)") },
	{ "BA_POIS_1", ACT_BA_POIS_1, 10, 300, {4, 0},
	  _("悪臭雲(12)", "stinking cloud (12)") },
	{ "BO_ELEC_1", ACT_BO_ELEC_1, 20, 250, {5, 0},
	  _("サンダー・ボルト(4d8)", "lightning bolt (4d8)") },
	{ "BO_ACID_1", ACT_BO_ACID_1, 20, 250, {6, 0},
	  _("アシッド・ボルト(5d8)", "acid bolt (5d8)") },
	{ "BO_COLD_1", ACT_BO_COLD_1, 20, 250, {7, 0},
	  _("アイス・ボルト(6d8)", "frost bolt (6d8)") },
	{ "BO_FIRE_1", ACT_BO_FIRE_1, 20, 250, {8, 0},
	  _("ファイア・ボルト(9d8)", "fire bolt (9d8)") },
	{ "BA_COLD_1", ACT_BA_COLD_1, 30, 750, {6, 0},
	  _("アイス・ボール(48)", "ball of cold (48)") },
	{ "BA_FIRE_1", ACT_BA_FIRE_1, 30, 1000, {9, 0},
	  _("ファイア・ボール(72)", "ball of fire (72)") },
	{ "DRAIN_1", ACT_DRAIN_1, 30, 500, {12, 0},
	  _("窒息攻撃(100)", "a strangling attack (100)") },
	{ "BA_COLD_2", ACT_BA_COLD_2, 40, 1250, {12, 0},
	  _("アイス・ボール(100)", "ball of cold (100)") },
	{ "BA_ELEC_2", ACT_BA_ELEC_2, 40, 1500, {12, 0},
	  _("サンダー・ボール(100)", "ball of lightning (100)") },
	{ "BA_FIRE_2", ACT_BA_FIRE_2, 40, 1500, {15, 0},
	  _("巨大ファイア・ボール(120)", "large fire ball (120)") },
	{ "DRAIN_2", ACT_DRAIN_2, 40, 750, {15, 0},
	  _("生命力吸収(120)", "drain life (120)") },
	{ "VAMPIRE_1", ACT_VAMPIRE_1, 40, 1000, {20, 0},
	  _("吸血ドレイン(3*50)", "vampiric drain (3*50)") },
	{ "BO_MISS_2", ACT_BO_MISS_2, 40, 1000, {20, 0},
	  _("矢(150)", "arrows (150)") },
	{ "BA_FIRE_3", ACT_BA_FIRE_3, 60, 1750, {40, 0},
	  _("巨大ファイア・ボール(300)", "fire ball (300)") },
	{ "BA_COLD_3", ACT_BA_COLD_3, 70, 2500, {50, 0},
	  _("巨大アイス・ボール(400)", "ball of cold (400)") },
	{ "BA_ELEC_3", ACT_BA_ELEC_3, 70, 2500, {70, 0},
	  _("巨大サンダー・ボール(500)", "ball of lightning (500)") },
	{ "WHIRLWIND", ACT_WHIRLWIND, 50, 7500, {10, 0},
	  _("カマイタチ", "whirlwind attack") },
	{ "VAMPIRE_2", ACT_VAMPIRE_2, 50, 2500, {40, 0},
	  _("吸血ドレイン(3*100)", "vampiric drain (3*100)") },
	{ "CALL_CHAOS", ACT_CALL_CHAOS, 70, 5000, {35, 0},
	  _("混沌召来", "call chaos") },
	{ "ROCKET", ACT_ROCKET, 70, 5000, {20, 0},
	  _("ロケット(120+レベル)", "launch rocket (120+level)") },
	{ "DISP_EVIL", ACT_DISP_EVIL, 50, 4000, {50, 0},
	  _("邪悪退散(x5)", "dispel evil (x5)") },
	{ "BA_MISS_3", ACT_BA_MISS_3, 50, 1500, {50, 0},
	  _("エレメントのブレス(300)", "elemental breath (300)") },
	{ "DISP_GOOD", ACT_DISP_GOOD, 50, 3500, {50, 0},
	  _("善良退散(x5)", "dispel good (x5)") },
	{ "BO_MANA", ACT_BO_MANA, 40, 1500, {20, 0},
	  _("魔法の矢(150)", "a magical arrow (150)") },
	{ "BA_WATER", ACT_BA_WATER, 50, 2000, {25, 0},
	  _("ウォーター・ボール(200)", "water ball (200)") },
	{ "BA_STAR", ACT_BA_STAR, 50, 2200, {25, 0},
	  _("巨大スター・ボール(200)", "large star ball (200)") },
	{ "BA_DARK", ACT_BA_DARK, 50, 2200, {30, 0},
	  _("暗黒の嵐(250)", "darkness storm (250)") },
	{ "BA_MANA", ACT_BA_MANA, 70, 2500, {30, 0},
	  _("魔力の嵐(250)", "a mana storm (250)") },
	{ "PESTICIDE", ACT_PESTICIDE, 10, 500, {10, 0},
	  _("害虫の駆除", "dispel small life") },
	{ "BLINDING_LIGHT", ACT_BLINDING_LIGHT, 30, 5000, {40, 0},
	  _("眩しい光", "blinding light") },
	{ "BIZARRE", ACT_BIZARRE, 90, 10000, {50, 0},
	  _("信じ難いこと", "bizarre things") },
	{ "CAST_BA_STAR", ACT_CAST_BA_STAR, 70, 7500, {100, 0},
	  _("スター・ボール・ダスト(150)", "cast star balls (150)") },
	{ "BLADETURNER", ACT_BLADETURNER, 80, 20000, {80, 0},
	  _("エレメントのブレス(300), 士気高揚、祝福、耐性", "breathe elements (300), hero, bless, and resistance") },
	{ "BA_ACID_1", ACT_BA_ACID_1, 30, 1000, {12, 0},
	  _("アシッド・ボール(100)", "ball of acid (100)") },
	{ "BR_FIRE", ACT_BR_FIRE, 50, 5000, {-1, 0},
	  _("火炎のブレス (200)", "fire breath (200)") },
	{ "BR_COLD", ACT_BR_COLD, 50, 5000, {-1, 0},
	  _("冷気のブレス (200)", "cold breath (200)") },
	{ "BR_DRAGON", ACT_BR_DRAGON, 70, 10000, { 30, 0 },
	  "" /* built by item_activation_dragon_breath() */ },

	{ "CONFUSE", ACT_CONFUSE, 10, 500, {10, 0},
	  _("パニック・モンスター", "confuse monster") },
	{ "SLEEP", ACT_SLEEP, 10, 750, {15, 0},
	  _("周囲のモンスターを眠らせる", "sleep nearby monsters") },
	{ "QUAKE", ACT_QUAKE, 30, 600, {20, 0},
	  _("地震", "earthquake") },
	{ "TERROR", ACT_TERROR, 20, 2500, {-1, 0},
	  _("恐慌", "terror") },
	{ "TELE_AWAY", ACT_TELE_AWAY, 20, 2000, {15, 0},
	  _("テレポート・アウェイ", "teleport away") },
	{ "BANISH_EVIL", ACT_BANISH_EVIL, 40, 2000, {250, 0},
	  _("邪悪消滅", "banish evil") },
	{ "GENOCIDE", ACT_GENOCIDE, 50, 10000, {500, 0},
	  _("抹殺", "banish") },
	{ "MASS_GENO", ACT_MASS_GENO, 50, 10000, {1000, 0},
	  _("周辺抹殺", "banish nearby") },
	{ "SCARE_AREA", ACT_SCARE_AREA, 20, 2500, {20, 0},
	  _("モンスター恐慌", "frighten monsters") },
	{ "AGGRAVATE", ACT_AGGRAVATE, 0, 100, {0, 0},
	  _("モンスターを怒らせる", "aggravate monsters") },

	{ "CHARM_ANIMAL", ACT_CHARM_ANIMAL, 40, 7500, {200, 0},
	  _("動物魅了", "charm animal") },
	{ "CHARM_UNDEAD", ACT_CHARM_UNDEAD, 40, 10000, {333, 0},
	  _("アンデッド従属", "enslave undead") },
	{ "CHARM_OTHER", ACT_CHARM_OTHER, 40, 10000, {400, 0},
	  _("モンスター魅了", "charm monster") },
	{ "CHARM_ANIMALS", ACT_CHARM_ANIMALS, 40, 12500, {500, 0},
	  _("動物友和", "animal friendship") },
	{ "CHARM_OTHERS", ACT_CHARM_OTHERS, 40, 17500, {750, 0},
	  _("周辺魅了", "mass charm") },
	{ "SUMMON_ANIMAL", ACT_SUMMON_ANIMAL, 50, 10000, {200, 300},
	  _("動物召喚", "summon animal") },
	{ "SUMMON_PHANTOM", ACT_SUMMON_PHANTOM, 50, 12000, {200, 200},
	  _("幻霊召喚", "summon phantasmal servant") },
	{ "SUMMON_ELEMENTAL", ACT_SUMMON_ELEMENTAL, 50, 15000, {750, 0},
	  _("エレメンタル召喚", "summon elemental") },
	{ "SUMMON_DEMON", ACT_SUMMON_DEMON, 50, 20000, {666, 0},
	  _("悪魔召喚", "summon demon") },
	{ "SUMMON_UNDEAD", ACT_SUMMON_UNDEAD, 50, 20000, {666, 0},
	  _("アンデッド召喚", "summon undead") },
	{ "SUMMON_HOUND", ACT_SUMMON_HOUND, 50, 15000, {300, 0},
	  _("ハウンド召喚", "summon hound") },
	{ "SUMMON_DAWN", ACT_SUMMON_DAWN, 50, 15000, {500, 0},
	  _("暁の師団召喚", "summon the Legion of the Dawn") },
	{ "SUMMON_OCTOPUS", ACT_SUMMON_OCTOPUS, 50, 15000, {300, 0},
	  _("蛸の大群召喚", "summon octopus") },
	{ "SUMMON_MONSTERS", ACT_SUMMON_MONSTERS, 50, 20000, {25, 25},
	  _("モンスター複数召喚", "summon monsters") },

	{ "CHOIR_SINGS", ACT_CHOIR_SINGS, 60, 20000, {300, 0},
	  _("回復(777)、癒し、士気高揚", "heal 777 hit points, curing and heroism") },
	{ "CURE_LW", ACT_CURE_LW, 10, 500, {10, 0},
	  _("恐怖除去/体力回復(30)", "remove fear and heal 30 hp") },
	{ "CURE_MW", ACT_CURE_MW, 20, 750, {3, 3},
	  _("傷回復(4d8)", "heal 4d8 and wounds") },
	{ "CURE_POISON", ACT_CURE_POISON, 10, 1000, {5, 0},
	  _("恐怖除去/毒消し", "remove fear and cure poison") },
	{ "REST_LIFE", ACT_REST_LIFE, 40, 7500, {450, 0},
	  _("経験値復活", "restore life levels") },
	{ "REST_ALL", ACT_REST_ALL, 30, 15000, {750, 0},
	  _("全ステータスと経験値復活", "restore stats and life levels") },
	{ "CURE_700", ACT_CURE_700, 40, 10000, {250, 0},
	  _("体力回復(700)", "heal 700 hit points") },
	{ "CURE_1000", ACT_CURE_1000, 50, 15000, {888, 0},
	  _("体力回復(1000)", "heal 1000 hit points") },
	{ "CURING", ACT_CURING, 30, 5000, {100, 0},
	  _("癒し", "curing") },
	{ "CURE_MANA_FULL", ACT_CURE_MANA_FULL, 60, 20000, {777, 0},
	  _("魔力復活", "restore mana") },

	{ "ESP", ACT_ESP, 30, 1500, {100, 0},
	  _("テレパシー(期間 25+d30)", "telepathy (dur 25+d30)") },
	{ "BERSERK", ACT_BERSERK, 10, 800, {75, 0},
	  _("狂戦士化(25+d25ターン)", "berserk (25+d25 turns)") },
	{ "PROT_EVIL", ACT_PROT_EVIL, 30, 5000, {100, 0},
	  _("対邪悪結界(期間 3*レベル+d25)", "protect evil (dur level*3 + d25)") },
	{ "RESIST_ALL", ACT_RESIST_ALL, 30, 5000, {60, 60},
	  _("全耐性(期間 20+d20)", "resist elements (dur 20+d20)") },
	{ "SPEED", ACT_SPEED, 40, 15000, {250, 0},
	  _("加速(期間 20+d20)", "speed (dur 20+d20)") },
	{ "XTRA_SPEED", ACT_XTRA_SPEED, 40, 25000, {200, 200},
	  _("加速(期間 75+d75)", "speed (dur 75+d75)") },
	{ "WRAITH", ACT_WRAITH, 90, 25000, {1000, 0},
	  _("幽体化(期間 (レベル/2)+d(レベル/2))", "wraith form (dur level/2 + d(level/2))") },
	{ "INVULN", ACT_INVULN, 90, 25000, {1000, 0},
	  _("無敵化(期間 8+d8)", "invulnerability (dur 8+d8)") },
	{ "HELO", ACT_HELO, 10, 500, {30, 30},
	  _("士気高揚", "heroism") },
	{ "HELO_SPEED", ACT_HELO_SPEED, 30, 20000, {100, 200},
	  _("士気高揚, スピード(期間 50+d50ターン)", "hero and +10 to speed (50)") },
	{ "RESIST_ACID", ACT_RESIST_ACID, 20, 2000, {40, 40},
	  _("酸への耐性(期間 20+d20)", "resist acid (dur 20+d20)") },
	{ "RESIST_FIRE", ACT_RESIST_FIRE, 20, 2000, {40, 40},
	  _("火炎への耐性(期間 20+d20)", "resist fire (dur 20+d20)") },
	{ "RESIST_COLD", ACT_RESIST_COLD, 20, 2000, {40, 40},
	  _("冷気への耐性(期間 20+d20)", "resist cold (dur 20+d20)") },
	{ "RESIST_ELEC", ACT_RESIST_ELEC, 20, 2000, {40, 40},
	  _("電撃への耐性(期間 20+d20)", "resist elec (dur 20+d20)") },
	{ "RESIST_POIS", ACT_RESIST_POIS, 20, 2000, {40, 40},
	  _("毒への耐性(期間 20+d20)", "resist poison (dur 20+d20)") },

	{ "LIGHT", ACT_LIGHT, 10, 150, {10, 10},
	  _("イルミネーション", "light area (dam 2d15)") },
	{ "MAP_LIGHT", ACT_MAP_LIGHT, 30, 500, {50, 50},
	  _("魔法の地図と光", "light (dam 2d15) & map area") },
	{ "DETECT_ALL", ACT_DETECT_ALL, 30, 1000, {55, 55},
	  _("全感知", "detection") },
	{ "DETECT_XTRA", ACT_DETECT_XTRA, 50, 12500, {100, 0},
	  _("全感知、探索、*鑑定*", "detection, probing and identify true") },
	{ "ID_FULL", ACT_ID_FULL, 50, 10000, {75, 0},
	  _("*鑑定*", "identify true") },
	{ "ID_PLAIN", ACT_ID_PLAIN, 20, 1250, {10, 0},
	  _("鑑定", "identify spell") },
	{ "RUNE_EXPLO", ACT_RUNE_EXPLO, 40, 4000, {0, 0},
	  _("爆発のルーン(MP20使用)", "explosive rune") },
	{ "RUNE_PROT", ACT_RUNE_PROT, 60, 10000, {400, 0},
	  _("守りのルーン", "rune of protection") },
	{ "SATIATE", ACT_SATIATE, 10, 2000, {100, 0},
	  _("空腹充足", "satisfy hunger") },
	{ "DEST_DOOR", ACT_DEST_DOOR, 10, 100, {10, 0},
	  _("ドア破壊", "destroy doors") },
	{ "STONE_MUD", ACT_STONE_MUD, 20, 1000, {3, 0},
	  _("岩石溶解", "stone to mud") },
	{ "RECHARGE", ACT_RECHARGE, 30, 1000, {70, 0},
	  _("魔力充填", "recharging") },
	{ "ALCHEMY", ACT_ALCHEMY, 50, 10000, {50, 0}, //v1.1.48 充填ターン数500→50
	  _("錬金術", "alchemy") },
	{ "DIM_DOOR", ACT_DIM_DOOR, 50, 10000, {100, 0},
	  _("次元の扉", "dimension door") },
	{ "TELEPORT", ACT_TELEPORT, 10, 2000, {25, 0},
	  _("テレポート", "teleport") },
	{ "RECALL", ACT_RECALL, 30, 7500, {200, 0},
	  _("帰還の詔", "word of recall") },
	{ "JUDGE", ACT_JUDGE, 90, 50000, {20, 20},
	  _("体力と引き替えに千里眼と帰還", "clairvoyance and recall, draining you") },
	{ "TELEKINESIS", ACT_TELEKINESIS, 20, 5500, {25, 25},
	  _("物体を引き寄せる(重量25kgまで)", "telekinesis (up to 25 kg)") },
	{ "DETECT_UNIQUE", ACT_DETECT_UNIQUE, 40, 10000, {200, 0},
	  _("この階にいるユニークモンスターを表示", "list of the uniques on the level") },
	{ "ESCAPE", ACT_ESCAPE, 10, 3000, {35, 0},
	  _("逃走", "a getaway") },
	{ "DISP_CURSE_XTRA", ACT_DISP_CURSE_XTRA, 40, 30000, {0, 0},
	  _("*解呪*と調査", "dispel curse and probing") },
	{ "BRAND_FIRE_BOLTS", ACT_BRAND_FIRE_BOLTS, 40, 20000, {999, 0},
	  _("刃先のファイア・ボルト", "fire branding of bolts") },
	{ "RECHARGE_XTRA", ACT_RECHARGE_XTRA, 70, 30000, {200, 0},
	  _("魔力充填", "recharge item") },
	{ "LORE", ACT_LORE, 10, 30000, {0, 0},
	  _("危険を伴う鑑定", "perilous identify") },
	{ "SHIKOFUMI", ACT_SHIKOFUMI, 10, 10000, {100, 100},
	  _("四股踏み", "shiko") },
	{ "PHASE_DOOR", ACT_PHASE_DOOR, 10, 1500, {10, 0},
	  _("ショート・テレポート", "blink") },
	{ "DETECT_ALL_MONS", ACT_DETECT_ALL_MONS, 30, 3000, {150, 0},
	  _("全モンスター感知", "detect all monsters") },
	{ "ULTIMATE_RESIST", ACT_ULTIMATE_RESIST, 90, 20000, {777, 0},
	  _("士気高揚、祝福、究極の耐性", "hero, bless, and ultimate resistance") },

	{ "CAST_OFF", ACT_CAST_OFF, 30, 15000, {100, 0},
	  _("脱衣と小宇宙燃焼", "cast it off and cosmic heroism") },
	{ "FISHING", ACT_FISHING, 0, 100, {0, 0},
	  _("釣りをする", "fishing") },
	{ "INROU", ACT_INROU, 40, 15000, {150, 150},
	  _("例のアレ", "reveal your identity") },
	{ "MURAMASA", ACT_MURAMASA, 0, 0, {-1, 0},
	  _("腕力の上昇", "increase STR") },
	{ "BLOODY_MOON", ACT_BLOODY_MOON, 0, 0, {3333, 0},
	  _("属性変更", "change element") },
	{ "CRIMSON", ACT_CRIMSON, 0, 50000, {5, 0},
	  _("ファイア！", "fire!") },
	{ "NERUNERUNERUNE", ACT_NERUNERUNERUNE, 0, 2000, {0, 0},
	  _("危険を伴う調合", "dangerous chemistry") },
	{ "ALTER_REALITY", ACT_ALTER_REALITY, 0, 5000, {300, 0},
	  _("現実変容", "alter reality") },

	{ "KOGASA_LASER", ACT_KOGASA_LASER, 0, 100, {4, 0},
	  _("唐傘レーザー", "umbrella laser") },
	{ "KOGASA_LASER", ACT_KOGASA_ROCKET, 0, 10000, {15, 0},
	  _("唐傘ロケット", "umbrella rocket") },
	{ "HYPER_BERSERK", ACT_HYPER_BERSERK, 0, 1000, {0, 0},
	  _("危険を伴う狂戦士化", "dangerous berserk") },
	{ "DRINK", ACT_DRINK, 0, 100, {0, 0},
	  _("酒を飲む", "drink sake") },
	{ "ROBERTA", ACT_ROBERTA, 30, 5000, {200, 0},
	  _("視界内爆撃+離脱(200)", "line of sight attack (200) + getaway") },
	{ "WALTER", ACT_WALTER, 30, 5000, {200, 0},
	  _("視界内攻撃(200)", "line of sight attack (200)") },
	{ "DETECT_ITEM", ACT_DETECT_ITEM, 10, 200, {10, 0},
	  _("ダウジング", "dowsing") },
	{ "SANAGI", ACT_SANAGI, 10, 2000, {0, 0},
	  _("士気高揚と騒音", "heroism and noise") },
	{ "DER_FREISCHUTZ", ACT_DER_FREISCHUTZ, 0, 50000, {10, 0},
	  _("魔弾の射手", "fire magic bullet") },
	{ "GOKASHITIKIN", ACT_GOKASHITIKIN, 0, 5000, {0, 0},
	  _("衝撃波(ダメージ150 MP40使用)", "shockwave (150 dam, costs 40 MP)") },
	{ "SUMMON_FOUNTAIN", ACT_SUMMON_FOUNTAIN, 70, 10000, {30, 30},
	  _("弘法水湧出", "water spring") },

	{ "TORNADO", ACT_TORNADO, 50, 7500, {25, 0},
	  _("竜巻(200)", "tornado (200)") },

	{ "TRAPEZOHEDRON", ACT_TRAPEZOHEDRON, 80, 10000, {0, 0},
	  _("***危険***を伴う啓蒙", "***dangerous*** enlightenment") },

	{ "DETECT_ARTIFACT", ACT_DETECT_ARTIFACT, 80, 10000, {100, 0},
	  _("伝説の品感知", "detect artifact") },

	{ "LUNATIC_TIME", ACT_LUNATIC_TIME, 0, 5000, {0, 0},
	  _("ルナティックタイム", "lunatic time") },
	{ "SUMMON_GHOSTS", ACT_SUMMON_GHOSTS, 40, 6000, {50, 0},
	  _("幽霊寄せ", "summon ghosts") },
	{ "TRANSPORT_ITEM", ACT_TRANSPORT_ITEM, 80, 10000, {50, 100},
	  _("アイテム転送", "transport item") },
	{ "TOYOHIME", ACT_TOYOHIME, 70, 10000, {10, 0},
	  _("浄化の風", "purification storm") },
	{ "MIGHTY_THROW", ACT_MIGHTY_THROW, 40, 5000, {0, 0},
	  _("強力投擲(x4)", "mighty throw (x4)") },

	{ "FINAL_STRIKE", ACT_FINAL_STRIKE, 70, 1000, {0, 0},
	  _("ファイナルストライク", "Final Strike") },

	{ "GUN_VARIABLE", ACT_GUN_VARIABLE, 10, 10, {0, 0},
	  _("特殊可変射撃(このメッセージが出たらバグ)", "special variable shot (THIS MESSAGE SHOULD NOT APPEAR)") },


	  //銃の発動ダメージの実体処理はcmd2.cのdo_cmd_fire_gun_aux()なので注意
	{ "YAKUZA_GUN", ACT_YAKUZA_GUN, 50, 3000, {5, 0},
	  _("乱射((1d20)*20)", "random shooting ((1d20)*20)") },
	{ "BFG9000", ACT_BFG9000, 90, 30000, {6, 0},
	  _("無属性ロケット(8d100+800)", "non-elemental rocket (8d100+800)") },
	{ "BAROQUE", ACT_BAROQUE, 60, 10000, {7, 0},
	  _("消滅属性ロケット(効力500)", "banishment rocket (power 500)") },

	{ "HARKONNEN2", ACT_HARKONNEN2, 100, 50000, {16, 0},
	  _("「ウラディーミル」", "'Vladimir'") },
	{ "SHIOMITSUTAMA", ACT_SHIOMITSUTAMA, 100, 50000, {10, 10},
	  _("渦潮攻撃(ダメージ100+1d100)", "whirlpool attack (damage 100+1d100)") },
	{ "DAZZLE", ACT_DAZZLE, 40, 2500, {10, 10},
	  _("幻惑", "dazzle") },
	{ "MID_RANGE_ATTACK", ACT_MID_RANGE_ATTACK, 50, 5000, {0, 0},
	  _("武器を伸ばす(ダメージ100+1d100 MP30使用)", "extend weapon (damage 100+1d100 costs 30 MP)") },
	{ "BO_INACT", ACT_BO_INACT, 20, 3000, {10, 0},
	  _("遅鈍のボルト(4d6)", "bolt of inertia (4d6)") },

	  { "MATARA", ACT_MATARA, 50, 10000, {100, 0},
	  _("鼓を鳴らす", "play the drum") },
	  { "HYAKKIYAKOU", ACT_HYAKKIYAKOU, 30, 10000, {10, 10},
	  _("百鬼夜行", "hundred demon night parade") },

	  { "SWORD_DANCE", ACT_SWORD_DANCE, 50, 10000,{ 0, 16 },
		  _("剣の舞い", "sword dance") },
	  { "SWORD_DANCE", ACT_BA_LITE, 50, 5000,{ 30, 0 },
		_("スター・バースト", "star burst") },
		{ "ACCESS_HOME_ONLY_ARROW", ACT_ACCESS_HOME_ONLY_ARROW, 30, 5000,{ 50, 50 },
		_("自宅アクセス(矢専用)", "access your house (only for arrows)") },
		{ "SUMMON_HANIWA", ACT_SUMMON_HANIWA, 50, 15000,{ 250, 0 },
			_("ハニワ軍団召喚", "summon haniwa army") },
		{ "CURE_500", ACT_CURE_500, 35, 7000,{ 100, 0 },
			_("体力回復(500)", "heal 500 hit points") },

		{ "TIM_ADD_DICES", ACT_TIM_ADD_DICES, 60, 10000,{ 20, 20 },
			_("一時ダイス増加", "temporary dice boost") },
		{ "PSY_SPEAR", ACT_PSY_SPEAR, 40, 7000,{ 30, 0 },
		  _("光の剣(150+1d150)", "Psycho-Spear (150+1d150)") },
		  { "LONG_RANGE_ATTACK", ACT_LONG_RANGE_ATTACK, 50, 15000,{ 10, 10 },
		  _("遠距離攻撃", "attack from distance") },
		  { "HIT_AND_AWAY", ACT_HIT_AND_AWAY, 50, 15000,{ 10, 20 },
		  _("ヒットアンドアウェイ", "hit and away") },
		  { "SAINT_STAR_ARROW", ACT_SAINT_STAR_ARROW, 80, 10000,{ 50, 0 },
		  _("セイントスターアロー", "saint star arrow") },
		  { "TIM_SUPER_STEALTH", ACT_TIM_SUPER_STEALTH, 100, 20000,{ 25, 25 },
		  _("超隠密", "superstealth") },

		  { "DUAL_CAST", ACT_DUAL_CAST, 100, 30000,{ 25, 0 },
		  _("連続魔", "dualcasting") },

		  { "CAPTURE", ACT_ART_CAPTURE, 40, 10000,{ 0, 0 },
		_("モンスターを捕える、又は解放する", "capture or release monster") },

		{ "TRANSFORM", ACT_TRANSFORM, 75, 10000,{ 100, 0 },
		  _("変身(100ターン)", "transformation (100 turns)") },

		  { "MAKE_MAGMA", ACT_MAKE_MAGMA, 70, 5000,{ 50, 50 },
		  _("巨大ファイア・ボール(300)と溶岩生成", "ball of fire (300) + create lava") },
		  { "MAKE_BLIZZARD", ACT_MAKE_BLIZZARD, 70, 5000,{ 50, 50 },
		  _("巨大アイス・ボール(300)と魔法吹雪", "ball of cold (300) + magical blizzard") },

		  { "DIG_OIL", ACT_DIG_OIL, 50, 5000,{ 20, 20 },
		_("石油採掘", "digging for oil") },

		{ "BLAST_MISSILES", ACT_BLAST_MISSILES, 50, 5000,{ 10, 20 },
		  _("マジックミサイル連射", "magic missile barrage") },

		  { "TRANSPORTATION_TRAP", ACT_TRANSPORTATION_TRAP, 40, 5000,{ 0, 0 },
		  _("移送の罠", "transportation trap") },

		  { "MUGENSYUKU", ACT_MUGENSYUKU, 80, 30000,{ 50, 0 },
		  _("無間縮結界", "infinite shrinking barrier") },

		  { "MONOMANE", ACT_MONOMANE, 60, 20000,{ 25, 25 },
		  _("ものまね", "imitation") },

	{ NULL, 0, 0, 0, {0, 0},
	  "" }
};

///mod140222 p_ptr->stat_ind[A_???]を入れて何らかに使うための列 0-47
const int adj_general[STAT_HYPERMAX-2] =
{
	1,1,1,1,2,2,2,//3-9
	3,3,3,4,4,4,5,5,6,6,//10-19
	7,7,8,8,9,9,10,10,11,12,//20-29
	13,14,15,16,18,20,22,24,26,28,//30-39
	30,32,34,36,38,40,42,44,46,48,50//40-50

};


//特産物テーブル
//{ダンジョンidx,Tval,Sval,最低階層,最大階層,基本発見率,最大生成数}
const struct souvenir_type souvenir_table[] =
{

	//紅魔館深部 30-50 魔法書三冊目や魔道具など色々
	{DUNGEON_KOUMA,TV_STAFF,SV_STAFF_TELEPORTATION,32,45,100,1},
	{DUNGEON_KOUMA,TV_STAFF,SV_STAFF_REMOVE_CURSE,32,40,140,1},
	{DUNGEON_KOUMA,TV_STAFF,SV_STAFF_MAPPING,32,40,100,1},
	{DUNGEON_KOUMA,TV_STAFF,SV_STAFF_CURING,32,45,70,1},
	{DUNGEON_KOUMA,TV_STAFF,SV_STAFF_SPEED,36,50,80,1},
	{DUNGEON_KOUMA,TV_STAFF,SV_STAFF_PROBING,36,48,90,1},

	{DUNGEON_KOUMA,TV_WAND,SV_WAND_TELEPORT_AWAY,32,48,100,1},
	{DUNGEON_KOUMA,TV_WAND,SV_WAND_DISARMING,32,48,100,1},
	{DUNGEON_KOUMA,TV_WAND,SV_WAND_STONE_TO_MUD,32,48,100,1},
	{DUNGEON_KOUMA,TV_WAND,SV_WAND_DRAIN_LIFE ,44,48,30,1},
	{DUNGEON_KOUMA,TV_WAND,SV_WAND_ACID_BALL ,40,45,25,1},
	{DUNGEON_KOUMA,TV_WAND,SV_WAND_ELEC_BALL ,40,45,25,1},
	{DUNGEON_KOUMA,TV_WAND,SV_WAND_FIRE_BALL ,40,45,25,1},
	{DUNGEON_KOUMA,TV_WAND,SV_WAND_COLD_BALL ,40,45,25,1},
	{DUNGEON_KOUMA,TV_ROD,SV_ROD_DETECTION ,45,50,10,1},
	{DUNGEON_KOUMA,TV_ROD,SV_ROD_IDENTIFY ,45,50,10,1},
	{DUNGEON_KOUMA,TV_ROD,SV_ROD_SPEED ,47,50,5,1},
	{DUNGEON_KOUMA,TV_ROD,SV_ROD_ILLUMINATION ,32,40,50,1},
	{DUNGEON_KOUMA,TV_SCROLL,SV_SCROLL_ACQUIREMENT ,48,50,3,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_FREE_ACTION,30,36,70,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_RES_FEAR,30,36,70,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_STR,32,50,30,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_DEX,32,50,30,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_CON,32,50,30,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_PROTECTION,32,50,30,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_ELEC,40,50,20,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_ACID,40,50,20,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_FLAMES,40,50,20,1},
	{DUNGEON_KOUMA,TV_RING,SV_RING_ICE,40,50,20,1},
	{DUNGEON_KOUMA,TV_LITE,SV_LITE_FEANOR,30,45,30,1},
	{DUNGEON_KOUMA,TV_RIBBON,SV_RIBBON,32,50,50,1},
	{DUNGEON_KOUMA,TV_AMULET,SV_AMULET_CHARISMA,48,50,10,1},
	{DUNGEON_KOUMA,TV_BOOK_ELEMENT,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_FORESEE,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_ENCHANT,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_SUMMONS,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_MYSTIC ,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_LIFE   ,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_PUNISH ,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_NATURE ,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_TRANSFORM,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_DARKNESS,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_NECROMANCY,2,48,50,50,1},
	{DUNGEON_KOUMA,TV_BOOK_CHAOS	,2,48,50,50,1},

	//竜窟 60-72ドラゴン素材や宝石
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_DRAGONSCALE,62,72,20,3},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_DRAGONNAIL,65,72,10,1},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_GARNET,	62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_AMETHYST,	62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_AQUAMARINE,62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_MOONSTONE,	62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_PERIDOT,	62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_OPAL,	62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_TOPAZ,	62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_LAPISLAZULI,62,72,100,2},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_EMERALD ,66,72,30,1},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_RUBY ,66,72,30,1},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_SAPPHIRE ,66,72,30,1},
	{DUNGEON_DRAGON,TV_MATERIAL	,SV_MATERIAL_DIAMOND ,70,72,10,1},

	//玄武の沢　10-20 京丸牡丹とヒカリゴケ
	//氷の鱗追加
	{DUNGEON_GENBU,TV_MATERIAL	,SV_MATERIAL_HIKARIGOKE ,12,20,250,3},
	{DUNGEON_GENBU,TV_MATERIAL	,SV_MATERIAL_HEMATITE ,17,20,150,6},
	{DUNGEON_GENBU,TV_MATERIAL	,SV_MATERIAL_ICESCALE 	 ,19,20,20,3},

	//地獄谷　35-50 水銀鉱石と砒素鉱石と石桜
	{DUNGEON_ZIGOKUDANI,TV_MATERIAL	,SV_MATERIAL_ARSENIC  ,37,50,100,4},
	{DUNGEON_ZIGOKUDANI,TV_MATERIAL	,SV_MATERIAL_MERCURY  ,45,50,50,3},
	{DUNGEON_ZIGOKUDANI,TV_MATERIAL	,SV_MATERIAL_ISHIZAKURA  ,37,50,70,3},

	//無縁塚　40-50 色々　
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_MAGNETITE	 ,42,50,100,3},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_MITHRIL 	 ,42,50,30,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_ADAMANTITE  ,42,50,20,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_GELSEMIUM 	 ,42,50,50,3},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_GARNET 	 ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_AMETHYST 	 ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_AQUAMARINE  ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_MOONSTONE 	 ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_PERIDOT  	 ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_OPAL  	 ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_TOPAZ   	 ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_LAPISLAZULI ,42,50,100,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_EMERALD  	 ,45,50,10,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_RUBY   	 ,45,50,10,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_SAPPHIRE    ,45,50,10,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_DRAGONSCALE ,45,50, 5,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_METEORICIRON,48,50, 1,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_DRAGONNAIL  ,49,50, 2,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_HIHIIROKANE ,50,50, 1,1}, //weird_luck()を通る必要がある
	{DUNGEON_MUEN,TV_SOUVENIR	,SV_SOUVENIR_KAPPA_5	,50,50,1,1},
	{DUNGEON_MUEN,TV_SOUVENIR	,SV_SOUVENIR_PRISM		,45,50,5,1},
	{DUNGEON_MUEN,TV_SOUVENIR	,SV_SOUVENIR_KAPPA_ARM	,48,50,2,1},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_ICESCALE 	 ,42,50,20,2},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_TAKAKUSAGORI ,43,50,40,3},
	{DUNGEON_MUEN,TV_MATERIAL	,SV_MATERIAL_IZANAGIOBJECT,48,50, 2,1},

	//旧地獄　石桜、イザナギオブジェクト
	{DUNGEON_EX_HELL,TV_MATERIAL	,SV_MATERIAL_ISHIZAKURA		,41,45,30,3},
	{DUNGEON_EX_HELL,TV_MATERIAL	,SV_MATERIAL_IZANAGIOBJECT  ,46,50, 5,1},

	//太子廟　1-30宝石(非レア)
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_GARNET 	 ,5,30,50,1},
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_AMETHYST 	 ,5,30,50,1},
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_AQUAMARINE  ,5,30,50,1},
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_MOONSTONE 	 ,5,30,50,1},
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_PERIDOT  	 ,5,30,50,1},
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_OPAL  		 ,5,30,50,1},
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_TOPAZ   	 ,5,30,50,1},
	{DUNGEON_TAISHI,TV_MATERIAL	,SV_MATERIAL_LAPISLAZULI ,5,30,50,1},

	//魔法の森深部　24-36キノコや草など
	{DUNGEON_FOREST,TV_MATERIAL	,SV_MATERIAL_GELSEMIUM ,27,32,70,1},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_CURE_POISON ,25,32,200,5},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_CURE_BLINDNESS  ,25,32,100,5},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_CURE_CONFUSION  ,25,32,100,5},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_CURE_PARANOIA  ,25,32,100,5},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_CURE_SERIOUS   ,25,32,100,6},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_RESTORING    ,33,36,30,2},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_MANA       ,28,36,50,7},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_BERSERK     ,27,36,40,5},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_POISON		,25,30,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_BLINDNESS  ,25,30,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_PARANOIA   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_CONFUSION  ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_HALLUCINATION   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_PARALYSIS  ,25,30,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_WEAKNESS   ,25,30,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_SICKNESS   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_STUPIDITY  ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_NAIVETY   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_UNHEALTH   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_DISEASE   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_RESTORE_STR   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_RESTORE_CON   ,25,32,50,3},
	{DUNGEON_FOREST,TV_MATERIAL	,SV_MATERIAL_TAKAKUSAGORI ,30,32,15,3},

	{ DUNGEON_FOREST,TV_MUSHROOM	,SV_MUSHROOM_PUFFBALL      ,25,36,100,4 },
	{ DUNGEON_FOREST,TV_FOOD	,SV_FOOD_MAGIC_WATERMELON  ,24,32,120,3 },
	{ DUNGEON_FOREST,TV_FOOD	,SV_FOOD_DATURA  ,24,28,80,2 },
	{ DUNGEON_FOREST,TV_FOOD	,SV_FOOD_STRANGE_BEAN  ,27,32,60,2 },


	//夢の世界 30-70

	{DUNGEON_DREAM_WORLD,TV_MATERIAL	,SV_MATERIAL_NIGHTMARE_FRAGMENT,35,70,30,3},
	{DUNGEON_DREAM_WORLD,TV_MATERIAL	,SV_MATERIAL_HOPE_FRAGMENT,55,70,5,1},

	//地獄
	{ DUNGEON_HELL,TV_MATERIAL	,SV_MATERIAL_SKULL  ,40,80,200,8 },

	//虹龍洞 狭いので生成確率が普通のダンジョンの1/9に下がるはず
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_HIKARIGOKE  ,30,40,800,5 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_HEMATITE	 ,41,50,500,8 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_MAGNETITE	 ,41,50,400,8 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_ARSENIC	 ,41,50,200,7 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_MERCURY	 ,41,50,100,7 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_MITHRIL	 ,51,60,80,5 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_ADAMANTITE	 ,51,60,60,5 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_RYUUZYU	 ,61,65,20,3 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_IZANAGIOBJECT,61,65,5,1 },
	{ DUNGEON_KOURYUU,TV_MATERIAL	,SV_MATERIAL_HIHIIROKANE ,65,65,1,1 },//weird_luck()を通る必要がある

	//浅間浄穢山
	{ DUNGEON_ASAMA,TV_MATERIAL	,SV_MATERIAL_SAZAREISHI		,50,55,10,1 },


	//鉄獄
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_MAGNETITE	 ,10,50,50,3},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_MITHRIL 	 ,40,90,20,3},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_ADAMANTITE  ,55,100,15,3},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_DRAGONSCALE ,60,100,15,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_DRAGONNAIL  ,75,100,5,1},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_GARNET,	30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_AMETHYST,	30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_AQUAMARINE,30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_MOONSTONE,	30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_PERIDOT,	30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_OPAL,	30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_TOPAZ,	30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_LAPISLAZULI,30,70,50,2},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_EMERALD 	,65,100,10,1},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_RUBY	,65,100,10,1},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_SAPPHIRE	,65,100,10,1},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_DIAMOND 	,80,100,5,1},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_METEORICIRON,85,100,2,1},
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_HIHIIROKANE ,90,100,3,1}, //weird_luck()を通る必要がある
	{DUNGEON_ANGBAND,TV_MATERIAL	,SV_MATERIAL_IZANAGIOBJECT,50,100, 2,1},

	///mod160220 鉄獄あるいは混沌の領域でアイテムカードが手に入る。ただしEXTRAモード以外では無効。
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,500,1},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,300,1},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,240,1},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,160,1},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,80,1},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,40,1},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,20,2},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,10,2},
	{DUNGEON_ANGBAND,TV_ITEMCARD	,SV_ITEMCARD,1,100,5,3},
	{DUNGEON_CHAOS	,TV_ITEMCARD	,SV_ITEMCARD,101,127,200,1},
	{DUNGEON_CHAOS	,TV_ITEMCARD	,SV_ITEMCARD,101,127,100,1},
	{DUNGEON_CHAOS	,TV_ITEMCARD	,SV_ITEMCARD,101,127,50,1},
	{DUNGEON_CHAOS	,TV_ITEMCARD	,SV_ITEMCARD,101,127,30,1},
	{DUNGEON_CHAOS	,TV_ITEMCARD	,SV_ITEMCARD,101,127,20,1},
	{DUNGEON_CHAOS	,TV_ITEMCARD	,SV_ITEMCARD,101,127,10,2},
	{DUNGEON_CHAOS	,TV_ITEMCARD	,SV_ITEMCARD,101,127,5,3},


	{0,0,0,0,0,0,0} //終端用dummy
};



struct machine_type machine_table[MAX_MACHINE] =
{
	{ 20,TV_SOFTDRINK,SV_DRINK_WATER,30,0,0}, //水鉄砲
	{ 30,TV_FLASK,SV_FLASK_OIL,3,0,30}, //尻子器
	{ 40,0,0,20,0,0}, //閃光弾
	{ 45,TV_FLASK,SV_FLASK_BATTERY,20,0,20}, //ドリルアーム
	{ 50,TV_FLASK,SV_FLASK_OIL,1,100,0}, //火炎放射器
	{ 50,TV_FLASK,SV_FLASK_BATTERY,30,20,20}, //生体レーダー
	{ 55,0,0,1,0,0}, //空中魚雷
	{ 55,TV_FLASK,SV_FLASK_ROCKET,5,0,0}, //ジェットハンマー
	{ 60,TV_FLASK,SV_FLASK_ROCKET,5,0,30}, //ロケッティア
	{ 60,TV_MATERIAL,SV_MATERIAL_MOTOR_BULLET,10,40,0}, //マシンガン
	{ 65,TV_FLASK,SV_FLASK_ENERGY_WHITE,20,10,25}, //レーザーガン
	{ 65,TV_FLASK,SV_FLASK_BATTERY,50,0,20}, //スカウター
	{ 70,TV_FLASK,SV_FLASK_ENERGY_RED,7,0,0}, //対属性バリア
	{ 70,0,0,1,0,0}, //メガクラッシュ
	{ 75,TV_FLASK,SV_FLASK_BATTERY,4,20,30}, //万能レーダー
	{ 75,TV_FLASK,SV_FLASK_ENERGY_WHITE,12,20,0}, //プラズマガン
	{ 80,TV_FLASK,SV_FLASK_ENERGY_BLUE,5,0,30}, //テレポーター
	{ 80,TV_MATERIAL,SV_MATERIAL_CANNONBALL,1,70,0}, //カノン砲
	{ 85,TV_FLASK,SV_FLASK_ENERGY_BLACK,5,20,20}, //フォノンメーザー
	{ 85,TV_FLASK,SV_FLASK_ENERGY_BLUE,7,0,20}, //加速装置
	{ 90,TV_MATERIAL,SV_MATERIAL_GATLING_BULLET,10,40,0}, //ガトリング砲
	{ 90,TV_FLASK,SV_FLASK_ENERGY_RED,5,10,10}, //対魔法バリア
	{ 95,0,0,1,0,0}, //E缶
	{100,TV_FLASK,SV_FLASK_ENERGY_BLACK,10,0,20}, //対物バリア
	{105,0,0,4,25,5}, //多連装ロケットランチャー
	{110,TV_FLASK,SV_FLASK_ENERGY_BLACK,16,30,30}, //マイダスハンド
	{115,TV_FLASK,SV_FLASK_ENERGY_PARTICLE,25,0,0}, //ニュートリノガン
	{120,TV_FLASK,SV_FLASK_ENERGY_WAVEMOTION,3,0,0}, //波動砲
	{125,TV_FLASK,SV_FLASK_ENERGY_HYPERSPACE,5,0,0}, //トワイライトゾーン
	{150,TV_FLASK,SV_FLASK_ENERGY_HYPERSPACE,1,0,0}, //N.E.P

};

/*:::エンジニアギルドの消耗品調達のための品目*/
int engineer_guild_supply_table[MAX_MACHINE_SUPPLY][2] ={
	{TV_SOFTDRINK,SV_DRINK_WATER},
	{TV_FLASK,SV_FLASK_OIL },
	{TV_FLASK,SV_FLASK_BATTERY },
	{TV_FLASK,SV_FLASK_ROCKET },
	{TV_FLASK,SV_FLASK_ENERGY_RED },
	{TV_FLASK,SV_FLASK_ENERGY_BLUE },
	{TV_FLASK,SV_FLASK_ENERGY_WHITE },
	{TV_FLASK,SV_FLASK_ENERGY_BLACK },
	{TV_MATERIAL,SV_MATERIAL_MOTOR_BULLET },
	{TV_MATERIAL,SV_MATERIAL_CANNONBALL },
	{TV_MATERIAL,SV_MATERIAL_GATLING_BULLET },
	{TV_FLASK,SV_FLASK_ENERGY_PARTICLE},
	{TV_FLASK,SV_FLASK_ENERGY_WAVEMOTION },
	{TV_FLASK,SV_FLASK_ENERGY_HYPERSPACE },
};


/*:::青魔、ものまね系用モンスター魔法新リスト*/
/*:::これらのレベルや難易度などの各項目は職によっては無視される*/
/*:::配列の添え字はRF4,5,6,9の順に0から*/
//v1.1.96 主にブレス系のコスト低下
const monspells2 monspell_list2[MAX_MONSPELLS2+1] =
{
/* level,  smana,  fail, use_stat, use_words, attack_spell,priority, name ,monspell_type*/
{ 0,  0,  0, 0, FALSE,FALSE, 0,_("(配列用ダミー)", "(array dummy)"),0},

{ 1,    1,   10, A_CON, TRUE,FALSE,5,  _("叫ぶ", "Shriek"),NEW_MSPELL_TYPE_OTHER },
{ 1,    2,   20, A_CHR, FALSE,TRUE,1, _("弾幕", "Danmaku"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 24,  25,  70, A_INT, TRUE, FALSE,3,_("魔力消去", "Dispel Magic"),NEW_MSPELL_TYPE_OTHER },
{ 36,  30,  70, A_STR, FALSE,TRUE,2, _("ロケット", "Rocket"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 5,    4,  20, A_DEX, FALSE,TRUE,2, _("射撃", "Shoot"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 30,  30,  70, A_CON, FALSE,TRUE,2, _("聖なるブレス", "Holy Breath"),NEW_MSPELL_TYPE_BREATH },
{ 35,  30,  75, A_CON, FALSE,TRUE,2, _("地獄の劫火のブレス", "Hellfire Breath"),NEW_MSPELL_TYPE_BREATH },
{ 20,  25,  55, A_CON, FALSE,TRUE,2, _("アクアブレス", "Aqua Breath"),NEW_MSPELL_TYPE_BREATH },
{ 15,  20,  50, A_CON, FALSE,TRUE,1, _("酸のブレス", "Acid Breath"),NEW_MSPELL_TYPE_BREATH },
{ 15,  20,  50, A_CON, FALSE,TRUE,1, _("電撃のブレス", "Lightning Breath"),NEW_MSPELL_TYPE_BREATH },

{ 15,  20,  50, A_CON, FALSE,TRUE,1, _("炎のブレス", "Fire Breath"),NEW_MSPELL_TYPE_BREATH },
{ 15,  20,  50, A_CON, FALSE,TRUE,1, _("冷気のブレス", "Frost Breath"),NEW_MSPELL_TYPE_BREATH },
{ 20,  20,  50, A_CON, FALSE,TRUE,1, _("ガスのブレス", "Poison Breath"),NEW_MSPELL_TYPE_BREATH },
{ 27,  25,  60, A_CON, FALSE,TRUE,2, _("地獄のブレス", "Nether Breath"),NEW_MSPELL_TYPE_BREATH },
{ 25,  25,  60, A_CON, FALSE,TRUE,2, _("閃光のブレス", "Light Breath"),NEW_MSPELL_TYPE_BREATH },
{ 25,  25,  60, A_CON, FALSE,TRUE,2, _("暗黒のブレス", "Darkness Breath"),NEW_MSPELL_TYPE_BREATH },
{ 45,  45,  80, A_CON, TRUE,TRUE, 2,_("波動砲", "Wave-Motion Cannon"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 28,  25,  60, A_CON, TRUE,TRUE,2, _("衝撃波のブレス", "Shockwave Breath"),NEW_MSPELL_TYPE_BREATH },
{ 30,  25,  60, A_CON, FALSE,TRUE,2, _("カオスのブレス", "Chaos Breath"),NEW_MSPELL_TYPE_BREATH },
{ 30,  25,  60, A_CON, FALSE,TRUE,2, _("劣化のブレス", "Disenchantment Breath"),NEW_MSPELL_TYPE_BREATH },

{ 35,  35,  70, A_CON, FALSE,TRUE,2, _("因果混乱のブレス", "Nexus Breath"),NEW_MSPELL_TYPE_BREATH },
{ 30,  30,  60, A_CON, FALSE,TRUE,2, _("時間逆転のブレス", "Time Breath"),NEW_MSPELL_TYPE_BREATH },
{ 25,  25,  55, A_CON, FALSE,TRUE,2, _("遅鈍のブレス", "Inertia Breath"),NEW_MSPELL_TYPE_BREATH },
{ 25,  25,  55, A_CON, FALSE,TRUE,2, _("重力のブレス", "Gravity Breath"),NEW_MSPELL_TYPE_BREATH },
{ 30,  25,  60, A_CON, FALSE,TRUE,2, _("破片のブレス", "Shards Breath"),NEW_MSPELL_TYPE_BREATH },
{ 20,  25,  50, A_CON, FALSE,TRUE,2, _("プラズマのブレス", "Plasma Breath"),NEW_MSPELL_TYPE_BREATH },
{ 28,  25,  60, A_STR, FALSE,TRUE,2, _("気弾", "Ki Bullet"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 32,  30,  70, A_CON, FALSE,TRUE,2, _("魔力のブレス", "Mana Breath"),NEW_MSPELL_TYPE_BREATH },
{ 0,  0,  0, A_CON, FALSE, 0,FALSE,_("(特別行動1は使用不可)", "(special action 1 unusable)"),0 },
{ 25,  30,  60, A_CON, FALSE,TRUE,2, _("核熱のブレス", "Nuclear Heat Breath"),NEW_MSPELL_TYPE_BREATH },

{ 28,  24,  75, A_INT, TRUE,TRUE, 3,_("純ログルス", "Raw Logrus"),NEW_MSPELL_TYPE_BALL },
{ 30,  30,  60, A_CON, FALSE,TRUE,2, _("分解のブレス", "Disintegration Breath"),NEW_MSPELL_TYPE_BREATH },
{ 18,  12,  50,  A_INT, TRUE,TRUE,4, _("アシッド・ボール", "Acid Ball"),NEW_MSPELL_TYPE_BALL }, //RF5
{ 16,  11,  50,  A_INT, TRUE,TRUE,4, _("サンダー・ボール", "Thunder Ball"),NEW_MSPELL_TYPE_BALL },
{ 18,  13,  50,  A_INT, TRUE,TRUE,4, _("ファイア・ボール", "Fire Ball"),NEW_MSPELL_TYPE_BALL },
{ 16,  11,  50,  A_INT, TRUE,TRUE,4, _("アイス・ボール", "Frost Ball"),NEW_MSPELL_TYPE_BALL },
{  5,    5,  30,  A_INT, TRUE,TRUE,4, _("悪臭雲", "Stinking Cloud"),NEW_MSPELL_TYPE_BALL },
{ 27,   27,  60, A_INT, TRUE,TRUE,3, _("地獄球", "Nether Ball"),NEW_MSPELL_TYPE_BALL },
{ 29,   24,  65, A_INT, TRUE,TRUE,3, _("ウォーター・ボール", "Water Ball"),NEW_MSPELL_TYPE_BALL },
{ 45,   50,  85, A_INT, TRUE,TRUE,3, _("魔力の嵐", "Mana Storm"),NEW_MSPELL_TYPE_BALL },

{ 40,   40,  85, A_INT, TRUE,TRUE,3, _("暗黒の嵐", "Darkness Storm"),NEW_MSPELL_TYPE_BALL },
{ 10,    5,   50, A_INT, FALSE,FALSE,4, _("魔力吸収", "Drain Mana"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 20,   10,   60, A_INT, FALSE,FALSE,5, _("精神攻撃", "Mind Blast"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 15,   16,   55, A_INT, FALSE,FALSE,4, _("脳攻撃", "Brain Smash"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 3,   2,   25, A_INT, TRUE,FALSE,5, _("軽傷の呪い", "Cause Light Wounds"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 9,   5,   30, A_INT, TRUE,FALSE,5, _("重傷の呪い", "Cause Serious Wounds"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 15,   8,   35, A_INT, TRUE,FALSE,4, _("致命傷の呪い", "Cause Critical Wounds"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 25,   12,   40, A_INT, TRUE,TRUE,4, _("死の言霊", "Word of Death"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 9,  7,  30,  A_INT, TRUE,TRUE, 5,_("アシッド・ボルト", "Acid Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 8,  6,  30,  A_INT, TRUE,TRUE, 5,_("サンダー・ボルト", "Thunder Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },

{ 10,  8,  30,  A_INT, TRUE,TRUE, 5,_("ファイア・ボルト", "Fire Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 9,  6,  30,  A_INT, TRUE,TRUE, 5,_("アイス・ボルト", "Frost Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 40,   40,  85, A_INT, TRUE,TRUE, 3,_("閃光の嵐", "Light Storm"),NEW_MSPELL_TYPE_BALL },
{ 20,   17,  55, A_INT, TRUE,TRUE, 4,_("地獄の矢", "Nether Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 18,   16,  60, A_INT, TRUE,TRUE, 4,_("ウォーター・ボルト", "Water Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 23,   18,  75, A_INT, TRUE,TRUE, 4,_("魔力の矢", "Mana Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 27,   21,  65, A_INT, TRUE,TRUE, 4,_("プラズマ・ボルト", "Plasma Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 20,   16,  70, A_INT, TRUE,TRUE, 4,_("極寒の矢", "Ice Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 1,   1,  20, A_INT, TRUE,TRUE, 5,_("マジック・ミサイル", "Magic Missile"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 5,   3,  30, A_INT, TRUE,FALSE, 5,_("恐慌", "Terrify"),NEW_MSPELL_TYPE_OTHER },

{ 8,   4,  30, A_INT, TRUE,FALSE, 5,_("盲目", "Blind"),NEW_MSPELL_TYPE_OTHER },
{ 10,   5,  40, A_INT, TRUE,FALSE, 5,_("混乱", "Confuse"),NEW_MSPELL_TYPE_OTHER },
{ 12,   5,  40, A_INT, TRUE,FALSE, 5,_("減速", "Slow"),NEW_MSPELL_TYPE_OTHER },
{ 15,   5,  40, A_INT, TRUE,FALSE, 5,_("麻痺", "Paralyse"),NEW_MSPELL_TYPE_OTHER },
{ 35,  30,  70, A_INT, TRUE,FALSE, 3,_("加速", "Haste Self"),NEW_MSPELL_TYPE_OTHER }, //RF6
{ 40,  36,  85, A_INT, TRUE,TRUE, 3,_("破滅の手", "Hand of Doom"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 32,  36,   80, A_WIS, TRUE,FALSE, 2,_("治癒", "Healing"),NEW_MSPELL_TYPE_OTHER },
{ 47,  100,   90, A_INT, TRUE,FALSE, 2,_("無敵化", "Invincibility"),NEW_MSPELL_TYPE_OTHER },
{ 3,  3,   20, A_INT, TRUE,FALSE, 3,_("ショート・テレポート", "Blink"),NEW_MSPELL_TYPE_OTHER },
{ 12,  10,   30, A_INT, TRUE,FALSE, 2,_("テレポート", "Teleport"),NEW_MSPELL_TYPE_OTHER },

{ 48, 255,   90, A_INT, FALSE,FALSE, 2,_("ザ・ワールド", "The World"),NEW_MSPELL_TYPE_OTHER },
{ 0,  0,  0, A_CON, FALSE,FALSE, 0,_("(特別行動2は使用不可)", "(special action 2 unusable)"),0 },
{ 24,  20,   50, A_INT, TRUE,FALSE, 3,_("テレポート・バック", "Teleport To"),NEW_MSPELL_TYPE_OTHER },
{ 20,  16,   30, A_INT, TRUE,FALSE, 2,_("テレポート・アウェイ", "Teleport Away"),NEW_MSPELL_TYPE_OTHER },
{ 0,  0,   0, A_INT, TRUE,FALSE, 0,_("(未実装)", "(unimplemented)"),0 },
{ 32,  30,   70, A_WIS, FALSE,TRUE, 1,_("光の剣", "Psycho-Spear"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 5,  3,   20, A_INT, FALSE,FALSE, 5,_("ライト・エリア", "Light"),NEW_MSPELL_TYPE_OTHER },
{ 5,  3,   20, A_INT, FALSE,FALSE, 6,_("トラップ", "Create Traps"),NEW_MSPELL_TYPE_OTHER },
{ 15,  6,   40, A_INT, FALSE,FALSE, 6,_("記憶消去", "Amnesia"),NEW_MSPELL_TYPE_OTHER },
{ 40, 32,   80, A_CHR, FALSE,TRUE, 2,_("コズミック・ホラー", "Cosmic Horror"),NEW_MSPELL_TYPE_OTHER_ATTACK },

{ 30, 36,   70, A_CHR, TRUE,FALSE, 5,_("救援召喚", "Summon Kin"),NEW_MSPELL_TYPE_SUMMMON },
{ 45, 100,   90, A_INT, TRUE,FALSE, 4,_("サイバーデーモン召喚", "Summon Cyberdemons"),NEW_MSPELL_TYPE_SUMMMON },
{ 25, 20,   60, A_INT, TRUE,FALSE, 4,_("モンスター一体召喚", "Summon Monster"),NEW_MSPELL_TYPE_SUMMMON },
{ 35, 40,   80, A_INT, TRUE,FALSE, 3,_("モンスター複数召喚", "Summon Monsters"),NEW_MSPELL_TYPE_SUMMMON },
{ 20, 30,   60, A_INT, TRUE,FALSE, 5,_("アリ召喚", "Summon Ants"),NEW_MSPELL_TYPE_SUMMMON },
{ 20, 30,   60, A_INT, TRUE,FALSE, 5,_("虫召喚", "Summon Insects"),NEW_MSPELL_TYPE_SUMMMON },
{ 35, 60,   80, A_INT, TRUE,FALSE, 4,_("ハウンド召喚", "Summon Hounds"),NEW_MSPELL_TYPE_SUMMMON },
{ 32, 48,   70, A_INT, TRUE,FALSE, 4,_("ヒドラ召喚", "Summon Hydras"),NEW_MSPELL_TYPE_SUMMMON },
{ 36, 48,   70, A_INT, TRUE,FALSE, 4,_("天使召喚", "Summon Angel"),NEW_MSPELL_TYPE_SUMMMON },
{ 30, 36,   70, A_INT, TRUE,FALSE, 4,_("悪魔召喚", "Summon Demon"),NEW_MSPELL_TYPE_SUMMMON },

{ 27, 26,   60, A_INT, TRUE,FALSE, 4,_("アンデッド召喚", "Summon Undead"),NEW_MSPELL_TYPE_SUMMMON },
{ 30, 40,   70, A_INT, TRUE,FALSE, 3,_("ドラゴン召喚", "Summon Dragon"),NEW_MSPELL_TYPE_SUMMMON },
{ 40, 80,   80, A_INT, TRUE,FALSE, 2,_("上位アンデッド召喚", "Summon Greater Undead"),NEW_MSPELL_TYPE_SUMMMON },
{ 45, 90,   85, A_INT, TRUE,FALSE, 2,_("古代ドラゴン召喚", "Summon Ancient Dragons"),NEW_MSPELL_TYPE_SUMMMON },
{ 50, 120,  90, A_INT, TRUE,FALSE, 2,_("アンバーの王族召喚", "Summon Lords of Amber"),NEW_MSPELL_TYPE_SUMMMON },
{ 50, 100,  90, A_INT, TRUE,FALSE, 2,_("ユニークモンスター召喚", "Summon Unique Monsters"),NEW_MSPELL_TYPE_SUMMMON },
{ 36,  60,  85, A_INT, TRUE,TRUE, 1,_("炎の嵐", "Fire Storm"),NEW_MSPELL_TYPE_BALL }, //RF9
{ 36,  60,  85, A_INT, TRUE,TRUE, 1,_("氷の嵐", "Frost Storm"),NEW_MSPELL_TYPE_BALL },
{ 36,  60,  85, A_INT, TRUE,TRUE, 1,_("雷の嵐", "Thunder Storm"),NEW_MSPELL_TYPE_BALL },
{ 36,  60,  85, A_INT, TRUE,TRUE, 1,_("酸の嵐", "Acid Storm"),NEW_MSPELL_TYPE_BALL },

{ 35,  48,  75, A_INT, TRUE,TRUE, 2,_("毒素の嵐", "Toxic Storm"),NEW_MSPELL_TYPE_BALL },
{ 36,  38,  80, A_INT, TRUE,TRUE, 3,_("汚染の球", "Pollution Ball"),NEW_MSPELL_TYPE_BALL },
{ 32,  32,  80, A_INT, TRUE,TRUE, 3,_("原子分解", "Disintegration"),NEW_MSPELL_TYPE_BALL },
{ 32,  25,  70, A_INT, TRUE,TRUE, 3,_("破邪の光球", "Holy Sphere"),NEW_MSPELL_TYPE_BALL },
{ 36,  50,  80, A_INT, TRUE,TRUE, 2,_("メテオストライク", "Meteor Strike"),NEW_MSPELL_TYPE_BALL },
{ 42,  35,  85, A_INT, TRUE,TRUE, 3,_("空間歪曲", "Space Distortion"),NEW_MSPELL_TYPE_BALL },
{ 3,   2,   25, A_INT, TRUE,FALSE, 4,_("魔除けのまじない", "Warding Charm"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 9,   5,   30, A_INT, TRUE,FALSE, 4,_("聖なる言葉", "Holy Word"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 15,   8,   35, A_INT, TRUE,FALSE, 3,_("退魔の呪文", "Exorcism Spell"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 25,   12,   40, A_INT, TRUE,TRUE, 3,_("破邪の印", "Exorcism Sigil"),NEW_MSPELL_TYPE_OTHER_ATTACK },

{ 23,   16,  55, A_INT, TRUE,TRUE, 3,_("聖なる矢", "Holy Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 40,  64,  90, A_INT, FALSE,TRUE, 2,_("大型レーザー", "Wide Laser"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 20,   16,  50, A_INT, TRUE,TRUE, 3,_("音符のボルト", "Musical Note Bolt"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 27, 30,   60, A_INT, TRUE,FALSE, 4,_("動物召喚", "Summon Animals"),NEW_MSPELL_TYPE_SUMMMON },
{ 25,   24,  55, A_INT, FALSE,TRUE, 3,_("レーザー", "Laser"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 0,  0,  0, A_CON, FALSE,FALSE, 0,_("(未実装)", "(unimplemented)"),0 },
{ 48,  80,  75, A_INT, TRUE,TRUE, 3,_("ヘル・ファイア", "Hellfire"),NEW_MSPELL_TYPE_BALL },
{ 48,  80,  75, A_INT, TRUE,TRUE, 3,_("ホーリー・ファイア", "Holy Fire"),NEW_MSPELL_TYPE_BALL },
{ 45,  96,  80, A_INT, FALSE,FALSE, 2,_("ファイナルスパーク", "Final Spark"),NEW_MSPELL_TYPE_BOLT_BEAM_ROCKET },
{ 27,  24,  60, A_INT, FALSE,TRUE, 4,_("竜巻", "Tornado"),NEW_MSPELL_TYPE_BALL },

{ 40,  36,  70, A_INT, TRUE,FALSE, 2,_("*破壊*", "*Destruction*"),NEW_MSPELL_TYPE_OTHER },
{ 38,  50,   80, A_INT, TRUE,FALSE, 3,_("神格召喚", "Summon Deities"),NEW_MSPELL_TYPE_SUMMMON },
{ 44, 85,   85, A_INT, TRUE,FALSE, 2,_("上級悪魔召喚", "Summon Greater Demons"),NEW_MSPELL_TYPE_SUMMMON },
{ 25, 30,   60, A_INT, TRUE,FALSE, 4,_("妖怪召喚", "Summon Youkai"),NEW_MSPELL_TYPE_SUMMMON },
{ 25,  15,  50, A_INT, FALSE,FALSE, 3,_("隣接テレポート", "Teleport Self To"),NEW_MSPELL_TYPE_OTHER },
{ 35,  25,  70, A_INT, FALSE,FALSE, 2,_("視界外隣接テレポート", "Teleport Self To (out of LoS)"),NEW_MSPELL_TYPE_OTHER },
{ 40,  48,  85, A_INT, TRUE,FALSE, 3,_("メイルシュトロム", "Maelstrom"),NEW_MSPELL_TYPE_OTHER_ATTACK },
{ 5,    5,   20, A_CON, TRUE,FALSE, 5, _("警報+加速", "Alarm + Haste"),NEW_MSPELL_TYPE_OTHER },

};




const cptr stat_desc[6] =
{
#ifdef JP
	"腕力", "知能", "賢さ", "器用", "耐久", "魅力"
#else
	"STR", "INT", "WIS", "DEX", "CON", "CHR"
#endif

};

///mod150805 アリス
cptr alice_doll_name[INVEN_DOLL_NUM_MAX] =
{
	_("上海人形", "Shanghai Doll"),
	_("蓬莱人形", "Hourai Doll"),
	_("露西亜人形", "Russian Doll"),
	_("倫敦人形", "London Doll"),
	_("オルレアン人形", "Orleans Doll"),
	_("京人形", "Kyoto Doll"),
	_("ゴリアテ人形", "Goliath Doll"),
};
//v1.1.46 女苑
cptr jyoon_inven2_finger_name[JYOON_INVEN2_NUM] =
{
	_("右手人差し指", "Index finger (right hand)"),
	_("右手中指", "Middle finger (right hand)"),
	_("右手薬指", "Ring finger (right hand)"),
	_("右手小指", "Pinkie (right hand)"),
	_("左手人差し指", "Index finger (left hand)"),
	_("左手中指", "Middle finger (left hand)"),
	_("左手薬指", "Ring finger (left hand)"),
	_("左手小指", "Pinkie (left hand)"),
};

///mod150811 魔理沙 infoの\\は改行
struct marisa_magic_type marisa_magic_table[MARISA_MAGIC_KIND_MAX] =
{
	{_("八卦ファイア", "Hakkero Fire"),
    _("火炎属性のブレス型攻撃を放つ。",
    "Perform a fire breath attack."),
	{30,0,0,0,0,0,0,0},FALSE},
	{_("ポラリスユニーク", "Polaris Unique"),
	_("敵を吹き飛ばし朦朧とさせるロケット攻撃を放つ。",
    "Fires a rocket that blows enemies aside and stuns them."),
	{0,0,0,12,0,7,3,0},FALSE},
	{_("ナロースパーク", "Narrow Spark"),
	_("電撃属性のビームを放つ。",
    "Fires a beam of lightning."),
	{0,0,30,0,0,0,0,0},FALSE},
	{_("ステラミサイル", "Stella Missile"),
	_("ターゲットの位置に隕石属性の小さなボールを発生させる。",
    "Drops a small meteor at the target location."),
	{0,0,0,0,0,0,20,0},FALSE},

	{_("ウィッチレイライン", "Witch Leyline"),
	_("指定したターゲットに突進し魔力属性のダメージを与える。\\途中で障害物に当たると止まる。",
    "Charges towards the target, dealing mana damage. \\Stops if you hit an obstacle."),
	{5,0,5,5,0,0,0,0},FALSE},
	{_("丹", "Elixir"),
	_("体力を300回復し毒と切り傷を治癒する薬を作る。",
    "Creates a potion that heals 300 HP and cures poison and wounds."),
	{0,5,0,5,0,5,0,0},TRUE},
	{_("ルミネスストライク", "Luminous Strike"),
	_("閃光属性のロケットを放つ。",
    "Fires a rocket of light."),
	{0,0,0,10,0,0,0,0},FALSE},
	{_("エスケープベロシティ", "Escape Velocity"),
	_("隣接した敵全てに魔力属性攻撃を行い、\\その後一瞬で短距離のテレポートを行う。",
    "Deals mana damage to all adjacent enemies, \\then teleports away a short distance."),
	{0,0,5,0,0,10,0,0},FALSE},

	{_("コールドインフェルノ", "Cold Inferno"),
	_("冷気属性のブレス型攻撃を放つ。",
    "Performs a frost breath attack."),
	{0,30,0,0,0,0,0,0},FALSE},
	{_("デビルダムトーチ", "Devildom Touch"),
	_("近くのターゲットの位置に地獄属性の小爆発を起こす。",
    "Generates a small nether explosion at a nearby target location."),
	{20,0,0,0,20,0,0,0},FALSE},
	{_("マジックドレインミサイル", "Magic Drain Missile"),
	_("敵から体力を吸収するボルトを放つ。\\無生物には効果がない。",
    "Fires a bolt that drains mana from enemies. \\Does not affect nonliving beings."),
	{0,0,0,0,10,10,0,0},FALSE},
	{_("パワフルドラッグ", "Powerful Drug"),
	_("ターゲットの位置に酸属性のボールを発生させる。",
    "Generates a ball of acid at target location."),
	{10,10,10,0,0,0,0,0},FALSE},

	{_("ドラゴンメテオ", "Dragon Meteo"),
	_("近くのターゲットの場所に強力な核熱属性のボールを発生させる。",
    "Generates a powerful ball of nuclear heat at nearby target location."),
	{100,0,100,0,0,0,50,20},FALSE},
	{_("オープンユニバース", "Open Universe"),
	_("視界内の全てに対し隕石属性攻撃を行う。",
    "Hits everything in sight with a powerful meteor attack."),
	{0,0,0,100,0,0,100,50},FALSE},
	{_("マジックアブソーバー", "Magic Absorber"),
	_("一定時間、周囲の敵が使った魔法を吸収無効化しMPを回復する。\\高レベルな敵の魔法は吸収に失敗することがある。\\ブレスやロケットなど一部の特技は吸収できない。",
    "Temporarily makes you drain and negate spells used by nearby enemies, recovering your MP. \\You might fail to drain spells cast by high level enemies. \\You cannot drain some attacks like breaths or rockets."),
	{0,0,0,0,50,50,0,20},FALSE},
	{_("イベントホライズン", "Event Horizon"),
	_("自分のいる場所を中心に強力な重力属性のボールを発生させる。",
    "Generates a ball of gravity centered on yourself."),
	{0,0,0,0,150,0,50,30},FALSE},

	{_("魔力薬", "Mana Potion"),
	_("MPを最大値まで回復させる薬を作る。",
    "Creates a potion that greatly recovers MP."),
	{0,0,0,20,20,20,0,20},TRUE},
	{_("強化丹", "Enhanced Elixir"),
	_("体力を最大値まで回復し全てのステータス異常を治癒する薬を作る。",
    "Creates a potion that fully recovers HP and cures all status abnormalities."),
	{0,50,0,50,0,0,0,20},TRUE},
	{_("スターダストレヴァリエ", "Stardust Reverie"),
	_("自分の周囲に強力な閃光属性のボールを連続で発生させる。",
    "Generates a powerful ball of light centered on yourself."),
	{0,0,0,100,0,100,50,0},FALSE},
	{_("オーレリーズソーラーシステム", "Orreries Solar System"),
	_("一時的に元素攻撃に対する耐性と火炎オーラを得る。",
    "Temporarily grants resistance to basic elements and a fire aura."),
	{50,50,50,50,0,0,0,0},FALSE},

	{_("ビッグクランチ", "Big Crunch"),
	_("周囲の広範囲を*破壊*する。",
    "*Destroys* a wide nearby area."),
	{0,0,0,0,50,50,50,50},FALSE},
	{_("ダークスパーク", "Dark Spark"),
	_("強力な暗黒属性のレーザーを放つ。",
    "Fires a powerful laser of darkness."),
	{100,0,100,0,100,0,0,0},FALSE},
	{_("オカルティション", "Occultation"),
	_("近くの敵をフロアから消し去る。\\一体消すごとに疲労で1d3のダメージを受ける。\\抵抗されることもあり、ユニークモンスターには効果がない。",
    "Banishes nearby enemies from the level. \\You take 1d3 damage per each enemy banished from exhaustion. \\Can be resisted, and does not affect unique monsters."),
	{0,0,0,0,0,200,0,0},FALSE},
	{_("ディープエコロジカルボム", "Deep Ecological Bomb"),
	_("ターゲットの位置に強力なカオス属性のボールを発生させる。\\爆風に巻き込まれると自分自身もダメージを受けるので注意。",
    "Generates a powerful ball of chaos at target location. \\Keep in mind the explosion can deal damage to you as well."),
	{100,100,100,0,0,0,0,0},FALSE},

	{_("ファイナルスパーク", "Final Spark"),
	_("極めて強力な分解属性のレーザーを放つ。",
    "Fires an extremely powerful disintegration laser."),
	{0,0,0,0,0,0,0,300},FALSE},
	{_("オーレリーズユニバース", "Orreries Universe"),
	_("一時的に全ての耐性、AC上昇を得てほぼ全てのダメージを2/3に軽減する。",
    "Temporarily grants all resistances, raises AC and reduces almost all damage received to 2/3."),
	{100,100,100,100,100,100,100,0},FALSE},
	{_("アルティメットショートウェーブ", "Ultimate Short Nova"),
	_("フロアの全てに対し強力なプラズマ属性の攻撃を行う。",
    "Performs a powerful plasma attack against the entire level."),
	{200,200,200,200,0,0,0,100},FALSE},
	{_("ブレイジングスター", "Blazing Star"),
	_("長距離を突進する。\\壁などを破壊し立ち塞がる敵に極めて大きなダメージを与えて吹き飛ばすが、\\細かい方向指定はできない。",
    "Charges a long distance. \\You destroy any obstacles you go through and deal extremely large damage to enemies, throwing them aside. \\You can't precisely control your movement direction."),
	{500,0,0,200,0,200,200,300},FALSE},

};

cptr marisa_essence_name[8] = {_("炎", "Fire"),_("氷", "Cold"),_("雷", "Elec"),_("光", "Lght"),_("闇", "Dark"),_("幻", "Illu"),_("星", "Star"),_("極", "Ulti"),};

//輝夜クエスト
int kaguya_quest_art_list[KAGUYA_QUEST_MAX] =
{ART_KAGUYA_TSUBAME,ART_KAGUYA_HINEZUMI,ART_KAGUYA_HOTOKE,ART_KAGUYA_DRAGON,ART_KAGUYA_HOURAI};



/*:::薬師の合成素材表
 * {材料TV,材料SV,調剤室を借りるコスト,
 * {酸,電,火,冷,毒,回復,変容,精神属性値}
 */
const drug_material_type drug_material_table[] =
{

//Material
	//ヒカリゴケ
	{TV_MATERIAL,SV_MATERIAL_HIKARIGOKE,400,
	{0,0,0,0,-100,250,50,100}},
	//砒素
	{TV_MATERIAL,SV_MATERIAL_ARSENIC,640,
	{0,0,0,0,300,-300,0,-50}},
	//水銀
	{TV_MATERIAL,SV_MATERIAL_MERCURY,750,
	{100,100,100,100,300,0,50,50}},
	//竜の鱗
	{TV_MATERIAL,SV_MATERIAL_DRAGONSCALE,2300,
	{200,200,200,200,200,0,0,0}},
	//竜の爪
	{TV_MATERIAL,SV_MATERIAL_DRAGONNAIL,12000,
	{500,500,500,500,500,500,500,500}},
	//ゲルセミウム
	{TV_MATERIAL,SV_MATERIAL_GELSEMIUM,1000,
	{0,0,0,0,800,-300,0,0}},
	//氷の鱗
	{TV_MATERIAL,SV_MATERIAL_ICESCALE,1800,
	{0,0,0,1200,0,0,0,0}},
	//悪夢のかけら
	{TV_MATERIAL,SV_MATERIAL_NIGHTMARE_FRAGMENT,1250,
	{0,0,0,100,200,0,0,-400}},
	//希望の結晶
	{TV_MATERIAL,SV_MATERIAL_HOPE_FRAGMENT,4400,
	{0,0,0,0,-600,800,0,600}},
	//炭
	{TV_MATERIAL,SV_MATERIAL_COAL,50,
	{0,0,7,0,5,-5,10,0}},
	//高草郡の光る竹
	{TV_MATERIAL,SV_MATERIAL_TAKAKUSAGORI,2400,
	{0,300,300,300,-300,500,700,0}},
	//ミステリウム
	{TV_MATERIAL,SV_MATERIAL_MYSTERIUM,32000,
	{1200,1200,1200,1200,0,-1200,1200,0}},
	//伊弉諾物質
	{TV_MATERIAL,SV_MATERIAL_IZANAGIOBJECT,16000,
	{-200,-200,-200,-200,-200,0,500,1100}},
	//石桜
	{TV_MATERIAL,SV_MATERIAL_ISHIZAKURA,450,
	{0,0,0,0,0,-100,50,-100}},

	//頭蓋骨
	{ TV_MATERIAL,SV_MATERIAL_SKULL,400,
	{ 100,100,100,100,100,-100,200,-100 } },


//Kinoko
	//毒のキノコ
	{TV_MUSHROOM,SV_MUSHROOM_POISON ,50,
	{0,0,0,0,50,-10,5,0}},
	//盲目茸
	{TV_MUSHROOM,SV_MUSHROOM_BLINDNESS ,35,
	{40,0,0,0,25,0,15,0}},
	//恐怖
	{TV_MUSHROOM,SV_MUSHROOM_PARANOIA ,25,
	{25,0,0,25,20,0,5,-30}},
	//混乱
	{TV_MUSHROOM,SV_MUSHROOM_CONFUSION ,35,
	{0,25,25,0,10,0,20,-15}},
	//幻覚
	{TV_MUSHROOM,SV_MUSHROOM_HALLUCINATION ,50,
	{0,0,0,0,20,0,30,-30}},
	//麻痺
	{TV_MUSHROOM,SV_MUSHROOM_PARALYSIS ,15,
	{0,40,0,20,20,0,0,0}},
	//脆弱
	{TV_MUSHROOM,SV_MUSHROOM_WEAKNESS ,60,
	{40,0,-50,0,30,-20,-40,0}},
	//病気
	{TV_MUSHROOM,SV_MUSHROOM_SICKNESS ,60,
	{-50,30,0,0,30,-20,-20,0}},
	//無知
	{TV_MUSHROOM,SV_MUSHROOM_STUPIDITY ,65,
	{0,-50,0,20,20,-30,0,-20}},
	//愚鈍
	{TV_MUSHROOM,SV_MUSHROOM_NAIVETY ,65,
	{0,0,20,-50,20,-20,0,-20}},
	//病弱
	{TV_MUSHROOM,SV_MUSHROOM_UNHEALTH ,120,
	{20,20,20,20,70,-30,0,-50}},
	//疾病
	{TV_MUSHROOM,SV_MUSHROOM_DISEASE ,120,
	{20,20,20,20,70,-30,0,-50}},

	//毒消し
	{TV_MUSHROOM,SV_MUSHROOM_CURE_POISON ,90,
	{0,0,0,0,-300,0,0,0}},
	//盲目治癒
	{TV_MUSHROOM,SV_MUSHROOM_CURE_BLINDNESS ,80,
	{0,0,0,0,0,45,45,0}},
	//恐怖除去
	{TV_MUSHROOM,SV_MUSHROOM_CURE_PARANOIA ,50,
	{0,10,10,0,0,10,0,20}},
	//混乱脱出
	{TV_MUSHROOM,SV_MUSHROOM_CURE_CONFUSION ,60,
	{0,0,0,0,0,20,0,30}},
	//重傷治癒
	{TV_MUSHROOM,SV_MUSHROOM_CURE_SERIOUS ,100,
	{10,10,0,0,-20,50,0,5}},

	//腕力復活
	{TV_MUSHROOM,SV_MUSHROOM_RESTORE_STR ,70,
	{0,20,20,0,0,30,0,0}},
	//耐久力復活
	{TV_MUSHROOM,SV_MUSHROOM_RESTORE_CON ,70,
	{20,0,0,20,0,30,0,0}},
	//全復活
	{TV_MUSHROOM,SV_MUSHROOM_RESTORING ,750,
	{40,40,40,40,-200,200,-50,100}},
	//疲労回復
	{TV_MUSHROOM,SV_MUSHROOM_MANA ,310,
	{0,0,0,0,0,80,0,70}},
	//狂戦士化
	{TV_MUSHROOM,SV_MUSHROOM_BERSERK ,220,
	{-30,50,50,-30,30,-20,40,50}},

	//おばけ赤
	{TV_MUSHROOM,SV_MUSHROOM_MON_RED ,150,
	{0,0,100,-25,0,0,0,0}},
	//おばけ白
	{TV_MUSHROOM,SV_MUSHROOM_MON_WHITE ,150,
	{0,0,-25,100,0,0,0,0}},
	//おばけ青
	{TV_MUSHROOM,SV_MUSHROOM_MON_BLUE ,150,
	{-25,100,0,0,0,0,0,0}},
	//おばけ黒
	{TV_MUSHROOM,SV_MUSHROOM_MON_BLACK ,150,
	{100,-25,0,0,0,0,0,0}},
	//おばけ緑
	{TV_MUSHROOM,SV_MUSHROOM_MON_GREEN ,150,
	{0,0,0,0,100,-25,10,0}},
	//おばけ極彩色
	{TV_MUSHROOM,SV_MUSHROOM_MON_GAUDY ,300,
	{0,0,0,0,50,50,250,0}},
	//おばけ灰色
	{TV_MUSHROOM,SV_MUSHROOM_MON_GRAY ,300,
	{0,0,0,0,250,-250,0,-100}},
	//おばけ透明
	{TV_MUSHROOM,SV_MUSHROOM_MON_CLEAR ,300,
	{0,0,0,0,0,0,-400,50}},

	//スーパーキノコ
	{TV_MUSHROOM,SV_MUSHROOM_MON_SUPER ,16000,
	{0,0,0,0,0,500,2400,0}},
	//魔法お化けキノコ
	{TV_MUSHROOM,SV_MUSHROOM_MON_L_BLUE ,450,
	{50,50,50,50,50,0,50,0}},

	//オニフスベ
	{ TV_MUSHROOM,SV_MUSHROOM_PUFFBALL ,500,
	{ 0,0,0,0,0,100,200,0 } },

//薬

	//のろま
	{TV_POTION,SV_POTION_SLOWNESS ,30,
	{10,0,0,10,10,0,0,0}},
	//毒
	{TV_POTION,SV_POTION_POISON ,60,
	{0,0,0,0,30,-30,0,0}},
	//盲目
	{TV_POTION,SV_POTION_BLINDNESS ,35,
	{10,-5,0,0,10,-5,4,0}},
	//眠り
	{TV_POTION,SV_POTION_SLEEP ,12,
	{0,0,0,0,0,0,0,-30}},
	//記憶喪失
	{TV_POTION,SV_POTION_LOSE_MEMORIES ,360,
	{0,100,0,0,0,0,100,-100}},

	//破滅
	{TV_POTION,SV_POTION_RUINATION ,3000,
	{-200,-200,-200,-200,200,-200,200,-200}},
	//脆弱～醜悪
	{TV_POTION,SV_POTION_DEC_STR ,50,
	{0,0,-30,30,15,-10,0,0}},
	{TV_POTION,SV_POTION_DEC_INT ,50,
	{0,-30,30,0,15,-10,0,0}},
	{TV_POTION,SV_POTION_DEC_WIS ,50,
	{0,0,-30,30,15,-10,0,0}},
	{TV_POTION,SV_POTION_DEC_DEX ,50,
	{30,0,0,-30,15,-10,0,0}},
	{TV_POTION,SV_POTION_DEC_CON ,50,
	{0,30,-30,0,15,-10,0,0}},
	{TV_POTION,SV_POTION_DEC_CHR ,50,
	{30,-30,0,0,15,-10,0,0}},

	//爆発
	{TV_POTION,SV_POTION_DETONATIONS ,1500,
	{0,0,600,-300,0,0,50,0}},
	//死
	{TV_POTION,SV_POTION_DEATH ,3000,
	{0,0,0,0,1000,-1000,0,-600}},
	//赤外線視力
	{TV_POTION,SV_POTION_INFRAVISION ,10,
	{0,0,0,0,0,0,10,0}},
	//透明視認
	{TV_POTION,SV_POTION_DETECT_INVIS ,30,
	{0,0,-5,0,-5,0,25,25}},
	//減毒
	{TV_POTION,SV_POTION_SLOW_POISON ,20,
	{0,0,0,0,-50,0,0,0}},
	//解毒
	{TV_POTION,SV_POTION_CURE_POISON ,10,
	{0,0,0,0,-50,0,0,0}},
	//恐いもの知らず
	{TV_POTION,SV_POTION_BOLDNESS ,40,
	{0,0,15,-15,0,5,5,10}},
	//スピード
	{TV_POTION,SV_POTION_SPEED ,100,
	{0,30,0,30,0,0,20,20}},
	//耐火
	{TV_POTION,SV_POTION_RESIST_HEAT ,60,
	{0,0,40,0,0,0,20,0}},
	//耐冷
	{TV_POTION,SV_POTION_RESIST_COLD ,60,
	{0,0,0,40,0,0,20,0}},
	//ヒーロー
	{TV_POTION,SV_POTION_HEROISM ,40,
	{0,0,10,-20,0,0,0,30}},
	//狂戦士化
	{TV_POTION,SV_POTION_BESERK_STRENGTH ,200,
	{0,50,50,-30,20,-20,30,50}},

	//軽症治癒
	{TV_POTION,SV_POTION_CURE_LIGHT ,10,
	{0,0,0,0,-5,5,0,0}},
	//重症治癒
	{TV_POTION,SV_POTION_CURE_SERIOUS ,20,
	{0,0,0,0,-10,10,0,0}},
	//致命傷治癒
	{TV_POTION,SV_POTION_CURE_CRITICAL ,70,
	{0,0,0,10,-20,20,0,5}},
	//体力回復
	{TV_POTION,SV_POTION_HEALING ,350,
	{-20,-20,-20,-20,-50,200,0,20}},
	//*体力回復*
	{TV_POTION,SV_POTION_STAR_HEALING ,2400,
	{-50,-50,-50,-50,-400,800,0,50}},
	//生命
	{TV_POTION,SV_POTION_LIFE ,8000,
	{-100,-100,-100,-100,-1000,1000,-300,300}},

	//魔力復活
	{TV_POTION,SV_POTION_RESTORE_MANA ,800,
	{50,50,50,50,0,50,50,200}},
	//経験値復活
	{TV_POTION,SV_POTION_RESTORE_EXP ,70,
	{0,0,0,0,-50,20,-30,0}},
	//腕力～魅力回復
	{TV_POTION,SV_POTION_RES_STR ,50,
	{0,0,30,-30,0,20,10,0}},
	{TV_POTION,SV_POTION_RES_INT ,50,
	{0,30,-30,0,0,20,10,0}},
	{TV_POTION,SV_POTION_RES_WIS ,50,
	{0,0,30,-30,0,20,10,0}},
	{TV_POTION,SV_POTION_RES_DEX ,50,
	{-30,0,0,30,0,20,10,0}},
	{TV_POTION,SV_POTION_RES_CON ,50,
	{0,-30,30,0,0,20,10,0}},
	{TV_POTION,SV_POTION_RES_CHR ,50,
	{-30,30,0,0,0,20,10,0}},
	//腕力～魅力
	{TV_POTION,SV_POTION_INC_STR ,2500,
	{0,0,300,-100,0,0,400,0}},
	{TV_POTION,SV_POTION_INC_INT ,2500,
	{0,300,-100,0,0,0,0,400}},
	{TV_POTION,SV_POTION_INC_WIS ,2500,
	{0,0,300,-100,0,0,0,400}},
	{TV_POTION,SV_POTION_INC_DEX ,2500,
	{-100,0,0,300,0,0,400,0}},
	{TV_POTION,SV_POTION_INC_CON ,2500,
	{0,-100,300,0,0,0,400,0}},
	{TV_POTION,SV_POTION_INC_CHR ,2500,
	{-100,300,0,0,0,0,0,400}},
	//増強
	{TV_POTION,SV_POTION_AUGMENTATION ,25000,
	{500,500,500,500,0,0,700,300}},

	//啓蒙
	{TV_POTION,SV_POTION_ENLIGHTENMENT ,500,
	{0,0,0,0,0,0,0,300}},
	//*啓蒙*
	{TV_POTION,SV_POTION_STAR_ENLIGHTENMENT ,18000,
	{0,300,0,300,0,300,0,1600}},
	//自己分析
	{TV_POTION,SV_POTION_SELF_KNOWLEDGE ,1200,
	{0,0,0,0,0,0,-400,400}},

	//経験
	{TV_POTION,SV_POTION_EXPERIENCE ,12000,
	{200,200,200,200,200,200,200,600}},
	//耐性
	{TV_POTION,SV_POTION_RESISTANCE ,250,
	{50,50,50,50,50,0,50,0}},
	//癒し
	{TV_POTION,SV_POTION_CURING ,120,
	{0,0,0,0,-30,50,-30,50}},
	//紺珠
	{TV_POTION,SV_POTION_INVULNERABILITY ,24000,
	{0,0,0,0,0,800,-400,1600}},
	//新生
	{TV_POTION,SV_POTION_NEW_LIFE ,14000,
	{0,0,0,0,0,700,700,700}},
	//ネオつよし
	{TV_POTION,SV_POTION_NEO_TSUYOSHI ,700,
	{0,0,0,0,0,0,300,-300}},
	//つよし
	{TV_POTION,SV_POTION_TSUYOSHI ,150,
	{0,0,0,0,100,-50,100,-50}},
	//突然変異
	{TV_POTION,SV_POTION_POLYMORPH ,3000,
	{0,0,0,0,100,100,500,0}},
	//なにか涼しくなる薬
	{TV_POTION,SV_POTION_NANIKASUZUSHIKUNARU ,6000,
	{0,0,-1600,1600,500,-500,0,0}},
	//猛毒の薬
	{TV_POTION,SV_POTION_POISON2 ,300,
	{0,0,0,0,200,-100,20,-50}},
	//惚れ薬
	{TV_POTION,SV_POTION_LOVE ,6000,
	{-200,400,400,-200,0,100,400,400}},

//合成薬
	//強酸
	{TV_COMPOUND,SV_COMPOUND_STRONG_ACID ,200,
	{300,0,50,-50,0,0,50,0}},
	//幸福薬
	{TV_COMPOUND,SV_COMPOUND_HAPPY ,360,
	{0,0,0,0,20,-20,0,-100}},
	//筋肉増強剤
	{TV_COMPOUND,SV_COMPOUND_MUSCLE_DRUG ,550,
	{0,30,30,-70,0,50,200,-20}},
	//火吹き薬
	{TV_COMPOUND,SV_COMPOUND_BREATH_OF_FIRE ,500,
	{0,0,300,-100,0,0,150,00}},

	//ナイトメア
	{TV_COMPOUND,SV_COMPOUND_NIGHTMARE ,480,
	{0,0,0,0,150,-50,100,-300}},
	//国士無双の薬
	{TV_COMPOUND,SV_COMPOUND_KOKUSHI ,1200,
	{0,0,0,0,0,200,200,200}},
	//*栄養剤*
	{TV_COMPOUND,SV_COMPOUND_STAR_FEEDING ,1300,
	{0,0,0,0,0,200,500,-300}},
	//ミクロオキシゲン
	{TV_COMPOUND,SV_COMPOUND_MICRO_OCSIGEN ,22000,
	{1200,0,0,0,0,-1600,0,0}},
	//時空消滅内服液
	{TV_COMPOUND,SV_COMPOUND_YOKOSHIMA ,3200,
	{0,50,0,200,500,0,320,-700}},
	//*爆発*
	{TV_COMPOUND,SV_COMPOUND_STAR_DETORNATION ,5000,
	{0,0,1200,-1000,0,0,0,0}},
	//巨人の薬
	{TV_COMPOUND,SV_COMPOUND_TITAN ,12500,
	{50,50,50,50,0,600,1200,0}},
	//イチコロリ
	{TV_COMPOUND,SV_COMPOUND_ICHIKORORI ,27000,
	{800,800,0,0,1600,-1600,0,-500}},
	//産廃
	{TV_COMPOUND,SV_COMPOUND_MAGICAL_ECO_BOMB ,3000,
	{-100,-100,-100,-100,-100,-100,500,-100}},
//ほか
	//不死鳥の羽根
	{TV_SOUVENIR,SV_SOUVENIR_PHOENIX_FEATHER,50000,
	{500,0,3200,-1600,0,1600,1600,1600}},
	//巨大な卵
	{TV_SOUVENIR,SV_SOUVENIR_BIG_EGG,60000,
	{0,0,0,0,0,0,1600,1600}},
	//河童の五色甲羅
	{TV_SOUVENIR,SV_SOUVENIR_KAPPA_5,36000,
	{800,800,800,800,800,800,800,800}},
	//スライムモルド、スライムモルドジュース
	{TV_FOOD,SV_FOOD_SLIMEMOLD ,100,
	{30,0,0,0,50,50,200,-30}},
	{TV_SOFTDRINK,SV_DRINK_SLIME_MOLD ,100,
	{30,0,0,0,50,50,200,-30}},
	//空腹充足の仙丹
	{TV_FOOD,SV_FOOD_SENTAN ,200,
	{0,0,0,0,0,100,0,40}},
	//ミラクルフルーツ
	{TV_SWEETS,SV_SWEETS_MIRACLE_FRUIT ,1400,
	{50,50,50,50,50,50,300,0}},

	//水
	{TV_SOFTDRINK,SV_DRINK_WATER ,1,
	{0,0,0,0,0,1,0,0}},
	//ジュース
	{TV_SOFTDRINK,SV_DRINK_APPLE_JUICE ,5,
	{0,0,0,0,0,1,3,0}},
	{TV_SOFTDRINK,SV_DRINK_GRAPE_JUICE ,5,
	{0,0,0,0,0,1,3,0}},

	//魔法スイカ
	{ TV_FOOD,SV_FOOD_MAGIC_WATERMELON ,300,
	{ 100,0,0,0,0,200,200,0 } },

	//奇妙な豆
	{ TV_FOOD,SV_FOOD_STRANGE_BEAN ,500,
	{ 0,0,0,0,250,250,250,0 } },

	//チョウセンアサガオの葉
	{ TV_FOOD,SV_FOOD_DATURA ,100,
	{ 0,0,0,0,50,0,25,-50 } },

	//たいまつ(燃料切れだと材料として使えないようにしておく?)
	{TV_LITE,SV_LITE_TORCH,5,
	{0,0,3,0,0,0,1,0}},
	//油つぼ
	{TV_FLASK,SV_FLASK_OIL,5,
	{0,0,5,-2,0,0,0,0}},

	//蠱毒皿
	{ TV_SOUVENIR,SV_SOUVENIR_KODOKUZARA,30000,
	{ 0,0,0,0,1000,-1000,1000,0 } },

	//蜂蜜
	{ TV_SWEETS,SV_SWEETS_HONEY ,500,
	{ 0,0,0,0,200,200,300,300 } },

	{0,0,0,{0,0,0,0,0,0,0,0}} //終端用ダミー
};



/*:::薬師の合成表
 * {生成品TV,生成品SV,基本難易度,
 * {酸,電,火,冷,毒,回復,変容,精神必要属性値,
  * 基本コスト,最大生成数,固定必要素材TV,固定必要素材SV}
*/
 //ダミー除いて63種まで登録できるはず
 //一番下が優先されるので特殊材料を優先したければ下へ
 //この順番は既作フラグに使うので挿入するとセーブデータ互換性がおかしくなる
const drug_compound_type drug_compound_table[] =
{
	{TV_MATERIAL,SV_MATERIAL_COAL,0,{0,0,0,0,0,0,0,0},10000,1,0,0}, //炭　始点用ダミー兼失敗用

	//透明体視認の薬
	{TV_POTION,SV_POTION_DETECT_INVIS,50,
	{0,0,0,4,0,4,4,0},
	80,5,0,0},
	//耐火の薬
	{TV_POTION,SV_POTION_RESIST_HEAT,60,
	{0,0,12,0,0,0,5,0},
	100,7,0,0},
	//耐冷の薬
	{TV_POTION,SV_POTION_RESIST_COLD,60,
	{0,0,0,12,0,0,5,0},
	100,7,0,0},
	//強酸
	{TV_COMPOUND,SV_COMPOUND_STRONG_ACID,65,
	{25,0,0,0,0,0,0,0},
	300,6,0,0},
	//狂戦士化の薬
	{TV_POTION,SV_POTION_BESERK_STRENGTH,63,
	{0,0,20,-1,3,0,0,10},
	250,4,0,0},
	//スピードの薬
	{TV_POTION,SV_POTION_SPEED,70,
	{-20,20,0,0,-2,0,10,3},
	200,6,0,0},
	//猛毒の薬
	{TV_POTION,SV_POTION_POISON2,67,
	{0,0,0,0,50,-20,0,0},
	320,4,0,0},


	//幸福薬
	{TV_COMPOUND,SV_COMPOUND_HAPPY,60,
	{0,0,0,0,0,0,20,-20},
	400,5,0,0},
	//耐性の薬
	{TV_POTION,SV_POTION_RESISTANCE,90,
	{5,5,5,5,5,0,20,0},
	500,3,0,0},
	//筋肉増強剤
	{TV_COMPOUND,SV_COMPOUND_MUSCLE_DRUG,77,
	{0,0,10,0,0,30,30,0},
	800,5,0,0},
	//火吹き薬
	{TV_COMPOUND,SV_COMPOUND_BREATH_OF_FIRE,85,
	{0,0,100,0,0,0,20,0},
	700,4,0,0},
	//体力回復の薬
	{TV_POTION,SV_POTION_HEALING,110,
	{0,0,0,0,-30,100,0,10},
	500,4,0,0},
	//人魚薬
	{TV_COMPOUND,SV_COMPOUND_NINGYO,90,
	{100,0,0,0,100,0,200,-100},
	1000,1,0,0},
	//ゲルセミウム・エレガンスのお茶
	{TV_COMPOUND,SV_COMPOUND_GELSEMIUM_TEA,75,
	{0,0,0,0,300,-100,0,0},
	500,4,TV_MATERIAL,SV_MATERIAL_GELSEMIUM},
	//ジキル博士の薬
	{TV_COMPOUND,SV_COMPOUND_JEKYLL,80,
	{0,50,0,0,50,-50,100,-50},
	700,4,0,0},

	//胡蝶夢丸ナイトメアタイプ(液状)
	{TV_COMPOUND,SV_COMPOUND_NIGHTMARE,100,
	{30,30,30,30,100,0,0,-100},
	500,6,0,0},
	//サイバイマン
	{TV_COMPOUND,SV_COMPOUND_SAIBAIMAN,120,
	{100,0,0,0,0,200,150,0},
	700,3,0,0},
	//爆発の薬
	{TV_POTION,SV_POTION_DETONATIONS,115,
	{100,20,300,0,0,0,0,0},
	2000,3,0,0},
	//国士無双の薬
	{TV_COMPOUND,SV_COMPOUND_KOKUSHI,110,
	{30,30,30,30,30,30,30,30},
	1600,4,0,0},

	//*栄養剤*
	{TV_COMPOUND,SV_COMPOUND_STAR_FEEDING,118,
	{-5,-5,-5,-5,20,100,100,0},
	2400,3,0,0},
	//獣化薬
	{TV_COMPOUND,SV_COMPOUND_METAMOR_BEAST,132,
	{0,50,50,0,0,100,400,-50},
	2000,3,0,0},
	//惚れ薬
	{TV_POTION,SV_POTION_LOVE,130,
	{0,100,0,0,-100,0,100,300},
	3000,3,0,0},
	//何か涼しくなる薬
	{TV_POTION,SV_POTION_NANIKASUZUSHIKUNARU,125,
	{0,0,0,1000,300,0,0,-100},
	8000,3,0,0},

	//啓蒙の薬 レシピなし
	{TV_POTION,SV_POTION_ENLIGHTENMENT,120,
	{0,0,0,0,0,0,-100,300},
	3000,3,0,0},

	//経験の薬
	{TV_POTION,SV_POTION_EXPERIENCE,140,
	{0,0,0,0,0,500,-300,500},
	10000,1,0,0},
	//ミクロオキシゲン
	{TV_COMPOUND,SV_COMPOUND_MICRO_OCSIGEN,150,
	{200,200,200,200,200,200,200,0},
	15000,3,0,0},
	//*爆発*の薬
	{TV_COMPOUND,SV_COMPOUND_STAR_DETORNATION,156,
	{200,0,750,-200,0,0,100,0},
	12000,4,0,0},
	//時空消滅内服液
	{TV_COMPOUND,SV_COMPOUND_YOKOSHIMA,162,
	{0,0,0,0,300,0,200,-500},
	8000,3,0,0},
	//巨人の薬
	{TV_COMPOUND,SV_COMPOUND_TITAN,166,
	{0,0,0,0,0,500,1200,0},
	10000,2,0,0},
	//人も兎もイチコロリの薬
	{TV_COMPOUND,SV_COMPOUND_ICHIKORORI,170,
	{0,0,0,0,1200,-1200,0,-300},
	20000,2,0,0},
	//紺珠の薬
	{TV_POTION,SV_POTION_INVULNERABILITY,180,
	{0,0,0,0,0,0,0,1500},
	100000,1,0,0},

	//反物質 レシピなし
	{TV_COMPOUND,SV_COMPOUND_ANTIMATTER,170,
	{-300,-300,-300,-300,-300,0,1000,0},
	10000,3,0,0},
	//新加速薬 レシピなし
	{TV_COMPOUND,SV_COMPOUND_SUPER_SPEED,175,
	{0,700,0,700,0,0,700,700},
	20000,2,0,0},
	//竜化薬 レシピなし
	{TV_COMPOUND,SV_COMPOUND_METAMOR_DRAGON,180,
	{0,500,500,500,0,0,1200,500},
	15000,2,TV_MATERIAL,SV_MATERIAL_DRAGONNAIL},

	//火炎瓶
	{TV_COMPOUND,SV_COMPOUND_MOLOTOV_COCKTAIL,40,
	{0,0,7,-2,0,0,1,0},
	100,1,TV_FLASK,SV_FLASK_OIL},

	//生命の薬
	{TV_POTION,SV_POTION_LIFE,160,
	{100,100,100,100,-100,400,0,150},
	10000,2,TV_MATERIAL,SV_MATERIAL_MERCURY},

	//黄金の蜂蜜酒 レシピなし
	{TV_ALCOHOL,SV_ALCOHOL_GOLDEN_MEAD,165,
	{0,0,0,500,0,0,300,300},
	30000,2,TV_POTION,SV_POTION_RESISTANCE},

	//蓬莱の薬 レシピなし
	{TV_COMPOUND,SV_COMPOUND_HOURAI,200,
	{0,0,0,0,0,-1600,800,1600},
	100000,1,0,0},

	//v1.1.94 破滅の薬を追加
	{ TV_POTION,SV_POTION_RUINATION,130,
	{ 0,0,0,0,0,-250,250,-250 },
		2500,3,0,0 },





	{0,0,0,{0,0,0,0,0,0,0,0},0,0,0,0} //終端用ダミー
};


/*:::秘伝書テーブル 配列添字が0-7は1冊目、8-15は2冊目・・となる*/
//あくまでレシピ参照用なので合成テーブル変えたら全て検証し直す必要が
const drug_recipe_type drug_recipe_table[32] =
{
	//一巻
	//火炎瓶
	{TV_COMPOUND,SV_COMPOUND_MOLOTOV_COCKTAIL,
		TV_FLASK,SV_FLASK_OIL,TV_LITE,SV_LITE_TORCH,0,0},
	//透明視認
	{TV_POTION,SV_POTION_DETECT_INVIS,
		TV_POTION,SV_POTION_CURE_CRITICAL,TV_POTION,SV_POTION_INFRAVISION,0,0},
	//耐火
	{TV_POTION,SV_POTION_RESIST_HEAT,
		TV_MUSHROOM,SV_MUSHROOM_MON_RED,TV_POTION,SV_POTION_INFRAVISION,0,0},
	//耐冷
	{TV_POTION,SV_POTION_RESIST_COLD,
		TV_MUSHROOM,SV_MUSHROOM_MON_WHITE,TV_POTION,SV_POTION_INFRAVISION,0,0},
	//強酸
	{TV_COMPOUND,SV_COMPOUND_STRONG_ACID,
		TV_MUSHROOM,SV_MUSHROOM_MON_BLACK,0,0,0,0},
	//狂戦士化
	{TV_POTION,SV_POTION_BESERK_STRENGTH,
		TV_POTION,SV_POTION_RES_STR,TV_MUSHROOM,SV_MUSHROOM_CURE_PARANOIA,TV_MUSHROOM,SV_MUSHROOM_POISON},
	//スピード
	{TV_POTION,SV_POTION_SPEED,
		TV_POTION,SV_POTION_CURE_CRITICAL,TV_POTION,SV_POTION_RES_INT,TV_POTION,SV_POTION_RES_DEX},
	//猛毒
	{TV_POTION,SV_POTION_POISON2,
		TV_MUSHROOM,SV_MUSHROOM_POISON,TV_MUSHROOM,SV_MUSHROOM_POISON,0,0},

	//二巻
	//幸福薬
	{TV_COMPOUND,SV_COMPOUND_HAPPY,
		TV_MUSHROOM,SV_MUSHROOM_HALLUCINATION,0,0,0,0},
	//耐性
	{TV_POTION,SV_POTION_RESISTANCE,
		TV_MUSHROOM,SV_MUSHROOM_PARANOIA,TV_MUSHROOM,SV_MUSHROOM_CONFUSION,0,0},
	//筋肉増強剤
	{TV_COMPOUND,SV_COMPOUND_MUSCLE_DRUG,
		TV_MUSHROOM,SV_MUSHROOM_CURE_SERIOUS,TV_POTION,SV_POTION_RESIST_HEAT,TV_POTION,SV_POTION_RESIST_COLD},
	//火吹き薬
	{TV_COMPOUND,SV_COMPOUND_BREATH_OF_FIRE,
		TV_MUSHROOM,SV_MUSHROOM_BERSERK,TV_MUSHROOM,SV_MUSHROOM_MON_RED,0,0},
	//体力回復薬
	{TV_POTION,SV_POTION_HEALING,
		TV_POTION,SV_POTION_CURING,TV_POTION,SV_POTION_CURING,0,0},
	//人魚薬
	{TV_COMPOUND,SV_COMPOUND_NINGYO,
		TV_COMPOUND,SV_COMPOUND_STRONG_ACID,TV_COMPOUND,SV_COMPOUND_HAPPY,TV_POTION,SV_POTION_POLYMORPH},
	//ゲルセミウム茶
	{TV_COMPOUND,SV_COMPOUND_GELSEMIUM_TEA,
		TV_MATERIAL,SV_MATERIAL_GELSEMIUM,0,0,0,0},
	//ジキル薬
	{TV_COMPOUND,SV_COMPOUND_JEKYLL,
		TV_POTION,SV_POTION_POISON2,TV_POTION,SV_POTION_LOSE_MEMORIES,0,0},

	//三巻
	//胡蝶夢丸ナイトメア
	{TV_COMPOUND,SV_COMPOUND_NIGHTMARE,
		TV_MATERIAL,SV_MATERIAL_MERCURY,TV_POTION,SV_POTION_NEO_TSUYOSHI,0,0},
	//サイバイマン
	{TV_COMPOUND,SV_COMPOUND_SAIBAIMAN,
		TV_POTION,SV_POTION_HEALING,TV_COMPOUND,SV_COMPOUND_STRONG_ACID,TV_COMPOUND,SV_COMPOUND_MUSCLE_DRUG},
	//爆発
	{TV_POTION,SV_POTION_DETONATIONS,
		TV_COMPOUND,SV_COMPOUND_STRONG_ACID,TV_COMPOUND,SV_COMPOUND_BREATH_OF_FIRE,TV_POTION,SV_POTION_SPEED},
	//国士無双
	{TV_COMPOUND,SV_COMPOUND_KOKUSHI,
		TV_MUSHROOM,SV_MUSHROOM_MANA,TV_POTION,SV_POTION_RESISTANCE,0,0},
	//*肥料*
	{TV_COMPOUND,SV_COMPOUND_STAR_FEEDING,
		TV_POTION,SV_POTION_HEALING,TV_POTION,SV_POTION_POLYMORPH,0,0},
	//獣化薬
	{TV_COMPOUND,SV_COMPOUND_METAMOR_BEAST,
		TV_MATERIAL,SV_MATERIAL_TAKAKUSAGORI,TV_POTION,SV_POTION_POISON2,0,0},
	//惚れ薬
	{TV_POTION,SV_POTION_LOVE,
		TV_POTION,SV_POTION_RESTORE_MANA,TV_MATERIAL,SV_MATERIAL_HIKARIGOKE,TV_MUSHROOM,SV_MUSHROOM_MON_BLUE},
	//なにか涼しくなる薬
	{TV_POTION,SV_POTION_NANIKASUZUSHIKUNARU,
		TV_MATERIAL,SV_MATERIAL_ICESCALE,TV_POTION,SV_POTION_POISON2,TV_POTION,SV_POTION_POISON2},

	//最終巻
	//経験
	{TV_POTION,SV_POTION_EXPERIENCE,
		TV_MATERIAL,SV_MATERIAL_HOPE_FRAGMENT,TV_POTION,SV_POTION_SELF_KNOWLEDGE,0,0},
	//ミクロオキシゲン
	{TV_COMPOUND,SV_COMPOUND_MICRO_OCSIGEN,
		TV_MATERIAL,SV_MATERIAL_DRAGONSCALE,TV_COMPOUND,SV_COMPOUND_KOKUSHI,0,0},
	//*爆発*の薬
	{TV_COMPOUND,SV_COMPOUND_STAR_DETORNATION,
		TV_POTION,SV_POTION_DETONATIONS,TV_COMPOUND,SV_COMPOUND_STRONG_ACID,TV_MUSHROOM,SV_MUSHROOM_MON_RED},
	//生命の薬
	{TV_POTION,SV_POTION_LIFE,
		TV_MATERIAL,SV_MATERIAL_MERCURY,TV_MATERIAL,SV_MATERIAL_HOPE_FRAGMENT,0,0},
	//時空消滅内服液
	{TV_COMPOUND,SV_COMPOUND_YOKOSHIMA,
		TV_POTION,SV_POTION_RUINATION,TV_MATERIAL,SV_MATERIAL_NIGHTMARE_FRAGMENT,0,0},

	//巨人の薬
	{TV_COMPOUND,SV_COMPOUND_TITAN,
		TV_COMPOUND,SV_COMPOUND_STAR_FEEDING,TV_POTION,SV_POTION_POLYMORPH,TV_COMPOUND,SV_COMPOUND_KOKUSHI},

	//人も兎もイチコロリの薬
	{TV_COMPOUND,SV_COMPOUND_ICHIKORORI,
		TV_POTION,SV_POTION_DEATH,TV_MATERIAL,SV_MATERIAL_GELSEMIUM,0,0},
	//紺珠の薬
	{TV_POTION,SV_POTION_INVULNERABILITY,
		TV_MATERIAL,SV_MATERIAL_IZANAGIOBJECT,TV_POTION,SV_POTION_ENLIGHTENMENT,TV_POTION,SV_POTION_SELF_KNOWLEDGE},

};





/*:::エクストラクエスト報酬テーブル*/
//level,a_idx,tv,sv,am_mode,num
ex_quest_rew_type ex_quest_reward_table[] =
{
	//オーククエ　隠れ蓑、火炎の指輪、体力回復薬、スピード薬
	{10,0,TV_CLOAK,SV_CLOAK_STEALTH,(AM_NO_FIXED_ART | AM_GOOD),1},
	{10,0,TV_RING,SV_RING_FLAMES,(AM_NO_FIXED_ART | AM_GOOD),1},
	{10,0,TV_CHEST,SV_CHEST_MARIPO_03,0L,1},
	{10,0,TV_CHEST,SV_CHEST_MARIPO_07,0L,1},

	//ミミック　麻痺知らず指輪、高級リボン、岩石溶解棒
	{20,0,TV_RING,SV_RING_FREE_ACTION,(AM_NO_FIXED_ART | AM_GOOD),1},
	{20,0,TV_RIBBON,SV_RIBBON,(AM_NO_FIXED_ART | AM_GOOD | AM_GREAT),1},
	{20,0,TV_CHEST,SV_CHEST_MARIPO_04,0L,1},

	//幽霊洋館　全感知ロッド、アウェイ棒、耐混乱指輪
	{30,0,TV_ROD,SV_ROD_DETECTION,0L,1},
	{30,0,TV_CHEST,SV_CHEST_MARIPO_05,0L,1},
	{30,0,TV_RING,SV_RING_RES_CONFUSION,(AM_NO_FIXED_ART | AM_GOOD),1},

	//宝物庫　耐毒指輪、肉体強化指輪、スピロッド
	{40,0,TV_CHEST,SV_CHEST_MARIPO_12,0L,1},
	{40,0,TV_CHEST,SV_CHEST_BYAKUREN,0L,1},
	{40,0,TV_ROD,SV_ROD_SPEED,0L,1},

	//クローン　報酬箱、薬箱、耐カオス指輪
	//v1.1.96 鑑定ロッド追加
	{50,0,TV_CHEST,SV_CHEST_CLONE,0L,1},
	{50,0,TV_CHEST,SV_CHEST_EIRIN,0L,1},
	{50,0,TV_RING,SV_RING_RES_CHAOS,(AM_NO_FIXED_ART | AM_GOOD),1},
	{50,0,TV_ROD,SV_ROD_IDENTIFY,0L,1 },

	//古い城　報酬箱、妖刀箱、破壊の杖
	{60,0,TV_CHEST,SV_CHEST_OLDCASTLE,0L,1},
	{60,0,TV_CHEST,SV_CHEST_MARIPO_14,0L,1},
	{60,0,TV_CHEST,SV_CHEST_MARIPO_19,0L,1},

	//フラン　増強の薬*2、テレパスアミュ、四冊目
	{70,0,TV_POTION,SV_POTION_AUGMENTATION,0L,2},
	{70,0,TV_AMULET,SV_AMULET_TELEPATHY,(AM_NO_FIXED_ART | AM_GOOD),1},
	{70,0,TV_CHEST,SV_CHEST_SATORI,0L,1},

	//仙人　破邪アミュ箱、羽衣箱、スピリン箱
	{80,0,TV_CHEST,SV_CHEST_GRASSROOT,0L,1},
	{80,0,TV_CHEST,SV_CHEST_MARIPO_23,0L,1},
	{80,0,TV_CHEST,SV_CHEST_FAIRY,0L,1},

	//エリック　審判の宝石、アンバー冠、剣竜の鎧、宝箱
	{90,ART_JUDGE,0,0,0L,1},
	{90,ART_AMBER,0,0,0L,1},
	{90,0,TV_CHEST,SV_CHEST_HECATIA,0L,1},
	{90,0,TV_CHEST,SV_CHEST_SEIJA,0L,1},


	{0,0,0,0,(0L),0}, //終端ダミー

};



/*:::銃基礎パラメータテーブル 配列添字が銃svalに対応*/
//object_prep()したときこれらの数値をobject_type値内に格納し、ACT_GUN_VARIABLEによって射撃したときこれらの効果が出る
//エゴや☆のときこの値を基本として書き換える
//GFType,ProjectType,charge,bullets

//注：charge*bullets値が32以下にならないといけない。詳細はdo_cmd_fire_gun_aux()
const gun_base_param_type gun_base_param_table[SV_FIRE_GUN_MAX+1] =
{
	{GF_ARROW,GUN_FIRE_MODE_DEFAULT,0,1}, //始点用ダミー
	{GF_MISSILE,GUN_FIRE_MODE_BOLT,2,7}, //ルナティックガン
	{GF_ARROW,GUN_FIRE_MODE_DEFAULT,8,1}, //猟銃
	{GF_ARROW,GUN_FIRE_MODE_DEFAULT,3,6}, //拳銃
	{GF_ARROW,GUN_FIRE_MODE_DEFAULT,6,4}, //歩兵銃

	{GF_ARROW,GUN_FIRE_MODE_DEFAULT,3,6}, //進化する銃
	{GF_ARROW,GUN_FIRE_MODE_DEFAULT,8,1}, //マスケット銃

	{GF_SHARDS,GUN_FIRE_MODE_BREATH,7,1}, //散弾銃
	{GF_ARROW,GUN_FIRE_MODE_DEFAULT,4,5}, //マグナム
	{GF_LITE,GUN_FIRE_MODE_BEAM,6,3}, //光線銃
	{GF_ROCKET,GUN_FIRE_MODE_ROCKET,12,1}, //ロケラン
	{GF_MISSILE,GUN_FIRE_MODE_BOLT,6,4 }, //v1.1.98 ルナティックガン改

};



//GF_XXXと属性名日本語を対応付ける。重複はないほうがいい
const cptr gf_desc_name[MAX_GF] =
{
#ifdef JP
	"(なし)",
	"電撃","毒","酸","冷気","火炎",
	"(未設定)","(未設定)","(未設定)","光の剣","無",
	"射撃","プラズマ","魔法吹雪","水","閃光",
	"暗黒","弱閃光","弱暗黒","魔法雷雲","破片",
	"轟音","混乱","気","遅鈍","酸の沼",
	"魔力","隕石","極寒","毒の沼","カオス",
	//30
	"地獄","劣化","因果混乱","時間逆転","重力",
	"攻撃低下","防御低下","魔法低下","全能力低下","岩石溶解",
	"ドア破壊","罠破壊","移動禁止","狂化","スーパーエゴ",
	"ドア生成","罠生成","森林生成","石油採掘","酒",
	"クローン","チェンジ","回復モンスター","加速","減速",
	"混乱","睡眠","生命力吸収","落下","トラップ発動",
	//60
	"死者アウェイ","邪悪アウェイ","テレポアウェイ","死者恐怖","邪悪恐怖",
	"恐怖","アンデッド退散","聖浄","力","悪魔退散",
	"生命ダメージ","ロケット","核熱","ルーン生成","金縛り",
	"石壁生成","死の光線","朦朧","浄化","地獄の劫火",
	"分解","魅了","死者魅了","動物魅了","精神波動",
	"精神吸収","テレキネシス","施錠","精神支配","善良ダメージ",
	//90
	"魔力吸収","精神攻撃","脳攻撃","呪い1","呪い2",
	"呪い3","呪い4","破滅の手","捕獲","死者復活",
	"生者魅了","鑑識","(通常攻撃)","幻惑","抹殺",
	"撮影","悪魔魅了","溶岩生成","血の呪い","シーカーレイ",
	"スーパーレイ","*体力回復*","水生成","聖戦","邪悪束縛",
	"呪い","空間歪曲","コズミックホラー","破邪1","破邪2",
	//120
	"破邪3","破邪4","汚染","風","きゅっとしてドカーン",
	"風の刃","物理的狂気","死神","足がらめ","怨霊憑依",
	"ソウルスティール","悪夢","電車","妖怪退散","ノーザンウィナー",
	"赤蛮奇1","N.E.P","宝塔ビーム","赤蛮奇2","説得",
	"第三の目","花畑生成","面変化","モーゼ","レッドマジック",
	"グングニル","ドア変化","竜束縛","犬馴らし","蛇馴らし",
	//150
	"鳥馴らし","蜘蛛の巣生成","皿投げ","ブレイジングスター","ソウルスカルプチュア",
	"厄","蒸気","清蘭ビーム","純化","特殊射撃"
	//161～
	,"六根清浄斬","生物停止","狂気の松明","精神攻撃","虹","魚魅了","要石ミサイル","聖水"
#else
    "(none)",
	"lightning","poison","acid","frost","fire",
	"(undefined)","(undefined)","(undefined)","Psycho-Spear","non-elemental",
	"arrow","plasma","magic blizzard","water","light",
	"darkness","weak light","weak darkness","magic thunderclouds","shards",
	"sound","confusion","ki","inertia","acid pool",
	"mana","meteor","ice","poison pool","chaos",
	//30
	"nether","disenchantment","nexus","time","gravity",
	"lower attack","lower defense","lower magic","lower all","stone to mud",
	"door destruction","trap destruction","stop movement","berserk","superego",
	"door creation","trap creation","forest creation","oil excavation","alcohol",
	"clone","polymorph","heal monster","haste","slowness",
	"confusion","sleep","drain life","falling down","activate traps",
	//60
	"teleport undead","teleport evil","teleport away","turn undead","turn evil",
	"terrify","banish undead","holy energy","power","banish demon",
	"hurt living","rocket","nuclear heat","rune creation","stasis",
	"wall creation","death ray","stun","purification","hellfire",
	"disintegration","charm","charm undead","charm animal","psi wave",
	"mind drain","telekinesis","lock","mind control","hurt good",
	//90
	"mana drain","mental attack","brain attack","curse 1","curse 2",
	"curse 3","curse 4","hand of doom","capture","animate dead",
	"charm living","identify","(normal attack)","mesmerize","banishment",
	"photo","charm demon","lava creation","blood curse","seeker ray",
	"super ray","*healing*","water creation","holy battle","bind evil",
	"curse","spatial distortion","cosmic horror","exorcism 1","exorcism 2",
	//120
	"exorcism 3","exorcism 4","pollution","wind","kyuu and boom",
	"wind blade","physical madness","shinigami","entangle","vengeful spirit possession",
	"soul steal","nightmare","train","banish youkai","northern winner",
	"sekibanki 1","N.E.P","pagoda beam","sekibanki 2","lecture",
	"third eye","flower creation","mask change","moses","red magic",
	"gungnir","door creation","bind dragon","train dog","train snake",
	//150
	"train bird","spiderweb","throw plate","blazing star","soul sculpture",
	"misfortune","steam","seiran beam","purification","special attack"
	//161～
	,"clearing six senses","stop living","light of insanity","mind attack","rainbow","charm fish","keystone missile","holy water"
#endif
};


/*:::怪異「異界との接触」の地形フラグとモンスターの対応表　上ほど優先度が高い*/
occult_contact_type occult_contact_table[] =
{
#ifdef JP
	{FF_PATTERN,0,			0,		MON_LESSER_O_G,	"「パターン」が火花を散らし、"},//レッサーアザーゴッド　パターン
	{FF_OPEN,	FF_DROP,	0,		MON_FLUTIST,"カーテンが開き"},//フルート奏者　カーテン
	{FF_WATER,	FF_DEEP,	0,		MON_SPAWN_CTH,	"仄暗い水の底から"},//クトゥルフの落とし子　深い水
	{FF_DOOR,	0,			0,		MON_TINDALOS,	"ドア枠の角から"},//ティンダロス　ドア
	{FF_TREE,	0,			0,		MON_SPAWN_SHUB,"木々の間から"},//シュブ=ニグラスの黒い仔山羊：森

	{FF_SHAFT,	0,			0,		MON_SHOGGOTH,"暗い坑道の奥から"},//ショゴス：坑道
	{FF_TRAP,	FF_MORE,	0,		MON_FLYING_POLYP,"落とし戸の奥から"},//盲目のもの　落とし戸と階段
	{FF_STAIRS,	FF_MORE,	0,		MON_FLYING_POLYP,"階段の下から"},
	{FF_WATER,	FF_DEEP,	0,		MON_DEEP_ONE,	"仄暗い水の底から"},//深きもの　深い水

	{FF_CAN_DIG,	0,		0,		MON_LLOIGOR,"岩の隙間から"},//ロイガー：岩
	{FF_LAVA,	FF_DEEP,	0,		MON_CHTHONIAN,"溶岩の中から"},//クトーニアン：深い溶岩
	//v1.1.85
	{ FF_ACID_PUDDLE,	FF_DEEP,	0,		MON_DHOLE,"酸を滴らせながら" },//ドール：深い酸
	{ FF_ELEC_PUDDLE,	FF_DEEP,	0,		MON_LLOIGOR,"雷雲が渦を巻き、" },//ロイガー：深い雷雲
	{ FF_COLD_PUDDLE,	FF_DEEP,	0,		MON_GNOPH_KEH,"吹雪の中から" },//グノフケー：深い吹雪
	{ FF_POISON_PUDDLE,	FF_DEEP,	0,		MON_SHOGGOTH,"汚泥の中から" },//ショゴス：深い毒沼

	{FF_MOUNTAIN,	0,		0,		MON_NIGHTGAUNT,	"山のほうから影のようなものが飛来し、"},//夜鬼：山
	{FF_MOUNTAIN,	0,		0,		MON_MI_GO,	"山から吹く風に乗って"},//ミ＝ゴウ：山
	{FF_CAN_FLY,	0,		FF_MOVE,MON_COLOUR_OUTOFSPACE	,"暗い穴の中から"},//異次元の色彩：暗い穴　この条件は山も当てはまるので山の下に
#else
    {FF_PATTERN,0,			0,		MON_LESSER_O_G,	"as the Pattern bursts into sparks"},//レッサーアザーゴッド　パターン
	{FF_OPEN,	FF_DROP,	0,		MON_FLUTIST,"as the curtain opens up"},//フルート奏者　カーテン
	{FF_WATER,	FF_DEEP,	0,		MON_SPAWN_CTH,	"from the dark depths of water"},//クトゥルフの落とし子　深い水
	{FF_DOOR,	0,			0,		MON_TINDALOS,	"out of corner of the doorframe"},//ティンダロス　ドア
	{FF_TREE,	0,			0,		MON_SPAWN_SHUB,"from the trees"},//シュブ=ニグラスの黒い仔山羊：森

	{FF_SHAFT,	0,			0,		MON_SHOGGOTH,"from the depths of the shaft"},//ショゴス：坑道
	{FF_TRAP,	FF_MORE,	0,		MON_FLYING_POLYP,"out of the trapdoor"},//盲目のもの　落とし戸と階段
	{FF_STAIRS,	FF_MORE,	0,		MON_FLYING_POLYP,"from the downward staircase"},
	{FF_WATER,	FF_DEEP,	0,		MON_DEEP_ONE,	"from the dark depths of water"},//深きもの　深い水

	{FF_CAN_DIG,	0,		0,		MON_LLOIGOR,"from gaps between stones"},//ロイガー：岩
	{FF_LAVA,	FF_DEEP,	0,		MON_CHTHONIAN,"from the molten lava"},//クトーニアン：深い溶岩
	//v1.1.85
	{ FF_ACID_PUDDLE,	FF_DEEP,	0,		MON_DHOLE,"dripping acid" },//ドール：深い酸
	{ FF_ELEC_PUDDLE,	FF_DEEP,	0,		MON_LLOIGOR,"as the thunderclouds swirl" },//ロイガー：深い雷雲
	{ FF_COLD_PUDDLE,	FF_DEEP,	0,		MON_GNOPH_KEH,"from the blizzard" },//グノフケー：深い吹雪
	{ FF_POISON_PUDDLE,	FF_DEEP,	0,		MON_SHOGGOTH,"from the polluted pool" },//ショゴス：深い毒沼

	{FF_MOUNTAIN,	0,		0,		MON_NIGHTGAUNT,	"as a shadowy figure from the mountains"},//夜鬼：山
	{FF_MOUNTAIN,	0,		0,		MON_MI_GO,	"riding winds blowing from the mountains"},//ミ＝ゴウ：山
	{FF_CAN_FLY,	0,		FF_MOVE,MON_COLOUR_OUTOFSPACE	,"from the dark chasm"},//異次元の色彩：暗い穴　この条件は山も当てはまるので山の下に
#endif

	{0,0,0,0,_("終端用ダミー","dummy terminator")},//r_idxが0ならループ終了
};

//v1.1.21
/*:::兵士がレベルアップで習得する技能の一覧*/
soldier_skill_type soldier_skill_table[SOLDIER_SKILL_ARRAY_MAX][SOLDIER_SKILL_NUM_MAX+1]=
{
	{	//射撃技能
		{0,_("射撃技能", "Shooting Skills"),_("始端ダミー", "dummy")},//ダミーだがnameはダンプ出力時に使う
		{0,_("牽制射撃", "Restraining Shot"),
            _("レベル5以降に敵を短時間減速・混乱させる特技「牽制射撃」が使用可能になる。",
            "At level 5, lets you use 'Restraining Shot' special ability.\\It slows and confuses an enemy for a short period of time.")},
		{0,_("ホークアイ", "Hawkeye"),
            _("銃撃の成功率が上昇し、透明体視認の能力を得る。",
            "Raises shooting success rate and makes you able to see invisible.")},
		{0,_("ヘッドショット", "Headshot"),
            _("特技「ヘッドショット」が使用可能になる。",
            "Lets you use the 'Headshot' special ability.")},
		{0,_("クイックドロー", "Quick Draw"),
            _("銃による射撃に要する行動時間が25%短縮され、銃の装備変更に要する行動時間が50%短縮される。",
            "Reduces time spent for shooting by 25%, and reduces time spent for swapping gun equipment by 50%.")},
		{0,_("メンテナンス", "Maintenance"),
            _("装備中でない銃に対しても1/2の速度で装弾が行われるようになる。",
            "Non-equipped guns still will be reloaded at 1/2 rate.")},
		{0,_("連射技能", "Rapid Fire"),
            _("特技「ラピッドファイア」が使用可能になる。",
            "Lets you use the 'Rapid Fire' special ability.")},
		{35,_("ウェポンマスタリー", "Weapon Mastery"),
            _("射撃の命中率がさらに上昇し、\\片手で銃を持った時や銃を二つ装備したときのペナルティが低下する。",
            "Raises shooting accuracy, \\and reduces penalty for wielding a gun with one hand or dual-wielding guns.")},
		{40,_("インターセプター", "Interceptor"),
            _("自分に向けて放たれたボールやロケットを中確率で撃ち落とすようになる。\\ボルト・ビーム・ブレスには効果がない。ロケットランチャー以外の銃を装備しているときでないと使えない。",
            "Lets you shoot down balls/rockets fired at you with medium probability rate. \\Does not affect bolts/beams/breaths. Can only be used when wielding a non-rocket launcher gun.")},
		{45,_("ワンマンアーミー", "Army of One"),
            _("銃弾の補充が大幅に高速化される。",
            "Greatly increases ammo reloading rate.")},

	},
	{	//白兵技能
		{0,_("白兵技能", "Close Combat Skills"),_("始端ダミー", "dummy")},
		{0,_("短剣格闘術", "Short Blades Combat"),
            _("短剣の装備時と投擲時にダイスボーナスを得る。",
            "Grants dice boost when wielding/throwing short blades.")},
		{0,_("基礎体力向上", "Physical Enhancement"),
            _("腕力・器用・耐久力が+2される。",
            "Raises strength/dexterity/constitution by 2.")},
		{0,_("近接射撃技術", "Close-Range Shooting"),
            _("モンスターに至近距離で射撃したときクリティカルヒットが発生しやすくなる。",
            "Increases critical hit chance when shooting monsters at close range.")},
		{0,_("一撃離脱戦法", "Hit and Away Tactics"),
            _("隣接攻撃のあと一瞬で離脱する特技「ヒット＆アウェイ」を使用可能になる。",
            "Lets you use the 'Hit and Away' special ability.")},
		{0,_("戦地調達", "Battlefield Preparations"),
            _("敵を倒したときMPが回復するようになる。",
            "Recovers MP upon defeating enemies.")},
		{0,_("隠密行動技術", "Stealthy Movement"),
            _("隠密能力が上昇する。また眠っている敵に近接攻撃を行ったとき大ダメージを与えるようになる。",
            "Raises stealth. Also deals large damage with melee attacks upon sleeping enemies.")},
		{35,_("極限環境適応技術", "Extreme Environment Adaptation"),
            _("特技「全耐性」を使えるようになる。",
            "Lets you use the 'Resistance' special ability.")},
		{40,_("脳内物質操作", "Brain Chemistry Manipulation"),
            _("一時的に加速と狂戦士化と肉体強化を得る「アドレナリンコントロール」を使用可能になる。",
            "Lets you use the 'Adrenaline Control' special ability.\\It temporarily increases your speed, physical stats and makes you berserk.")},
		{45,_("リーサルウェポン", "Lethal Weapon"),
            _("ACと近接攻撃能力が上昇し、HP最大値が10%上昇し、近接攻撃回数が+1される。",
            "Raises AC and melee combat skills, increases maximum HP by 10%, increases amount of attacks in melee by 1.")},

	},
	{	//工作技能
		{0,_("工作技能", "Engineer Skills"),_("始端ダミー", "dummy")},
		{0,_("工作技術", "Engineer Technique"),
            _("解除・掘削技能が上昇する。\\またレベル5以降に特技「トラップ・ドア破壊」を使えるようになる。",
            "Increases disarming/tunnelling skills. \\At level 5, lets you use the 'Trap/Door Destruction' special ability.")},
		{0,_("調査技術", "Surveyance"),
            _("探索技能が上昇する。\\またレベル10になると「周辺調査」を使えるようになる。",
            "Increases searching skill. \\At level 10, lets you use the 'Survey Surroundings' special ability.")},
		{0,_("障害物製作技術", "Create Obstacles"),
            _("隣接した床一か所を岩石地形にする「バリケード設置」を使用可能になる。",
            "Lets you use the 'Set Up Barricade' special ability.\\It creates a pile of rubble on an adjacent open floor.")},
		{0,_("ポータル設置", "Set Up Portal"),
            _("フロアの床に二箇所までポータル地形を設置でき、ポータル間を移動できる。\\テレポート妨害の効果を受けない。\\三箇所目以降を設置しようとすると古いポータルから順に消える。",
            "Sets up to 2 portals on open floor that you can move between. \\Ignores teleportation prevention. \\Placing a third portal will remove your first.")},
		{0,_("爆破技術", "Landmine Technique"),
            _("爆弾を設置する。爆弾は10ゲームターン後に爆発し周囲に破片属性ダメージを与える。\\自分もダメージを受けるので注意。",
            "Sets up a bomb that explodes in 10 game turns, dealing shards damage to nearby area. \\Keep in mind you'll also take damage.")},
		{0,_("運用効率向上", "Improved Efficiency"),
            _("MP最大値が50%上昇する。",
            "Raises maximum MP by 50%.")},
		{35,_("メガクラッシュ", "Mega Crush"),
            _("周辺を*破壊*する。",
            "*Destroys* nearby area.")},
		{40,_("爆薬改良", "Improved Landmines"),
            _("爆弾の威力が1.5倍になり爆破半径が4グリッドになる。",
            "Increases bomb damage by 1.5x and makes explosion radius 4.")},
		{45,_("歩く火薬庫", "Walking Gunpowder Storage"),
            _("破片免疫を得る。また設置した爆弾をリモコン起爆できるようになる。",
            "Makes you immune to shards. Also lets you remotely detonate bombs you've set up.")},

	},
	{	//魔弾技能
		{0,_("魔弾技能", "Magic Bullet Skills"),_("始端ダミー", "dummy")},
		{0,_("狙撃手の眼", "Marksman's Eye"),
            _("レベル5で特技「スキャン・モンスター」が使えるようになる。\\また特技「索敵」の範囲が広がる。",
            "At level 5, lets you use the 'Scan Monster' special ability. \\Also increases area of 'Track Hostiles' special ability.")},
		{0,_("元素弾", "Elemental Ammo"),
            _("属性や特性を変更して射撃する「銃弾変更」の特技が使用可能になる。\\「火炎弾」「氷結弾」「電撃弾」「溶解弾」の四種の銃弾を使える。",
            "Lets you use the 'Switch Ammo' special ability. \\You can use 'Flaming ammo', 'Freezing ammo', 'Shocking ammo' and 'Melting ammo'.")},
		{0,_("魔道の知識", "Magic Knowledge"),
            _("知能と賢さが+2され、魔道具技能が少し上昇する。",
            "Increases intelligence and wisdom by 2 and slightly raises magic device use skill.")},
		{0,_("潜伏技能", "Infiltration"),
            _("水場や森にいるとき隠密技能が上昇する。\\このとき近接攻撃や射撃を行うとクリティカルヒット率が上昇する。",
            "Raises your stealth in water or forest terrain. \\Increases critical hit chance for melee and shooting attacks while in this state.")},
		{0,_("上位属性弾", "High Elemental Ammo"),
            _("特技「銃弾変更」に、\\「閃光弾」「吸血弾」「衝撃弾」「重力弾」が追加される。",
            "Lets you use 'Flash ammo', 'Vampiric ammo', 'Shockwave ammo' and 'Gravity ammo' as well.")},
		{0,_("狙撃技能", "Marksman Skill"),
            _("特技「精神集中」を習得する。",
            "Lets you use the 'Concentrate' special ability.")},
		{35,_("宝石弾", "Jewel Bullets"),
            _("素材系アイテムを弾丸にする「弾丸加工」の特技が使用可能になり、\\「銃弾変更」でこの弾丸を使用して強力な射撃をすることができる。",
            "Lets you use the 'Create Ammo' special ability to turn materials into ammo. \\This ammo can be used with 'Switch Ammo' to perform powerful shooting attacks.")},
		{40,_("ナイトビジョン", "Night Vision"),
            _("暗闇でも物が見られるようになる。\\暗闇で近接攻撃や銃による射撃を行ったときクリティカルヒット率が上昇する。\\視界に頼らないモンスターには効果が薄い。",
            "Makes you able to see in the dark. \\Increases critical hit chance for melee and shooting attacks while in darkness. \\Less effective against monsters not relying on sight.")},
		{45,_("魔弾の射手", "Freischutz"),
            _("射撃成功率と全ての射撃のクリティカルヒット判定値が大幅に増加する。\\またアーティファクト発動「魔弾の射手」が精神集中と周囲の敵の数に応じて強化される。",
            "Greatly raises shooting attack success rate and critical hit chance. \\Also, the 'Freischutz' artifact activation will increase in power\\based on your concentration state and amount of enemies nearby.")},

	},

};


/*:::兵士の弾丸換装テーブル*/
//配列添字はp_ptr->magic_num1[]の添字とSSM_***に一致し、残弾数の管理に使われる。
//cost,name,info,change_bullet,use_ammo
soldier_bullet_type soldier_bullet_table[] =
{
	{0,_("始端ダミー","initial dummy"),"",0},

	//他の特技のSSM_とダミー**
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},

	//11-14 火炎、氷結、電撃弾
	{8,_("火炎弾","fiery bullet"),_("威力2倍の火炎属性になる。","2x damage from fire"),SS_M_ELEM_BULLET},
	{8,_("氷結弾","icy bullet"),_("威力2倍の冷気属性になる。","2x damage from cold"),SS_M_ELEM_BULLET},
	{8,_("電撃弾","shocking bullet"),_("威力2倍の電撃属性になる。","2x damage from electricity"),SS_M_ELEM_BULLET},
	{8,_("溶解弾","acidic bullet"),_("威力2倍の酸属性になる。","2x double damage from acid"),SS_M_ELEM_BULLET},
	//15-18
	{24,_("閃光弾","flash bullet"),_("閃光に弱い敵に3倍のダメージを与え、部屋を明るくする半径2のロケットになる。","radius 2 rocket; 3x damage from light; lights room"),SS_M_HIGH_BULLET},
	{24,_("吸血弾","vampiric bullet"),_("生命力吸収属性のボルトになる。反射されない。","bolt; transfers health; can't be reflected"),SS_M_HIGH_BULLET},
	{24,_("衝撃弾","impact bullet"),_("轟音属性のビームになる。","stuns target"),SS_M_HIGH_BULLET},
	{24,_("重力弾","gravity bullet"),_("重力属性の半径2のボールになる。","radius 2 ball; can stun, slow, and teleport"),SS_M_HIGH_BULLET},
	//19-30予備
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},

	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	{0,_("ダミー","dummy"),"",0},
	//31-48宝石弾
	{0,_("猛毒弾","toxic bullet"),_("威力3倍の毒属性になる。","3x damage from poison"),SS_M_MATERIAL_BULLET},
	{0,_("獣殺しの弾丸","animal slayer"),_("獣に対して威力が3倍になりクリティカルヒット率が上昇する。\\ボルトでも反射されない。","3x damage to animals; increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("磁力弾","magnetic bullet"),_("無生物に対して威力が3倍になりクリティカルヒット率が上昇する。\\ボルトでも反射されない。","3x damage to nonliving; increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("破魔の弾丸","demon slayer"),_("妖怪・アンデッド・デーモンに対して威力が2倍になる。\\ボルトでも反射されない。","2x damage against youkai, undead, and demons; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("怨霊の弾丸","widow maker"),_("人間に対して威力が3倍になりクリティカルヒット率が大幅に上昇する。\\ボルトでも反射されない。","3x damage to humans; greatly increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("太陽の弾丸","bird shot"),_("飛行するモンスターに対して威力が2倍になりクリティカルヒット率が上昇する。\\ボルトでも反射されない。","2x damage to flying monsters; increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("銀の弾丸","silver bullet"),_("混沌の勢力に威力1.5倍、\\妖怪・アンデッド・デーモンに対して威力が3倍になる。\\クリティカルヒット率が上昇する。\\ボルトでも反射されない。","1.5x damage to chaotic forces; 3x damage against youkai, undead, and demons; increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("重量弾","heavy bullet"),_("威力2倍の通常の射撃になる。\\クリティカルヒット率が上昇する。反射されない。","2x damage; increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("ドラゴンブレス弾","dragon's breath bullet"),_("3倍の威力のブレスになる。","3x damage; acts like breath weapon"),SS_M_MATERIAL_BULLET},
	{0,_("水龍の弾丸","water dragon bullet"),_("威力3倍の極寒属性ロケットになる。","a frigid rocket with 3x damage"),SS_M_MATERIAL_BULLET},
	{0,_("竜殺しの弾丸","dragon slayer"),_("竜に対して威力が3倍になりクリティカルヒット率が大幅に上昇する。\\ボルトでも反射されない。","3x damage against dragons; greatly increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("神殺しの弾丸","god slayer"),_("神格に対して威力が3倍になりクリティカルヒット率が大幅に上昇する。\\ボルトでも反射されない。","3x damage against deities; greatly increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("悪夢の弾丸","nightmare bullet"),_("地獄の業火弱点のモンスターに対して威力が3倍になりクリティカルヒット率が上昇する。\\ボルトでも反射されない。","3x damage against holy monsters; greatly increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("聖なる弾丸","holy bullet"),_("威力3倍の破邪属性ロケットになる。","radius 2 racket; 3x damage"),SS_M_MATERIAL_BULLET},
	{0,_("真紅の弾丸","crimson bullet"),_("威力5倍の火炎属性ビームになる。","beam of fire; 5x damage"),SS_M_MATERIAL_BULLET},
	{0,_("金剛弾","diamond bullet"),_("威力4倍の光の剣属性のビームになる。","slashing light beam; 4x damage"),SS_M_MATERIAL_BULLET},
	{0,_("流星弾","meteor bullet"),_("威力4倍の通常射撃になる。\\クリティカルヒット率が大幅に上昇する。反射されない。","4x damage; significantly increased criticals; can't be reflected"),SS_M_MATERIAL_BULLET},
	{0,_("緋緋色金の弾丸", "scarlet gold bullet"),_("威力10倍の分解属性大型ビームになる。","disintegrating beam; 10x damage"),SS_M_MATERIAL_BULLET},




	{-1,_("終端ダミー","dummy terminator"),"",0},
};

/*:::兵士の弾丸作成テーブル*/
//SSM_*,mat_tval,mat_sval,prod_num
soldier_bullet_making_type soldier_bullet_making_table[] =
{
	{SSM_SLAY_ANIMAL,TV_MATERIAL,SV_MATERIAL_HEMATITE,1},
	{SSM_SLAY_NONLIV,TV_MATERIAL,SV_MATERIAL_MAGNETITE,1},
	{SSM_POIS,TV_MATERIAL,SV_MATERIAL_ARSENIC,2},
	{SSM_SILVER,TV_MATERIAL,SV_MATERIAL_MERCURY,2},
	{SSM_SILVER,TV_MATERIAL,SV_MATERIAL_MITHRIL,2},
	{SSM_HEAVY,TV_MATERIAL,SV_MATERIAL_ADAMANTITE,2},
	{SSM_BREATH,TV_MATERIAL,SV_MATERIAL_DRAGONNAIL,2},
	{SSM_SLAY_DRAGON,TV_MATERIAL,SV_MATERIAL_DRAGONSCALE,2},
	{SSM_POIS,TV_MATERIAL,SV_MATERIAL_GELSEMIUM,3},

	{SSM_SLAY_EVIL,TV_MATERIAL,SV_MATERIAL_GARNET,1},
	{SSM_SLAY_EVIL,TV_MATERIAL,SV_MATERIAL_AMETHYST,1},
	{SSM_SLAY_EVIL,TV_MATERIAL,SV_MATERIAL_AQUAMARINE,1},

	{SSM_DIAMOND,TV_MATERIAL,SV_MATERIAL_DIAMOND,1},

	{SSM_HOLY,TV_MATERIAL,SV_MATERIAL_EMERALD,1},
	{SSM_SLAY_ANIMAL,TV_MATERIAL,SV_MATERIAL_MOONSTONE,1},
	{SSM_RED,TV_MATERIAL,SV_MATERIAL_RUBY,1},
	{SSM_SLAY_FLYER,TV_MATERIAL,SV_MATERIAL_PERIDOT,1},
	{SSM_HOLY,TV_MATERIAL,SV_MATERIAL_SAPPHIRE,1},
	{SSM_SLAY_EVIL,TV_MATERIAL,SV_MATERIAL_OPAL,1},
	{SSM_SLAY_FLYER,TV_MATERIAL,SV_MATERIAL_TOPAZ,1},
	{SSM_SLAY_EVIL,TV_MATERIAL,SV_MATERIAL_LAPISLAZULI,1},

	{SSM_METEOR,TV_MATERIAL,SV_MATERIAL_METEORICIRON,1},
	{SSM_HIHIIROKANE,TV_MATERIAL,SV_MATERIAL_HIHIIROKANE,1},
	{SSM_ICE,TV_MATERIAL,SV_MATERIAL_ICESCALE,1},

	{SSM_NIGHTMARE,TV_MATERIAL,SV_MATERIAL_NIGHTMARE_FRAGMENT,1},
	{SSM_HOLY,TV_MATERIAL,SV_MATERIAL_HOPE_FRAGMENT,1},
	{SSM_SLAY_DEITY,TV_MATERIAL,SV_MATERIAL_IZANAGIOBJECT,1},
	{SSM_SLAY_HUMAN,TV_MATERIAL,SV_MATERIAL_ISHIZAKURA,1},
	{SSM_SLAY_EVIL,TV_MATERIAL,SV_MATERIAL_BROKEN_NEEDLE,1},
	{ SSM_SLAY_HUMAN,TV_MATERIAL,SV_MATERIAL_SKULL,1 },

	{ SSM_SLAY_DRAGON,TV_MATERIAL,SV_MATERIAL_RYUUZYU,3 },


	{0,0,0,0},//終端ダミー
};

torrent_quest_score_type torrent_quest_score_list[] =
{
	{300,CLASS_WAKASAGI,-1,_("わかさぎ姫", "Wakasagihime")},
	{600,CLASS_KOMACHI,-1,_("小野塚　小町", "Komachi Onozuka")},
	{1500,CLASS_NITORI,-1,_("河城　にとり", "Nitori Kawashiro")},
	{2400,CLASS_SHINMYOUMARU,CLASS_SHINMYOU_2,_("少名　針妙丸", "Shinmyoumaru Sukuna")},

};

//v1.1.32 クラスごと特殊性格
const player_seikaku seikaku_info_special[MAX_SEIKAKU_SPECIAL] =
{
	//ここは特殊性格を選択できないクラス用のダミー項目
	{
#ifdef JP
		"(専用性格未実装)",
		"(専用性格未実装)",
		"(Unimplemented)",
#else
		"(Unimplemented)",
		"(Unimplemented)",
#endif
		{  0,  0,  0,  0,  0,  0 },
		0,  0,  0,  0,  0,  0,  0,  0,
		0, 0
		,TRUE
		,TRUE
	},
	//v1.1.32 チルノ専用
	{
#ifdef JP
		"日焼けした",
		"日焼けした",
		"Sunburnt",
#else
		"Sunburnt",
		"Sunburnt",
#endif
		{  3,  3,  3,  3,  3,  3 },
		5,  5,  5,  0,  5,  5,  30,  30,
		5, 0
		,FALSE
		,TRUE
	},
	//v1.1.32b パチュリー専用
	{
#ifdef JP
		"書痴",
		"書痴",
		"Bibliomaniac",
#else
		"Bibliomaniac",
		"Bibliomaniac",
#endif
		{ -2,  2,  2,  -2,  -2,  0 },
		-5,  5,  5,  -2,  -5,  -5,  -50,  -50,
		-2, 1
		,FALSE
		,TRUE
	},
	//v1.1.34 成美専用
	{
#ifdef JP
		"理由なく好戦的な",
		"理由なく好戦的な",
		"Favorite",
#else
		"Aggressive",
		"Aggressive",
#endif
		{  1,  -1,  0,  1,  1,  0 },
		-20,  5,  -5,  -2,  -20,  0,  20,  20,
		2, 0
		,FALSE
		,TRUE
	},
	//v1.1.44 うどんげ専用
	{
#ifdef JP
		"夢の世界の",
		"夢の世界の",
		"Dreamdweller",
#else
		"Dreamdweller",
		"Dreamdweller",
#endif
		{ 1,  -1,  -1,  1,  1,  -1 },
		0,  0, 0, -2, 0,  0,  10,  10,
		0, 0
		,FALSE
		,TRUE
	},
	//v1.1.52 菫子専用
	{
#ifdef JP
		"悪夢に悩まされる",
		"悪夢に悩まされる",
		"Violet_Detector",
#else
		"Violet-Detector",
		"Violet-Detector",
#endif
		{ 0,  0,  0,  0,  0,  0 },
		0,  0, 0, 0, 0,  0,  0,  0,
		0, 0
		,FALSE
		,TRUE
	},
	//v1.1.59 針妙丸2専用
	{
#ifdef JP
		"意外に顔が広い",
		"意外に顔が広い",
		"Well_Connected",
#else
		"Well-Connected",
		"Well-Connected",
#endif
		{ 0,  0,  0,  0,  0,  3 },
		0,  0, 0, 0, 0,  0,  0,  0,
		0, 0
		,FALSE
		,TRUE
	},
	//v1.1.60 赤蛮奇専用
	{
#ifdef JP
		"スマホ首の",
		"スマホ首の",
		"Very_Long_Neck",
#else
		"Phone-Neck",
		"Phone-Neck",
#endif
		{ -2,  4,  4,  -2,  -2,  -4 },
		-4,  8, 0, -2, 0,  0,  -20,  -10,
		-3, 0
		,FALSE
		,TRUE
	},
	//v1.1.64 華扇専用
	{
#ifdef JP
		"奸佞邪智の鬼　",
		"奸佞邪智の鬼　",
		"Oni_Hermit",
#else
		"Cunning-Oni",
		"Cunning-Oni",
#endif
		{ -3,  4,  -1,  2,  -2,  -2 },
		5,  0,  5,  -3,  -5,  3,  10,  30,
		0, 0
		,FALSE
		,TRUE
	},
	//v1.1.68 光の三妖精専用
	{
#ifdef JP
		"妖精大集合の",
		"妖精大集合の",
		"Gathered",
#else
		"Gathered",
		"Gathered",
#endif
		{ 5,  5,  5,  5,  5,  5 },
		5,  5,  5,  -5,  5,  5,  25,  25,
		5, 0
		,FALSE
		,TRUE
	},
	//v1.1.77 お燐専用
	{
#ifdef JP
		"探偵助手　",
		"探偵助手　",
		"Assistant",
#else
		"Assistant",
		"Assistant",
#endif
		{ 0,  3,  0,  3,  0,  0 },
		5, 5, 0, 3, 10, 0, 0, 0,
		0, 0
		, FALSE
		,TRUE
	},
	//v1.1.80 文専用
	{
#ifdef JP
		"社会派ルポライター",
		"社会派ルポライター",
		"Social_Reporter",
#else
		"Social-Reporter",
		"Social-Reporter",
#endif
		{ -1,  1,  1,  -1,  -1,  1 },
		0, 0, 0, 0, 10, 0, -10, -10,
		-1, 0
		, FALSE
		,TRUE
	},
		//v1.1.92 女苑専用
	{
#ifdef JP
		"石油王　",
		"石油王　",
		"Oil_Baron",
#else
		"Oil-Baron",
		"Oil-Baron",
#endif // JP
		{ 0, -1, -1, 0, 1, 3 },
		0, 0, 0, -1, 5, 0, 5, 5,
		0, 0
		, FALSE
		,TRUE
	},

	//v2.0.1 魔理沙専用
	{
#ifdef JP
		"闇市場調査員　",
		"闇市場調査員　",
		"Investigator",
#else
		"Investigator",
		"Investigator",
#endif
		{ 0,  0,  0,  0,  0,  0 },
		0,  5, 0, 0, 0,  0,  -5,  -5,
		0, 0
		,FALSE
		,TRUE
	},


	//v2.0.3 龍専用
	{
#ifdef JP
		"通貨発行者　",
		"通貨発行者　",
		"Moneymaker",
#else
        "Money-Printer",
        "Money-Printer",
#endif
		{ 0,  0,  0,  0,  0,  0 },
		0,  0, 0, 0, 0,  0,  0,  0,
		0, 0
		,FALSE
		,TRUE
	},
	//v2.1.1 慧ノ子専用
	{
#ifdef JP
		"取り外せた",
		"取り外せた",
		"Barehand",
#else
		"Barehanded",
		"Barehanded",
#endif
		{ 0,  0,  0,  1,  0,  1 },
		0, 5, 0, 1, 0,  0,  -8,  0,
		0, 0
		,FALSE
		,TRUE
	},

};

cptr skill_exp_desc[SKILL_EXP_MAX] =
{
#ifdef JP
	"格闘","盾","乗馬","二刀流","投擲",
	"(未実装)","(未実装)","(未実装)","(未実装)","(未実装)",
	"短剣","長剣","刀","鈍器","棒",
	"斧","槍","長柄武器","弓","クロスボウ",
	"銃"
#else
    "Martial Arts","Shield","Riding","Dual Wielding","Throwing",
	"(Unimplemented)","(Unimplemented)","(Unimplemented)","(Unimplemented)","(Unimplemented)",
	"Short Blades","Long Blades","Katanas","Blunt Weapons","Staves",
	"Axes","Spears","Polearms","Bows","Crossbows",
	"Guns"
#endif
};



//v1.1.51	「夢の世界に行く(仮)」コマンドで見られる夢の選択肢
//desc,need_points,level,min,max
const nightmare_stage_type	nightmare_stage_table[NIGHTMARE_DIARY_STAGE_LEV_MAX] =
{
	{ _("日曜日", "Sunday"),       0,10,50 ,500 },
	{ _("月曜日", "Monday"),       300,20,500,2000 },
	{ _("火曜日", "Tuesday"),      3000,30,2000,8000 },
	{ _("水曜日", "Wednesday"),    20000,40,8000,20000 },
	{ _("木曜日", "Thursday"),     50000,50,20000,40000 },
	{ _("金曜日", "Friday"),       150000,60,40000,80000 },
	{ _("土曜日", "Saturday"),     300000,70,80000,120000 },
	{ _("真の悪夢", "True Nightmare"),1000000,100,240000,999999 },//levが100-127まで変動
};


//v1.1.51	「夢の世界に行く(仮)」コマンドで報酬フレーバーアイテムに記される文字列の部品
//r_idx,class_idx,conj1,phrase,conj2,position
//各キャラごとに「10以上」と「1～9」のposition値をもつ文字列を最低一つ設定しないとフリーズの原因になる可能性あり
//5人合わせて接続詞抜きで25文字以内に制限したのであまり長いのを増やさない
const nightmare_spellname_type	nightmare_spellname_table[] =
{
#ifdef JP
	{MON_RUMIA,CLASS_RUMIA,NULL,"ミッドナイト",NULL,15},
	{ MON_RUMIA,CLASS_RUMIA,NULL,"ダークサイド","オブザ",20 },
	{ MON_RUMIA,CLASS_RUMIA,NULL,"レイ",NULL,7 },
	{ MON_RUMIA,CLASS_RUMIA,"オブザ","ムーン",NULL,0 },

	{ MON_CIRNO,CLASS_CIRNO,NULL,"アイシクル",NULL,16 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"パーフェクト",NULL,16 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"冷凍法",NULL,0 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"フェアリー",NULL,12 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"フリィィィズ！",NULL,0 },


	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"セラギネラ",NULL,16 },
	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"９",NULL,0 },
	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"地龍天龍",NULL,12 },
	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"太極拳",NULL,0 },

	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"上級",NULL,0 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"賢者","の",20 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"アグニ",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"ジェリーフィッシュ",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"フォレスト",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"エメラルド",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"フレア",NULL,0 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"セレナ",NULL,7 },

	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"殺人",NULL,6 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"夜霧","の",25 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"インフレーション",NULL,12 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"デフレーション",NULL,12 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"ジャック","・ザ・",12 },
	{ MON_SAKUYA,CLASS_SAKUYA,"ザ・","ワールド",NULL,0 },
	{ MON_SAKUYA,CLASS_SAKUYA,"の","世界",NULL,0 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"咲夜特製",NULL,14 },

	{ MON_REMY,CLASS_REMY,NULL,"スター","オブ",16 },
	{ MON_REMY,CLASS_REMY,NULL,"シュート",NULL,0 },
	{ MON_REMY,CLASS_REMY,NULL,"マジック",NULL,0 },
	{ MON_REMY,CLASS_REMY,NULL,"幼き",NULL,18 },
	{ MON_REMY,CLASS_REMY,NULL,"不夜城",NULL,15 },
	{ MON_REMY,CLASS_REMY,NULL,"マイハート",NULL,14 },
	{ MON_REMY,CLASS_REMY,NULL,"スクランブル",NULL,5 },
	{ MON_REMY,CLASS_REMY,NULL,"鬼ごっこ",NULL,0 },
	{ MON_REMY,CLASS_REMY,NULL,"ミレニアム","の",21 },

	{ MON_FLAN,CLASS_FLAN,NULL,"カゴメカゴメ",NULL,5 },
	{ MON_FLAN,CLASS_FLAN,"の","迷路",NULL,7 },
	{ MON_FLAN,CLASS_FLAN,"も","いなくなるか？",NULL,0 },
	{ MON_FLAN,CLASS_FLAN,NULL,"禁じられた",NULL,20 },

	{ MON_LETTY,CLASS_LETTY,NULL,"テーブル",NULL,10 },
	{ MON_LETTY,CLASS_LETTY,NULL,"コールド",NULL,12 },
	{ MON_LETTY,CLASS_LETTY,NULL,"スナップ",NULL,7 },
	{ MON_LETTY,CLASS_LETTY,NULL,"ウイナー",NULL,3 },

	{ MON_CHEN,CLASS_CHEN,NULL,"卵",NULL,4 },
	{ MON_CHEN,CLASS_CHEN,NULL,"晴明",NULL,8 },
	{ MON_CHEN,CLASS_CHEN,NULL,"飛翔",NULL,16 },
	{ MON_CHEN,CLASS_CHEN,NULL,"鳴動",NULL,12 },

	{ MON_ALICE,CLASS_ALICE,NULL,"乙女",NULL,12 },
	{ MON_ALICE,CLASS_ALICE,NULL,"博愛","の",20 },
	{ MON_ALICE,CLASS_ALICE,NULL,"首吊り",NULL,6 },
	{ MON_ALICE,CLASS_ALICE,NULL,"魔彩光","の",12 },
	{ MON_ALICE,CLASS_ALICE,NULL,"ドールズ",NULL,16 },
	{ MON_ALICE,CLASS_ALICE,NULL,"スーサイド",NULL,16 },

	{ MON_LUNASA,CLASS_LUNASA,NULL,"メランコリー",NULL,8 },
	{ MON_LUNASA,CLASS_LUNASA,"・","ソロライブ",NULL,0 },
	{ MON_LUNASA,CLASS_LUNASA,NULL,"ノイズ",NULL,12 },
	{ MON_LUNASA,CLASS_LUNASA,NULL,"ファントム",NULL,15 },

	{ MON_MERLIN,CLASS_MERLIN,NULL,"ファンタズム",NULL,3 },
	{ MON_MERLIN,CLASS_MERLIN,NULL,"ヒノ",NULL,16 },
	{ MON_MERLIN,CLASS_MERLIN,NULL,"ソウル",NULL,16 },
	{ MON_MERLIN,CLASS_MERLIN,NULL,"プリズム",NULL,18 },

	{ MON_LYRICA,CLASS_LYRICA,NULL,"プリズム",NULL,18 },
	{ MON_LYRICA,CLASS_LYRICA,NULL,"リリカ","・",22 },
	{ MON_LYRICA,CLASS_LYRICA,NULL,"改",NULL,0 },
	{ MON_LYRICA,CLASS_LYRICA,NULL,"神奏",NULL,3 },

	{ MON_YOUMU,CLASS_YOUMU,NULL,"斬",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"斬",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"斬",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"一閃",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"二百由旬","の",14 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"桜花",NULL,22 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"滅多斬り",NULL,0 },

	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"リポジトリ","・オブ・",21 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"盛者必衰","の",24 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"ゴースト",NULL,12 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"墨染","の",11 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"死蝶","の",14 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"永眠",NULL,0 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"西行寺",NULL,18 },

	{ MON_RAN,CLASS_RAN,NULL,"狐狸妖怪",NULL,15 },
	{ MON_RAN,CLASS_RAN,NULL,"アルティメット",NULL,18 },
	{ MON_RAN,CLASS_RAN,NULL,"ブディスト",NULL,8 },
	{ MON_RAN,CLASS_RAN,NULL,"チャーミング",NULL,2 },
	{ MON_RAN,CLASS_RAN,NULL,"-Illusion-",NULL,0 },
	{ MON_RAN,CLASS_RAN,NULL,"狐狗狸さん","の",18 },

	{ MON_YUKARI,CLASS_YUKARI,NULL,"夢と現","の",18 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"夢郷",NULL,4 },
	{ MON_YUKARI,CLASS_YUKARI,"の","神隠し",NULL,0 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"禅寺に棲む",NULL,14 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"魅力的","な",14 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"＋",NULL,0 },
	{ MON_YUKARI,CLASS_YUKARI,"の","旅",NULL,0 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"ぶらり廃駅",NULL,20 },

	{ MON_WRIGGLE,CLASS_WRIGGLE,NULL,"地上","の",20 },
	{ MON_WRIGGLE,CLASS_WRIGGLE,NULL,"ストーム",NULL,3 },
	{ MON_WRIGGLE,CLASS_WRIGGLE,NULL,"ナイトバグ",NULL,12 },
	{ MON_WRIGGLE,CLASS_WRIGGLE,NULL,"季節外れ","の",30 },

	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"梟","の",15 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"真夜中","の",25 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"ソング",NULL,3 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"ダイブ",NULL,5 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"ダブル",NULL,0 },

	{ MON_KEINE,CLASS_KEINE,NULL,"クライシス",NULL,0 },
	{ MON_KEINE,CLASS_KEINE,NULL,"ヒストリー",NULL,4 },
	{ MON_KEINE,CLASS_KEINE,NULL,"20XX年","　",32 },
	{ MON_KEINE,CLASS_KEINE,NULL,"ピラミッド",NULL,5 },
	{ MON_KEINE,CLASS_KEINE,NULL,"幻想",NULL,15 },

	{ MON_TEWI,CLASS_TEWI,NULL,"因幡","の",15 },
	{ MON_TEWI,CLASS_TEWI,"の","素兎",NULL,12 },
	{ MON_TEWI,CLASS_TEWI,"の","薬",NULL,7 },

	{ MON_UDONGE,CLASS_UDONGE,NULL,"マインド",NULL,12 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"ルナティック",NULL,18 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"ルナティック",NULL,18 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"ルナティック",NULL,18 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"ロケット","・イン・",12 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"フルムーン",NULL,2 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"バラージ",NULL,6 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"パラレル",NULL,12 },

	{ MON_EIRIN,CLASS_EIRIN,NULL,"ゲーム",NULL,1 },
	{ MON_EIRIN,CLASS_EIRIN,NULL,"アポロ",NULL,16 },
	{ MON_EIRIN,CLASS_EIRIN,NULL,"オモイカネ",NULL,12 },
	{ MON_EIRIN,CLASS_EIRIN,NULL,"壺中","の",22 },
	{ MON_EIRIN,CLASS_EIRIN,"の","大銀河",NULL,0 },
	{ MON_EIRIN,CLASS_EIRIN,"の","法",NULL,3 },

	{ MON_KAGUYA,CLASS_KAGUYA,NULL,"五色","の",14 },
	{ MON_KAGUYA,CLASS_KAGUYA,NULL,"ブリリアントドラゴン",NULL,16 },
	{ MON_KAGUYA,CLASS_KAGUYA,"の","弾","の",18 },
	{ MON_KAGUYA,CLASS_KAGUYA,NULL,"金閣寺","の",21 },
	{ MON_KAGUYA,CLASS_KAGUYA,"の","樹海",NULL,4 },

	{ MON_MOKOU,CLASS_MOKOU,NULL,"ウー",NULL,0 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"ウー",NULL,14 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"フェニックス",NULL,4 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"フェニックス",NULL,16 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"再誕",NULL,0 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"フジヤマ",NULL,14 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"ヴォルケイノ",NULL,4 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"正直者","の",16 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"サンジェルマン","の",16 },
	{ MON_MOKOU,CLASS_MOKOU,"の","死",NULL,0 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"捨て身","の",24 },

	{ MON_SHIZUHA,CLASS_SHIZUHA,NULL,"落葉",NULL,4 },
	{ MON_SHIZUHA,CLASS_SHIZUHA,NULL,"フォーリン",NULL,12 },

	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"オータム",NULL,12 },
	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"スイートポテト",NULL,8 },
	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"秋の空","と",0 },
	{ MON_MINORIKO,CLASS_MINORIKO,"と","乙女の心",NULL,0 },
	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"五穀豊穣",NULL,18 },


	{ MON_HINA,CLASS_MINORIKO,NULL,"厄神様","の",12 },
	{ MON_HINA,CLASS_MINORIKO,NULL,"バッド",NULL,10 },
	{ MON_HINA,CLASS_MINORIKO,NULL,"ミスフォーチュン",NULL,16 },
	{ MON_HINA,CLASS_MINORIKO,"の","雛人形",NULL,1 },

	{ MON_NITORI,CLASS_NITORI,NULL,"撃て！",NULL,40 },
	{ MON_NITORI,CLASS_NITORI,NULL,"飛べ！",NULL,40 },
	{ MON_NITORI,CLASS_NITORI,NULL,"河童","の",12 },
	{ MON_NITORI,CLASS_NITORI,NULL,"のびーる",NULL,11 },
	{ MON_NITORI,CLASS_NITORI,NULL,"尻子玉",NULL,4 },
	{ MON_NITORI,CLASS_NITORI,NULL,"ガン",NULL,1 },

	{ MON_MOMIZI,CLASS_MOMIZI,NULL,"バイト",NULL,4 },
	{ MON_MOMIZI,CLASS_MOMIZI,NULL,"カナン",NULL,6 },
	{ MON_MOMIZI,CLASS_MOMIZI,NULL,"レイビーズ",NULL,16 },

	{ MON_AYA,CLASS_AYA,NULL,"風神",NULL,16 },
	{ MON_AYA,CLASS_AYA,NULL,"サルタ",NULL,12 },
	{ MON_AYA,CLASS_AYA,NULL,"バースト",NULL,3 },
	{ MON_AYA,CLASS_AYA,NULL,"天孫降臨","の",18 },
	{ MON_AYA,CLASS_AYA,NULL,"激撮",NULL,10 },


	{ MON_SANAE,CLASS_SANAE,"が","割れる日",NULL,0 },
	{ MON_SANAE,CLASS_SANAE,NULL,"五穀豊穣",NULL,20 },
	{ MON_SANAE,CLASS_SANAE,NULL,"ミラクル",NULL,15 },
	{ MON_SANAE,CLASS_SANAE,NULL,"フルーツ",NULL,5 },
	{ MON_SANAE,CLASS_SANAE,NULL,"九字",NULL,16 },
	{ MON_SANAE,CLASS_SANAE,NULL,"スネークカモン",NULL,3 },

	{ MON_KANAKO,CLASS_KANAKO,NULL,"エクスパンデッド","・",18 },
	{ MON_KANAKO,CLASS_KANAKO,NULL,"オンバシラ",NULL,3 },
	{ MON_KANAKO,CLASS_KANAKO,NULL,"神","の",16 },
	{ MON_KANAKO,CLASS_KANAKO,"の","風",NULL,0 },
	{ MON_KANAKO,CLASS_KANAKO,NULL,"マウンテン","・オブ・",12 },

	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"ケロちゃん",NULL,17 },
	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"冬眠できます",NULL,0 },
	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"諏訪",NULL,23 },
	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"大戦",NULL,3 },
	{ MON_SUWAKO,CLASS_SUWAKO,"に","呑まるる",NULL,8 },

	{ MON_KISUME,CLASS_KISUME,NULL,"飛んで",NULL,14 },
	{ MON_KISUME,CLASS_KISUME,"の","中",NULL,8 },
	{ MON_KISUME,CLASS_KISUME,"の","怪",NULL,3 },

	{ MON_YAMAME,CLASS_YAMAME,NULL,"キャプチャー",NULL,12 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"カンダタ",NULL,16 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"ロープ",NULL,3 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"原因不明","の",22 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"熱病",NULL,6 },

	{ MON_PARSEE,CLASS_PARSEE,NULL,"グリーンアイ","ド",14 },
	{ MON_PARSEE,CLASS_PARSEE,NULL,"モンスター",NULL,6 },
	{ MON_PARSEE,CLASS_PARSEE,NULL,"シロ","の",20 },
	{ MON_PARSEE,CLASS_PARSEE,NULL,"ジェラシー",NULL,13 },

	{ MON_YUGI,CLASS_YUGI,NULL,"四天王奥義","・",40 },
	{ MON_YUGI,CLASS_YUGI,NULL,"大江山",NULL,22 },
	{ MON_YUGI,CLASS_YUGI,NULL,"必殺",NULL,9 },

	{ MON_SATORI,CLASS_SATORI,NULL,"うろ覚え","の",30 },
	{ MON_SATORI,CLASS_SATORI,NULL,"想起","-",40 },
	{ MON_SATORI,CLASS_SATORI,NULL,"テリヴル",NULL,20 },
	{ MON_SATORI,CLASS_SATORI,NULL,"マインド",NULL,16 },

	{ MON_ORIN,CLASS_ORIN,NULL,"死体",NULL,16 },
	{ MON_ORIN,CLASS_ORIN,NULL,"死体",NULL,3 },
	{ MON_ORIN,CLASS_ORIN,NULL,"旧地獄","の",22 },
	{ MON_ORIN,CLASS_ORIN,NULL,"キャット",NULL,16 },
	{ MON_ORIN,CLASS_ORIN,NULL,"ウォーク",NULL,7 },
	{ MON_ORIN,CLASS_ORIN,NULL,"怨霊",NULL,4 },

	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"制御不能",NULL,0 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"フレア",NULL,3 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"メガ",NULL,10 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"ギガ",NULL,10 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"ニュークリア",NULL,16 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"フュージョン",NULL,3 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"地獄極楽",NULL,18 },

	{ MON_KOISHI,CLASS_KOISHI,NULL,"イド","の",16 },
	{ MON_KOISHI,CLASS_KOISHI,"の","開放",NULL,1 },
	{ MON_KOISHI,CLASS_KOISHI,NULL,"御先祖様","が",20 },
	{ MON_KOISHI,CLASS_KOISHI,"が","見ているぞ",NULL,0 },
	{ MON_KOISHI,CLASS_KOISHI,"に","御先祖総立ち",NULL,0 },
	{ MON_KOISHI,CLASS_KOISHI,NULL,"ローズ",NULL,7 },

	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"ロッド",NULL,3 },
	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"ペンデュラム",NULL,7 },
	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"高感度",NULL,18 },
	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"ディテクター",NULL,0 },

	{ MON_KOGASA,CLASS_KOGASA,NULL,"からかさ",NULL,20 },
	{ MON_KOGASA,CLASS_KOGASA,NULL,"超撥水",NULL,22 },
	{ MON_KOGASA,CLASS_KOGASA,NULL,"忘れ傘","の",16 },
	{ MON_KOGASA,CLASS_KOGASA,"・ザ・","レインボー",NULL,0 },
	{ MON_KOGASA,CLASS_KOGASA,NULL,"ピッチャー返し",NULL,4 },

	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"げんこつ",NULL,12 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"スマッシュ",NULL,2 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"大目玉",NULL,5 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"問答無用","の",22 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"にょき",NULL,7 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"華麗なる",NULL,25 },

	{ MON_MURASA,CLASS_MURASA,NULL,"沈没",NULL,13 },
	{ MON_MURASA,CLASS_MURASA,NULL,"道連れ",NULL,5 },
	{ MON_MURASA,CLASS_MURASA,NULL,"アンカー",NULL,3 },
	{ MON_MURASA,CLASS_MURASA,NULL,"ヴォーテックス",NULL,3 },
	{ MON_MURASA,CLASS_MURASA,NULL,"幽霊船",NULL,17 },

	{ MON_SHOU,CLASS_SHOU,NULL,"タイガー",NULL,6 },
	{ MON_SHOU,CLASS_SHOU,NULL,"トレジャー",NULL,3 },
	{ MON_SHOU,CLASS_SHOU,NULL,"至高","の",12 },
	{ MON_SHOU,CLASS_SHOU,NULL,"黄金","の",16 },

	{ MON_BYAKUREN,CLASS_BYAKUREN,"の","オーメン",NULL,2 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"超人",NULL,16 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"超人",NULL,3 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,"の","護法",NULL,1 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"大日如来",NULL,5 },

	{ MON_NUE,CLASS_NUE,NULL,"UFO襲来",NULL,0 },
	{ MON_NUE,CLASS_NUE,NULL,"遊星","よりの",24 },
	{ MON_NUE,CLASS_NUE,NULL,"正体不明","の",21 },
	{ MON_NUE,CLASS_NUE,NULL,"キメラ",NULL,7 },
	{ MON_NUE,CLASS_NUE,NULL,"平安京","の",21 },
	{ MON_NUE,CLASS_NUE,NULL,"ダーク",NULL,7 },
	{ MON_NUE,CLASS_NUE,NULL,"鵺","的",16 },

	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"チャージ","ド",13 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"クライ",NULL,7 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"レゾナンス",NULL,6 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"スクリーム",NULL,3 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"念仏",NULL,2 },

	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"死なない",NULL,18 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"マーダー",NULL,2 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"イーター",NULL,3 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"ゾンビ",NULL,12 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"クロー",NULL,4 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"デザイア",NULL,12 },

	{ MON_SEIGA,CLASS_SEIGA,NULL,"ウォール",NULL,18 },
	{ MON_SEIGA,CLASS_SEIGA,NULL,"タオ",NULL,12 },
	{ MON_SEIGA,CLASS_SEIGA,NULL,"胎動",NULL,5 },
	{ MON_SEIGA,CLASS_SEIGA,NULL,"タンキー",NULL,6 },

	{ MON_TOZIKO,CLASS_TOZIKO,NULL,"ガゴウジ",NULL,14 },
	{ MON_TOZIKO,CLASS_TOZIKO,NULL,"サイクロン",NULL,5 },
	{ MON_TOZIKO,CLASS_TOZIKO,NULL,"トルネード",NULL,3 },


	{ MON_FUTO,CLASS_FUTO,"よ","天へ昇れ",NULL,0 },
	{ MON_FUTO,CLASS_FUTO,NULL,"物部","の",18 },
	{ MON_FUTO,CLASS_FUTO,NULL,"大火","の",16 },
	{ MON_FUTO,CLASS_FUTO,NULL,"炎上",NULL,6 },
	{ MON_FUTO,CLASS_FUTO,NULL,"回転投げ",NULL,4 },
	{ MON_FUTO,CLASS_FUTO,NULL,"破局","の",18 },

	{ MON_MIKO,CLASS_MIKO,NULL,"日いずる処","の",25 },
	{ MON_MIKO,CLASS_MIKO,NULL,"掌の上","の",21 },
	{ MON_MIKO,CLASS_MIKO,NULL,"グセ",NULL,11 },
	{ MON_MIKO,CLASS_MIKO,NULL,"十七条","の",12 },
	{ MON_MIKO,CLASS_MIKO,NULL,"レーザー",NULL,8 },
	{ MON_MIKO,CLASS_MIKO,NULL,"我こそ","が",14 },
	{ MON_MIKO,CLASS_MIKO,NULL,"乱舞",NULL,6 },

	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"ウェイブ",NULL,6 },
	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"フィッシュ",NULL,7 },
	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"スクール","オブ",16 },
	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"スラップ",NULL,3 },

	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"レイ",NULL,1 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"ロクロ",NULL,13 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"マルチプリケイティブ",NULL,16 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"ヘッド",NULL,5 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"生首",NULL,10 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"身軽","な",20 },


	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"血に餓えた",NULL,18 },
	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"ウルフ",NULL,8 },
	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"ファング",NULL,6 },
	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"フルムーン",NULL,18 },

	{ MON_BENBEN,CLASS_BENBEN,NULL,"祇園精舎","の",15 },
	{ MON_BENBEN,CLASS_BENBEN,NULL,"スコア",NULL,4 },
	{ MON_BENBEN,CLASS_BENBEN,"の","アンサンブル",NULL,0 },
	{ MON_BENBEN,CLASS_BENBEN,NULL,"大熱唱",NULL,12 },

	{ MON_YATSUHASHI,CLASS_YATSUHASHI,NULL,"諸行無常","の",13 },
	{ MON_YATSUHASHI,CLASS_YATSUHASHI,NULL,"浄瑠璃",NULL,12 },
	{ MON_YATSUHASHI,CLASS_YATSUHASHI,"の","残響",NULL,3 },
	{ MON_YATSUHASHI,CLASS_YATSUHASHI,"の","詔琴",NULL,5 },

		//正邪は出さない

	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,"の","小人",NULL,5 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,NULL,"お前","が",18 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,"も","大きくなあれ",NULL,0 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,"の","針",NULL,3 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,NULL,"両目突き",NULL,7 },

	{ MON_RAIKO,CLASS_RAIKO,NULL,"高速和太鼓",NULL,18 },
	{ MON_RAIKO,CLASS_RAIKO,"の","怒り","の",12 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"デンデン",NULL,10 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"パーカス",NULL,7 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"ショー",NULL,3 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"ビート",NULL,5 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"ウーファー",NULL,8 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"ドンドコ",NULL,18 },

	{ MON_KASEN,CLASS_KASEN,NULL,"ドラゴンズ",NULL,16 },
	{ MON_KASEN,CLASS_KASEN,NULL,"グロウル",NULL,3 },
	{ MON_KASEN,CLASS_KASEN,NULL,"プロテウス",NULL,6 },
	{ MON_KASEN,CLASS_KASEN,NULL,"ホーク",NULL,11 },


	{ MON_SUIKA,CLASS_SUIKA,NULL,"ミッシング",NULL,16 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"パワー",NULL,3 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"投げ",NULL,0 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"スウォーム",NULL,3 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"百万鬼",NULL,16 },

	{ MON_IKU,CLASS_IKU,NULL,"ドリル",NULL,4 },
	{ MON_IKU,CLASS_IKU,"は","空の如く",NULL,0 },
	{ MON_IKU,CLASS_IKU,NULL,"竜宮の使い",NULL,16 },
	{ MON_IKU,CLASS_IKU,NULL,"エレキテル","の",20 },

	{ MON_TENSHI,CLASS_TENSHI,"の","剣",NULL,1 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"プレス",NULL,4 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"天地",NULL,19 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"全人類","の",16 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"全妖怪","の",16 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"勇気凛々","の",15 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"要石",NULL,12 },

	{ MON_KOKORO,CLASS_KOKORO,NULL,"ポゼッション",NULL,0 },
	{ MON_KOKORO,CLASS_KOKORO,NULL,"モンキー",NULL,10 },
	{ MON_KOKORO,CLASS_KOKORO,NULL,"喜怒哀楽",NULL,16 },
	{ MON_KOKORO,CLASS_KOKORO,NULL,"暗黒",NULL,12 },

	{ MON_MEDICINE,CLASS_MEDICINE,"の","毒",NULL,5 },
	{ MON_MEDICINE,CLASS_MEDICINE,NULL,"憂鬱","の",15 },
	{ MON_MEDICINE,CLASS_MEDICINE,NULL,"ガシング",NULL,12 },
	{ MON_MEDICINE,CLASS_MEDICINE,NULL,"ガーデン",NULL,0 },

	{ MON_YUUKA,CLASS_YUUKA,"の","開花",NULL,5 },
	{ MON_YUUKA,CLASS_YUUKA,NULL,"花鳥風月",NULL,20 },

	{ MON_KOMACHI,CLASS_KOMACHI,NULL,"宵越し","の",16 },
	{ MON_KOMACHI,CLASS_KOMACHI,NULL,"ヒガン",NULL,15 },
	{ MON_KOMACHI,CLASS_KOMACHI,"の","鎌",NULL,3 },
	{ MON_KOMACHI,CLASS_KOMACHI,NULL,"未練","がましい",18 },

	{ MON_EIKI,CLASS_EIKI,NULL,"ラスト",NULL,18 },
	{ MON_EIKI,CLASS_EIKI,NULL,"ジャッジメント",NULL,0 },
	{ MON_EIKI,CLASS_EIKI,NULL,"十王",NULL,10 },
	{ MON_EIKI,CLASS_EIKI,NULL,"裁判",NULL,0 },
	{ MON_EIKI,CLASS_EIKI,NULL,"彷徨える",NULL,20 },
	{ MON_EIKI,CLASS_EIKI,NULL,"大罪",NULL,7 },

	{ MON_HATATE,CLASS_HATATE,NULL,"籠もり",NULL,16 },
	{ MON_HATATE,CLASS_HATATE,NULL,"フルパノラマ",NULL,12 },
	{ MON_HATATE,CLASS_HATATE,NULL,"ショット",NULL,2 },
	{ MON_HATATE,CLASS_HATATE,NULL,"天狗",NULL,14 },
	{ MON_HATATE,CLASS_HATATE,NULL,"サイコ",NULL,25 },
	{ MON_HATATE,CLASS_HATATE,NULL,"グラフィ",NULL,0 },
	{ MON_HATATE,CLASS_HATATE,NULL,"姫海棠はたて","の",40 },

	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"満月","の",28 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,"の","ポンポコリン",NULL,0 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"弾幕変化",NULL,6 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"熱湯風呂",NULL,3 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,"って","良いな",NULL,0 },

	{ MON_3FAIRIES,CLASS_3_FAIRIES,NULL,"フェアリー",NULL,14 },
	{ MON_3FAIRIES,CLASS_3_FAIRIES,NULL,"オーバードライブ",NULL,0 },
	{ MON_3FAIRIES,CLASS_3_FAIRIES,NULL,"トリプル",NULL,16 },

	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"ファルコナー",NULL,5 },
	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"ドリームショット",NULL,0 },
	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"イーグル",NULL,16 },
	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"ルナティック","ガン",8 },
	{ MON_SEIRAN,CLASS_SEIRAN,"は","撃ち抜いた",NULL,0 },


	{ MON_RINGO,CLASS_RINGO,NULL,"ダンゴ",NULL,3 },
	{ MON_RINGO,CLASS_RINGO,NULL,"ダンゴ",NULL,12 },
	{ MON_RINGO,CLASS_RINGO,NULL,"セプテンバー",NULL,20 },
	{ MON_RINGO,CLASS_RINGO,NULL,"フルムーン",NULL,5 },
	{ MON_RINGO,CLASS_RINGO,NULL,"三姉妹",NULL,7 },

	{ MON_DOREMY,CLASS_DOREMY,"の","悪夢",NULL,0 },
	{ MON_DOREMY,CLASS_DOREMY,"の","悪夢",NULL,8 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"ドリーム",NULL,16 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"ドリーム",NULL,6 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"ナイトメア","・オブ・",20 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"緋色","の",22 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"藍色","の",22 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"漆黒","の",22 },


	{ MON_SAGUME,CLASS_SAGUME,"の","呪",NULL,1 },
	{ MON_SAGUME,CLASS_SAGUME,NULL,"烏合","の",16 },
	{ MON_SAGUME,CLASS_SAGUME,NULL,"　改",NULL,0 },
	{ MON_SAGUME,CLASS_SAGUME,NULL,"神々","の",12 },
	{ MON_SAGUME,CLASS_SAGUME,"の","白鷺",NULL,5 },

	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"ヘル",NULL,15 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"地獄","の",15 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"エクリプス",NULL,1 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"インフェルノ",NULL,5 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"フラッシュ","アンド",18 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,"アンド","ストライプ",NULL,4 },

	{ MON_JUNKO,CLASS_JUNKO,"の","純光",NULL,1 },
	{ MON_JUNKO,CLASS_JUNKO,NULL,"殺意","の",30 },
	{ MON_JUNKO,CLASS_JUNKO,NULL,"純粋","なる",18 },
	{ MON_JUNKO,CLASS_JUNKO,NULL,"ピュアリー",NULL,22 },
	{ MON_JUNKO,CLASS_JUNKO,NULL,"確実に悪夢で殺す",NULL,18 },

	{ MON_HECATIA1,CLASS_HECATIA,NULL,"ノンイデアル",NULL,18 },
	{ MON_HECATIA1,CLASS_HECATIA,NULL,"コズミック",NULL,18 },

	{ MON_HECATIA2,CLASS_HECATIA,"に","降る雨",NULL,1 },
	{ MON_HECATIA2,CLASS_HECATIA,NULL,"地獄","に",14 },

	{ MON_HECATIA3,CLASS_HECATIA,NULL,"インパクト",NULL,1 },
	{ MON_HECATIA3,CLASS_HECATIA,"が","堕ちてくる！",NULL,0 },

	{ MON_LARVA,CLASS_LARVA,NULL,"アゲハ","の",20 },
	{ MON_LARVA,CLASS_LARVA,NULL,"真夏","の",25 },
	{ MON_LARVA,CLASS_LARVA,NULL,"鱗粉",NULL,3 },

	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"山姥","の",20 },
	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"鬼包丁",NULL,6 },
	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"マウンテン",NULL,13 },
	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"マーダー",NULL,3 },

	{ MON_AUNN,CLASS_AUNN,NULL,"コマ犬",NULL,13 },
	{ MON_AUNN,CLASS_AUNN,NULL,"大回転",NULL,2 },
	{ MON_AUNN,CLASS_AUNN,NULL,"阿吽","の",16 },

	{ MON_NARUMI,CLASS_NARUMI,NULL,"ゴーレム",NULL,8 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"地蔵",NULL,8 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"ストンプ",NULL,1 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"即席",NULL,15 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"慈愛の",NULL,18 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"５６億７千万年","の",25 },


	{ MON_MAI,CLASS_MAI,NULL,"バンブー",NULL,14 },
	{ MON_MAI,CLASS_MAI,NULL,"タナバタ",NULL,18 },
	{ MON_MAI,CLASS_MAI,NULL,"ダンス",NULL,4 },
	{ MON_MAI,CLASS_MAI,NULL,"ダンス",NULL,15 },

	{ MON_SATONO,CLASS_SATONO,NULL,"ビハインド",NULL,18 },
	{ MON_SATONO,CLASS_SATONO,NULL,"ユアネーム",NULL,3 },
	{ MON_SATONO,CLASS_SATONO,NULL,"ダンス",NULL,4 },
	{ MON_SATONO,CLASS_SATONO,NULL,"ダンス",NULL,15 },

	{ MON_OKINA,CLASS_OKINA,NULL,"マターラ",NULL,12 },
	{ MON_OKINA,CLASS_OKINA,NULL,"ドゥッカ",NULL,5 },
	{ MON_OKINA,CLASS_OKINA,NULL,"暗躍",NULL,18 },
	{ MON_OKINA,CLASS_OKINA,NULL,"裏","・",40 },
	{ MON_OKINA,CLASS_OKINA,"の","玉繭",NULL,6 },
	{ MON_OKINA,CLASS_OKINA,NULL,"背後","から",23 },

	{ MON_JYOON,CLASS_JYOON,NULL,"ロバー",NULL,7 },
	{ MON_JYOON,CLASS_JYOON,NULL,"プラック",NULL,18 },
	{ MON_JYOON,CLASS_JYOON,NULL,"80's",NULL,22 },
	{ MON_JYOON,CLASS_JYOON,NULL,"クイーン","オブ",16 },

	{ MON_SHION_1,CLASS_SHION,NULL,"超",NULL,18 },
	{ MON_SHION_1,CLASS_SHION,NULL,"貧乏",NULL,13 },
	{ MON_SHION_1,CLASS_SHION,NULL,"玉",NULL,8 },

	{ MON_SHION_2,CLASS_SHION,NULL,"超",NULL,18 },
	{ MON_SHION_2,CLASS_SHION,NULL,"貧乏",NULL,13 },
	{ MON_SHION_2,CLASS_SHION,NULL,"玉",NULL,8 },
	{ MON_SHION_2,CLASS_SHION,NULL,"最凶最悪","の",23 },

	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"アプリ",NULL,0 },
	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"テレキネシス",NULL,12 },
	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"電波塔",NULL,8 },
	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"エソテリック",NULL,17 },


	{ MON_EIKA,CLASS_EIKA,NULL,"ストーン",NULL,20 },
	{ MON_EIKA,CLASS_EIKA,NULL,"アダルト",NULL,25 },
	{ MON_EIKA,CLASS_EIKA,NULL,"チルドレン","ズ",16 },
	{ MON_EIKA,CLASS_EIKA,NULL,"リンボ",NULL,5 },
	{ MON_EIKA,CLASS_EIKA,NULL,"ウッズ",NULL,5 },
	{ MON_EIKA,CLASS_EIKA,NULL,"積石",NULL,10 },


	{ MON_URUMI,CLASS_URUMI,NULL,"ヘビー",NULL,18 },
	{ MON_URUMI,CLASS_URUMI,NULL,"デーモン",NULL,12 },
	{ MON_URUMI,CLASS_URUMI,NULL,"ベイビー",NULL,7 },

	{ MON_KUTAKA,CLASS_KUTAKA,NULL,"水配り","の",20 },
	{ MON_KUTAKA,CLASS_KUTAKA,NULL,"見渡し","の",20 },
	{ MON_KUTAKA,CLASS_KUTAKA,NULL,"鬼渡","の",20 },
	{ MON_KUTAKA,CLASS_KUTAKA,"の","試練",NULL,3 },
	{ MON_KUTAKA,CLASS_KUTAKA,"の","分水嶺",NULL,3 },

	{ MON_YACHIE,CLASS_YACHIE,NULL,"亀甲",NULL,16 },
	{ MON_YACHIE,CLASS_YACHIE,NULL,"搦手","の",16 },
	{ MON_YACHIE,CLASS_YACHIE,"の","鬼畜生",NULL,1 },

	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"埴輪",NULL,20 },
	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"埴輪",NULL,10 },
	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"埴輪",NULL,5 },
	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"がらんどう","の",25 },

	{ MON_KEIKI,CLASS_KEIKI,NULL,"造形術",NULL,3 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"クリーチャー",NULL,3 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"スクエア",NULL,15 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"サークル",NULL,15 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"リニア",NULL,15 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"アイドル",NULL,15 },

	{ MON_SAKI,CLASS_SAKI,NULL,"ブラックペガサス",NULL,22 },
	{ MON_SAKI,CLASS_SAKI,NULL,"ショット",NULL,5 },
	{ MON_SAKI,CLASS_SAKI,NULL,"ライトニング",NULL,15 },
	{ MON_SAKI,CLASS_SAKI,NULL,"ビースト",NULL,12 },
	{ MON_SAKI,CLASS_SAKI,NULL,"マッスル",NULL,16 },
	{ MON_SAKI,CLASS_SAKI,NULL,"エクスプロージョン",NULL,5 },
	{ MON_SAKI,CLASS_SAKI,"は","筋力だ！",NULL,0 },


	{ MON_MIKE,CLASS_MIKE,NULL,"弾幕",NULL,25 },
	{ MON_MIKE,CLASS_MIKE,NULL,"万来",NULL,5 },
	{ MON_MIKE,CLASS_MIKE,NULL,"弾災",NULL,25 },
	{ MON_MIKE,CLASS_MIKE,NULL,"招福",NULL,5 },
	{ MON_MIKE,CLASS_MIKE,"に","小判",NULL,3 },


	{ MON_TAKANE,CLASS_TAKANE,"の","技術",NULL,3 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"グリーン",NULL,20 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"木隠れ","の",25 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"真","・",30 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"極","・",30 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"スパイラル",NULL,8 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"最奥","の",28 },

	{ MON_SANNYO,CLASS_SANNYO,NULL,"動天","の",24 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"驚愕","の",24 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"殺戮","の",20 },
	{ MON_SANNYO,CLASS_SANNYO,"の","雲間草",NULL,7 },
	{ MON_SANNYO,CLASS_SANNYO,"の","薄雪草",NULL,7 },
	{ MON_SANNYO,CLASS_SANNYO,"の","駒草",NULL,7 },
	{ MON_SANNYO,CLASS_SANNYO,"の","女王",NULL,2 },

	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"陰陽",NULL,15 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"玉",NULL,2 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"クイーン","オブ",25 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"インヤン",NULL,20 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"スフィア",NULL,6 },
	{ MON_MISUMARU,CLASS_MISUMARU,"の","向こうに",NULL,1 },

	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"フォックス",NULL,15 },
	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"フォックス",NULL,5 },
	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"シリンダー",NULL,12 },
	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"管の中","の",25 },

	{ MON_MEGUMU,CLASS_MEGUMU,NULL,"星火燎原","の",20 },
	{ MON_MEGUMU,CLASS_MEGUMU,NULL,"光彩陸離","の",20 },
	{ MON_MEGUMU,CLASS_MEGUMU,NULL,"天馬行空","の",20 },
	{ MON_MEGUMU,CLASS_MEGUMU,NULL,"天真爛漫","の",20 },
	{ MON_MEGUMU,CLASS_MEGUMU,"の","舞",NULL,1 },
	{ MON_MEGUMU,CLASS_MEGUMU,"の","風",NULL,7 },

	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"密度の高い",NULL,30 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"バレット",NULL,20 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"マーケット",NULL,12 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"ドミニオン",NULL,7 },
	{ MON_CHIMATA,CLASS_CHIMATA,"の","アジール",NULL,5 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"暴虐","の",20 },
	{ MON_CHIMATA,CLASS_CHIMATA,"の","ミシガンロール",NULL,5 },

	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"カニバリスティック",NULL,15 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"インセクト",NULL,5 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"マイン",NULL,12 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"ダンプ",NULL,5 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"イーター",NULL,2 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"蠱毒","の",25 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"蟲姫さま","の",25 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"輝かしく落ち着かない",NULL,16 },

	{ MON_YUMA,CLASS_YUMA,NULL,"お腹を空かせた",NULL,20 },
	{ MON_YUMA,CLASS_YUMA,NULL,"グリード",NULL,12 },
	{ MON_YUMA,CLASS_YUMA,NULL,"モンスター",NULL,7 },
	{ MON_YUMA,CLASS_YUMA,NULL,"暴食",NULL,12 },
	{ MON_YUMA,CLASS_YUMA,NULL,"血液",NULL,16 },
	{ MON_YUMA,CLASS_YUMA,"の","夕餉",NULL,8 },

	{ MON_BITEN,CLASS_BITEN,NULL,"モンキー",NULL,15 },
	{ MON_BITEN,CLASS_BITEN,NULL,"マジック",NULL,5 },

	{ MON_ENOKO,CLASS_ENOKO,NULL,"ケルベロス",NULL,15 },
	{ MON_ENOKO,CLASS_ENOKO,NULL,"ファイア",NULL,5 },

	{ MON_CHIYARI,CLASS_CHIYARI,NULL,"カースド",NULL,15 },
	{ MON_CHIYARI,CLASS_CHIYARI,NULL,"デビル",NULL,5 },
	{ MON_CHIYARI,CLASS_CHIYARI,NULL,"デビル",NULL,15 },

	{ MON_HISAMI,CLASS_HISAMI,NULL,"脱獄",NULL,15 },
	{ MON_HISAMI,CLASS_HISAMI,NULL,"ストーカー",NULL,5 },
	{ MON_HISAMI,CLASS_HISAMI,NULL,"脱獄",NULL,5 },
	{ MON_HISAMI,CLASS_HISAMI,NULL,"ストーカー",NULL,15 },

	{ MON_ZANMU,CLASS_ZANMU,NULL,"亡羊","の",20 },
	{ MON_ZANMU,CLASS_ZANMU,NULL,"純霊",NULL,18 },
	{ MON_ZANMU,CLASS_ZANMU,NULL,"弾",NULL,7 },
	{ MON_ZANMU,CLASS_ZANMU,NULL,"キングダム",NULL,2 },


	{ MON_UBAME,CLASS_UBAME,NULL,"コズミック",NULL,20 },
	{ MON_UBAME,CLASS_UBAME,NULL,"ダスト",NULL,5 },
	{ MON_UBAME,CLASS_UBAME,NULL,"唐櫃",NULL,25 },
	{ MON_UBAME,CLASS_UBAME,NULL,"返し",NULL,2 },

	{ MON_CHIMI,CLASS_CHIMI,NULL,"沢","の",15 },
	{ MON_CHIMI,CLASS_CHIMI,NULL,"森","の",15 },
	{ MON_CHIMI,CLASS_CHIMI,NULL,"山","の",15 },
	{ MON_CHIMI,CLASS_CHIMI,"の","気",NULL,1 },

	{ MON_NAREKO,CLASS_NAREKO,NULL,"ロジカル",NULL,15 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"ラビリンス",NULL,5 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"ウォール",NULL,8 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"ウォール",NULL,16 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"エンシャント",NULL,24 },

	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"ストリーミング",NULL,25 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"データ",NULL,5 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"シカ","を",25 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"ディス",NULL,15 },
	{ MON_YUIMAN,CLASS_YUIMAN,"の","美しい記憶",NULL,3 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"ジェノサイダー",NULL,7 },

	{ MON_ARIYA,CLASS_ARIYA,NULL,"永遠","の",20 },
	{ MON_ARIYA,CLASS_ARIYA,NULL,"ストーン",NULL,16 },
	{ MON_ARIYA,CLASS_ARIYA,NULL,"幻想","の",20 },
	{ MON_ARIYA,CLASS_ARIYA,"の","冬",NULL,3 },
	{ MON_ARIYA,CLASS_ARIYA,"の","化石",NULL,6 },

	{ MON_NINA,CLASS_NINA,NULL,"アンゴルモア","の",25 },
	{ MON_NINA,CLASS_NINA,"の","大王",NULL,7 },
	{ MON_NINA,CLASS_NINA,NULL,"オーダー",NULL,5 },
	{ MON_NINA,CLASS_NINA,NULL,"アーティフィシャル",NULL,25 },
	{ MON_NINA,CLASS_NINA,NULL,"テトラ",NULL,20 },


	{ MON_REIMU,CLASS_REIMU,NULL,"夢想",NULL,16},
	{ MON_REIMU,CLASS_REIMU,NULL,"封印",NULL,3 },
	{ MON_REIMU,CLASS_REIMU,NULL,"結界",NULL,7 },
	{ MON_REIMU,CLASS_REIMU,NULL,"陣",NULL,2 },
	{ MON_REIMU,CLASS_REIMU,"を","飛ぶ",NULL,22 },
	{ MON_REIMU,CLASS_REIMU,NULL,"博麗",NULL,20 },
	{ MON_REIMU,CLASS_REIMU,NULL,"調伏",NULL,5 },
	{ MON_REIMU,CLASS_REIMU,NULL,"びっくり",NULL,12 },
	{ MON_REIMU,CLASS_REIMU,NULL,"ニードル",NULL,5 },
	{ MON_REIMU,CLASS_REIMU,NULL,"陰陽",NULL,15 },
	{ MON_REIMU,CLASS_REIMU,NULL,"無慈悲","な",23 },
	{ MON_REIMU,CLASS_REIMU,"は","撮影禁止です",NULL,0 },
	{ MON_REIMU,CLASS_REIMU,NULL,"盗撮者調伏",NULL,30 },
	{ MON_REIMU,CLASS_REIMU,NULL,"大入り",NULL,15 },
	{ MON_REIMU,CLASS_REIMU,NULL,"在庫全て","の",25 },

	{ MON_MARISA,CLASS_MARISA,NULL,"マスター",NULL,12 },
	{ MON_MARISA,CLASS_MARISA,NULL,"スパーク",NULL,6 },
	{ MON_MARISA,CLASS_MARISA,NULL,"レーザー",NULL,3 },
	{ MON_MARISA,CLASS_MARISA,NULL,"ファイナル",NULL,25 },
	{ MON_MARISA,CLASS_MARISA,NULL,"ミルキー",NULL,16 },
	{ MON_MARISA,CLASS_MARISA,NULL,"アステロイド",NULL,18 },
	{ MON_MARISA,CLASS_MARISA,NULL,"メテオ",NULL,5 },
	{ MON_MARISA,CLASS_MARISA,NULL,"スター",NULL,2 },
	{ MON_MARISA,CLASS_MARISA,NULL,"シュート","・ザ・",25 },
	{ MON_MARISA,CLASS_MARISA,NULL,"実り","やすい",24 },
	{ MON_MARISA,CLASS_MARISA,"のような","懐中電灯",NULL,1 },
	{ MON_MARISA,CLASS_MARISA,NULL,"イリュージョン",NULL,8 },
#else
    {MON_RUMIA,CLASS_RUMIA,NULL,"Midnight",NULL,15},
	{ MON_RUMIA,CLASS_RUMIA,NULL,"Dark Side","of the",20 },
	{ MON_RUMIA,CLASS_RUMIA,NULL,"Ray",NULL,7 },
	{ MON_RUMIA,CLASS_RUMIA,"of the","Moon",NULL,0 },

	{ MON_CIRNO,CLASS_CIRNO,NULL,"Icicle",NULL,16 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"Perfect",NULL,16 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"Freezing Method",NULL,0 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"Fairy",NULL,12 },
	{ MON_CIRNO,CLASS_CIRNO,NULL,"Freeeeeeeeze!",NULL,0 },


	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"Selaginella",NULL,16 },
	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"9",NULL,0 },
	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"Earth Dragon Sky Dragon",NULL,12 },
	{ MON_MEIRIN,CLASS_MEIRIN,NULL,"Taijiquan",NULL,0 },

	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"High Level",NULL,0 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"Philosopher",NULL,20 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"Agni",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"Jellyfish",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"Forest",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"Emerald",NULL,18 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"Flare",NULL,0 },
	{ MON_PATCHOULI,CLASS_PATCHOULI,NULL,"Selene",NULL,7 },

	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"Killer",NULL,6 },
	{ MON_SAKUYA,CLASS_SAKUYA,"in","Night Mist",NULL,25 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"Inflation",NULL,12 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"Deflation",NULL,12 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"Jack","the",12 },
	{ MON_SAKUYA,CLASS_SAKUYA,"The","World",NULL,0 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"World","of",0 },
	{ MON_SAKUYA,CLASS_SAKUYA,NULL,"Sakuya's Special",NULL,14 },

	{ MON_REMY,CLASS_REMY,NULL,"Star","of",16 },
	{ MON_REMY,CLASS_REMY,NULL,"Shoot",NULL,0 },
	{ MON_REMY,CLASS_REMY,NULL,"Magic",NULL,0 },
	{ MON_REMY,CLASS_REMY,NULL,"Young",NULL,18 },
	{ MON_REMY,CLASS_REMY,NULL,"Nightless Castle",NULL,15 },
	{ MON_REMY,CLASS_REMY,NULL,"My Heart",NULL,14 },
	{ MON_REMY,CLASS_REMY,NULL,"Scramble",NULL,5 },
	{ MON_REMY,CLASS_REMY,NULL,"Vampire Tag",NULL,0 },
	{ MON_REMY,CLASS_REMY,"of","Millennium",NULL,21 },

	{ MON_FLAN,CLASS_FLAN,NULL,"Kagome-Kagome",NULL,5 },
	{ MON_FLAN,CLASS_FLAN,NULL,"Maze","of",7 },
	{ MON_FLAN,CLASS_FLAN,"and then","Will There Be None?",NULL,0 },
	{ MON_FLAN,CLASS_FLAN,NULL,"Forbidden",NULL,20 },

	{ MON_LETTY,CLASS_LETTY,NULL,"Table",NULL,10 },
	{ MON_LETTY,CLASS_LETTY,NULL,"Cold",NULL,12 },
	{ MON_LETTY,CLASS_LETTY,NULL,"Snap",NULL,7 },
	{ MON_LETTY,CLASS_LETTY,NULL,"Winner",NULL,3 },

	{ MON_CHEN,CLASS_CHEN,NULL,"Egg",NULL,4 },
	{ MON_CHEN,CLASS_CHEN,NULL,"Seiman",NULL,8 },
	{ MON_CHEN,CLASS_CHEN,NULL,"Soaring",NULL,16 },
	{ MON_CHEN,CLASS_CHEN,NULL,"Rumbling",NULL,12 },

	{ MON_ALICE,CLASS_ALICE,NULL,"Maiden",NULL,12 },
	{ MON_ALICE,CLASS_ALICE,NULL,"Fraternal",NULL,20 },
	{ MON_ALICE,CLASS_ALICE,NULL,"Hanged",NULL,6 },
	{ MON_ALICE,CLASS_ALICE,NULL,"Magically Luminous",NULL,12 },
	{ MON_ALICE,CLASS_ALICE,NULL,"Dolls",NULL,16 },
	{ MON_ALICE,CLASS_ALICE,NULL,"Suicide",NULL,16 },

	{ MON_LUNASA,CLASS_LUNASA,NULL,"Melancholy",NULL,8 },
	{ MON_LUNASA,CLASS_LUNASA,NULL,"Solo Live",NULL,0 },
	{ MON_LUNASA,CLASS_LUNASA,NULL,"Noise",NULL,12 },
	{ MON_LUNASA,CLASS_LUNASA,NULL,"Phantom",NULL,15 },

	{ MON_MERLIN,CLASS_MERLIN,NULL,"Phantasm",NULL,3 },
	{ MON_MERLIN,CLASS_MERLIN,NULL,"Hino",NULL,16 },
	{ MON_MERLIN,CLASS_MERLIN,NULL,"Soul",NULL,16 },
	{ MON_MERLIN,CLASS_MERLIN,NULL,"Prism",NULL,18 },

	{ MON_LYRICA,CLASS_LYRICA,NULL,"Prism",NULL,18 },
	{ MON_LYRICA,CLASS_LYRICA,NULL,"Lyrica",NULL,22 },
	{ MON_LYRICA,CLASS_LYRICA,NULL,"Revised",NULL,0 },
	{ MON_LYRICA,CLASS_LYRICA,NULL,"Divine Performance",NULL,3 },

	{ MON_YOUMU,CLASS_YOUMU,NULL,"Slash",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"Slash",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"Slash",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"Single Slash",NULL,1 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"200 Yojana","in a",14 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"Sakura Flowers",NULL,22 },
	{ MON_YOUMU,CLASS_YOUMU,NULL,"Hacking Slashes",NULL,0 },

	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"Repository","of",21 },
	{ MON_YUYUKO,CLASS_YUYUKO,"of","Decline",NULL,24 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"Ghost",NULL,12 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"Ink-Black",NULL,11 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"Deadly Butterfly","of",14 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"Eternal Sleep",NULL,0 },
	{ MON_YUYUKO,CLASS_YUYUKO,NULL,"Saigyouji",NULL,18 },

	{ MON_RAN,CLASS_RAN,NULL,"Fox-Tanuki Youkai",NULL,15 },
	{ MON_RAN,CLASS_RAN,NULL,"Ultimate",NULL,18 },
	{ MON_RAN,CLASS_RAN,NULL,"Buddhist",NULL,8 },
	{ MON_RAN,CLASS_RAN,NULL,"Charming",NULL,2 },
	{ MON_RAN,CLASS_RAN,NULL,"-Illusion-",NULL,0 },
	{ MON_RAN,CLASS_RAN,NULL,"Kokkuri-san",NULL,18 },

	{ MON_YUKARI,CLASS_YUKARI,"of","Dreams and Reality",NULL,18 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"Xanadu",NULL,4 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"Spiriting Away",NULL,0 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"Living in the Zen Temple",NULL,14 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"Bewitching",NULL,14 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"+",NULL,0 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"Journey","to",0 },
	{ MON_YUKARI,CLASS_YUKARI,NULL,"Abandoned Station",NULL,20 },

	{ MON_WRIGGLE,CLASS_WRIGGLE,"on","Earth",NULL,20 },
	{ MON_WRIGGLE,CLASS_WRIGGLE,NULL,"Storm",NULL,3 },
	{ MON_WRIGGLE,CLASS_WRIGGLE,NULL,"Night Bug",NULL,12 },
	{ MON_WRIGGLE,CLASS_WRIGGLE,NULL,"Unseasonable",NULL,30 },

	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"Hooting","in the",15 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"Midnight",NULL,25 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"Song",NULL,3 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"Dive",NULL,5 },
	{ MON_MYSTIA,CLASS_MYSTIA,NULL,"Double",NULL,0 },

	{ MON_KEINE,CLASS_KEINE,NULL,"Crisis",NULL,0 },
	{ MON_KEINE,CLASS_KEINE,NULL,"History",NULL,4 },
	{ MON_KEINE,CLASS_KEINE,NULL,"Year 20XX",_("　"," "),32 },
	{ MON_KEINE,CLASS_KEINE,NULL,"Pyramid",NULL,5 },
	{ MON_KEINE,CLASS_KEINE,NULL,"Phantasmal",NULL,15 },

	{ MON_TEWI,CLASS_TEWI,"of","Inaba",NULL,15 },
	{ MON_TEWI,CLASS_TEWI,NULL,"Bare White Rabbit","of",12 },
	{ MON_TEWI,CLASS_TEWI,NULL,"Vulnerary","of",7 },

	{ MON_UDONGE,CLASS_UDONGE,NULL,"Mind",NULL,12 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"Lunatic",NULL,18 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"Lunatic",NULL,18 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"Lunatic",NULL,18 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"Rocket","in",12 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"Full Moon",NULL,2 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"Barrage",NULL,6 },
	{ MON_UDONGE,CLASS_UDONGE,NULL,"Parallel",NULL,12 },

	{ MON_EIRIN,CLASS_EIRIN,NULL,"Game",NULL,1 },
	{ MON_EIRIN,CLASS_EIRIN,NULL,"Apollo",NULL,16 },
	{ MON_EIRIN,CLASS_EIRIN,NULL,"Omoikane",NULL,12 },
	{ MON_EIRIN,CLASS_EIRIN,"in a","Jar",NULL,22 },
	{ MON_EIRIN,CLASS_EIRIN,NULL,"Great Galaxy","of",0 },
	{ MON_EIRIN,CLASS_EIRIN,NULL,"Method","of",3 },

	{ MON_KAGUYA,CLASS_KAGUYA,NULL,"Five-Colored",NULL,14 },
	{ MON_KAGUYA,CLASS_KAGUYA,NULL,"Brilliant Dragon",NULL,16 },
	{ MON_KAGUYA,CLASS_KAGUYA,NULL,"Bullet",NULL,18 },
	{ MON_KAGUYA,CLASS_KAGUYA,"of","Kinkaku-Ji",NULL,21 },
	{ MON_KAGUYA,CLASS_KAGUYA,NULL,"Tree-Ocean","of",4 },

	{ MON_MOKOU,CLASS_MOKOU,NULL,"Wu",NULL,0 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"Wu",NULL,14 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"Phoenix",NULL,4 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"Phoenix",NULL,16 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"Rebirth",NULL,0 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"Fujiyama",NULL,14 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"Volcano",NULL,4 },
	{ MON_MOKOU,CLASS_MOKOU,"of the","Honest Man",NULL,16 },
	{ MON_MOKOU,CLASS_MOKOU,"of","St. Germain",NULL,16 },
	{ MON_MOKOU,CLASS_MOKOU,NULL,"Death","of",0 },
	{ MON_MOKOU,CLASS_MOKOU,"of","Reckless Sacrifice",NULL,24 },

	{ MON_SHIZUHA,CLASS_SHIZUHA,NULL,"Fallen Leaves",NULL,4 },
	{ MON_SHIZUHA,CLASS_SHIZUHA,NULL,"Falling",NULL,12 },

	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"Autumn",NULL,12 },
	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"Sweet Potato",NULL,8 },
	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"Autumn Sky","and",0 },
	{ MON_MINORIKO,CLASS_MINORIKO,"and","Maiden's Heart",NULL,0 },
	{ MON_MINORIKO,CLASS_MINORIKO,NULL,"Bumper Crop",NULL,18 },


	{ MON_HINA,CLASS_MINORIKO,"of the","Misfortune God",NULL,12 },
	{ MON_HINA,CLASS_MINORIKO,NULL,"Bad",NULL,10 },
	{ MON_HINA,CLASS_MINORIKO,NULL,"Misfortune",NULL,16 },
	{ MON_HINA,CLASS_MINORIKO,NULL,"Hina Dolls","of",1 },

	{ MON_NITORI,CLASS_NITORI,NULL,"Strike!",NULL,40 },
	{ MON_NITORI,CLASS_NITORI,NULL,"Fly!",NULL,40 },
	{ MON_NITORI,CLASS_NITORI,NULL,"Kappa",NULL,12 },
	{ MON_NITORI,CLASS_NITORI,NULL,"Exteeending",NULL,11 },
	{ MON_NITORI,CLASS_NITORI,NULL,"Shirikodama",NULL,4 },
	{ MON_NITORI,CLASS_NITORI,NULL,"Gun",NULL,1 },

	{ MON_MOMIZI,CLASS_MOMIZI,NULL,"Bite",NULL,4 },
	{ MON_MOMIZI,CLASS_MOMIZI,NULL,"Canaan",NULL,6 },
	{ MON_MOMIZI,CLASS_MOMIZI,NULL,"Rabies",NULL,16 },

	{ MON_AYA,CLASS_AYA,NULL,"Wind God",NULL,16 },
	{ MON_AYA,CLASS_AYA,NULL,"Saruta",NULL,12 },
	{ MON_AYA,CLASS_AYA,NULL,"Burst",NULL,3 },
	{ MON_AYA,CLASS_AYA,"of the","Divine Grandson",NULL,18 },
	{ MON_AYA,CLASS_AYA,NULL,"Quick-Shooting",NULL,10 },


	{ MON_SANAE,CLASS_SANAE,NULL,"Sea Splitting",NULL,0 },
	{ MON_SANAE,CLASS_SANAE,NULL,"Bumper Crop",NULL,20 },
	{ MON_SANAE,CLASS_SANAE,NULL,"Miracle",NULL,15 },
	{ MON_SANAE,CLASS_SANAE,NULL,"Fruit",NULL,5 },
	{ MON_SANAE,CLASS_SANAE,NULL,"Nine Syllable",NULL,16 },
	{ MON_SANAE,CLASS_SANAE,NULL,"Snake Come On",NULL,3 },

	{ MON_KANAKO,CLASS_KANAKO,NULL,"Expanded",NULL,18 },
	{ MON_KANAKO,CLASS_KANAKO,NULL,"Onbashira",NULL,3 },
	{ MON_KANAKO,CLASS_KANAKO,"of","God",NULL,16 },
	{ MON_KANAKO,CLASS_KANAKO,NULL,"Wind","of",0 },
	{ MON_KANAKO,CLASS_KANAKO,NULL,"Mountain","of",12 },

	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"Froggy",NULL,17 },
	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"Hibernation",NULL,0 },
	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"Suwa",NULL,23 },
	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"Great War",NULL,3 },
	{ MON_SUWAKO,CLASS_SUWAKO,NULL,"Swallowed","by",8 },

	{ MON_KISUME,CLASS_KISUME,NULL,"Flying",NULL,14 },
	{ MON_KISUME,CLASS_KISUME,NULL,"Inside","of",8 },
	{ MON_KISUME,CLASS_KISUME,NULL,"Apparition",NULL,3 },

	{ MON_YAMAME,CLASS_YAMAME,NULL,"Capture",NULL,12 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"Kandata",NULL,16 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"Rope",NULL,3 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"Unexplained",NULL,22 },
	{ MON_YAMAME,CLASS_YAMAME,NULL,"Fever",NULL,6 },

	{ MON_PARSEE,CLASS_PARSEE,NULL,"Green-Eyed",NULL,14 },
	{ MON_PARSEE,CLASS_PARSEE,NULL,"Monster",NULL,6 },
	{ MON_PARSEE,CLASS_PARSEE,"of","Shiro",NULL,20 },
	{ MON_PARSEE,CLASS_PARSEE,NULL,"Jealousy",NULL,13 },

	{ MON_YUGI,CLASS_YUGI,NULL,"Big Four Arcanum",NULL,40 },
	{ MON_YUGI,CLASS_YUGI,NULL,"Mount Ooe",NULL,22 },
	{ MON_YUGI,CLASS_YUGI,NULL,"Knock Out",NULL,9 },

	{ MON_SATORI,CLASS_SATORI,NULL,"Faint Recollection","of",30 },
	{ MON_SATORI,CLASS_SATORI,NULL,"Recollection","-",40 },
	{ MON_SATORI,CLASS_SATORI,NULL,"Terrible",NULL,20 },
	{ MON_SATORI,CLASS_SATORI,NULL,"Mind",NULL,16 },

	{ MON_ORIN,CLASS_ORIN,NULL,"Corpse",NULL,16 },
	{ MON_ORIN,CLASS_ORIN,NULL,"Corpse",NULL,3 },
	{ MON_ORIN,CLASS_ORIN,"of","Former Hell",NULL,22 },
	{ MON_ORIN,CLASS_ORIN,NULL,"Cat",NULL,16 },
	{ MON_ORIN,CLASS_ORIN,NULL,"Walk",NULL,7 },
	{ MON_ORIN,CLASS_ORIN,NULL,"Vengeful Spirit",NULL,4 },

	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"Uncontrollable",NULL,0 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"Flare",NULL,3 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"Mega",NULL,10 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"Giga",NULL,10 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"Nuclear",NULL,16 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"Fusion",NULL,3 },
	{ MON_UTSUHO,CLASS_UTSUHO,NULL,"Heaven and Hell",NULL,18 },

	{ MON_KOISHI,CLASS_KOISHI,"of","Id",NULL,16 },
	{ MON_KOISHI,CLASS_KOISHI,NULL,"Release","of",1 },
	{ MON_KOISHI,CLASS_KOISHI,NULL,"Ancestors",NULL,20 },
	{ MON_KOISHI,CLASS_KOISHI,NULL,"Watching You",NULL,0 },
	{ MON_KOISHI,CLASS_KOISHI,NULL,"All Ancestors",NULL,0 },
	{ MON_KOISHI,CLASS_KOISHI,NULL,"Rose",NULL,7 },

	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"Rod",NULL,3 },
	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"Pendulum",NULL,7 },
	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"High-Sensitivity",NULL,18 },
	{ MON_NAZRIN,CLASS_NAZRIN,NULL,"Detector",NULL,0 },

	{ MON_KOGASA,CLASS_KOGASA,NULL,"Umbrella",NULL,20 },
	{ MON_KOGASA,CLASS_KOGASA,NULL,"Super Water-Repelling",NULL,22 },
	{ MON_KOGASA,CLASS_KOGASA,"of","Forgotten Umbrella",NULL,16 },
	{ MON_KOGASA,CLASS_KOGASA,"the","Rainbow",NULL,0 },
	{ MON_KOGASA,CLASS_KOGASA,NULL,"Return Hit",NULL,4 },

	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"Fist",NULL,12 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"Smash",NULL,2 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"Scolding",NULL,5 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"Unarguable",NULL,22 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"Nyoki",NULL,7 },
	{ MON_ICHIRIN,CLASS_ICHIRIN,NULL,"Splendid",NULL,25 },

	{ MON_MURASA,CLASS_MURASA,NULL,"Foundering",NULL,13 },
	{ MON_MURASA,CLASS_MURASA,NULL,"Dragging",NULL,5 },
	{ MON_MURASA,CLASS_MURASA,NULL,"Anchor",NULL,3 },
	{ MON_MURASA,CLASS_MURASA,NULL,"Vortex",NULL,3 },
	{ MON_MURASA,CLASS_MURASA,NULL,"Phantom Ship",NULL,17 },

	{ MON_SHOU,CLASS_SHOU,NULL,"Tiger",NULL,6 },
	{ MON_SHOU,CLASS_SHOU,NULL,"Treasure",NULL,3 },
	{ MON_SHOU,CLASS_SHOU,NULL,"Most Valuable",NULL,12 },
	{ MON_SHOU,CLASS_SHOU,NULL,"Golden",NULL,16 },

	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"Omen",NULL,2 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"Superhuman",NULL,16 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"Superhuman",NULL,3 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"Apologetics",NULL,1 },
	{ MON_BYAKUREN,CLASS_BYAKUREN,NULL,"Mahavairocana",NULL,5 },

	{ MON_NUE,CLASS_NUE,NULL,"UFO Invasion",NULL,0 },
	{ MON_NUE,CLASS_NUE,"from a","Wandering Star",NULL,24 },
	{ MON_NUE,CLASS_NUE,NULL,"Unidentified",NULL,21 },
	{ MON_NUE,CLASS_NUE,NULL,"Chimera",NULL,7 },
	{ MON_NUE,CLASS_NUE,"of","Heiankyou",NULL,21 },
	{ MON_NUE,CLASS_NUE,NULL,"Dark",NULL,7 },
	{ MON_NUE,CLASS_NUE,NULL,"Nue",NULL,16 },

	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"Charged",NULL,13 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"Cry",NULL,7 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"Resonance",NULL,6 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"Scream",NULL,3 },
	{ MON_KYOUKO,CLASS_KYOUKO,NULL,"Nianfo",NULL,2 },

	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"Undying",NULL,18 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"Murder",NULL,2 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"Eater",NULL,3 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"Zombie",NULL,12 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"Claw",NULL,4 },
	{ MON_YOSHIKA,CLASS_YOSHIKA,NULL,"Desire",NULL,12 },

	{ MON_SEIGA,CLASS_SEIGA,NULL,"Wall",NULL,18 },
	{ MON_SEIGA,CLASS_SEIGA,NULL,"Tao",NULL,12 },
	{ MON_SEIGA,CLASS_SEIGA,NULL,"Fetal Movement",NULL,5 },
	{ MON_SEIGA,CLASS_SEIGA,NULL,"Tongji",NULL,6 },

	{ MON_TOZIKO,CLASS_TOZIKO,NULL,"Gagouji",NULL,14 },
	{ MON_TOZIKO,CLASS_TOZIKO,NULL,"Cyclone",NULL,5 },
	{ MON_TOZIKO,CLASS_TOZIKO,NULL,"Tornado",NULL,3 },


	{ MON_FUTO,CLASS_FUTO,NULL,"Ascending to Heaven",NULL,0 },
	{ MON_FUTO,CLASS_FUTO,"of","Mononobe",NULL,18 },
	{ MON_FUTO,CLASS_FUTO,NULL,"Inferno",NULL,16 },
	{ MON_FUTO,CLASS_FUTO,NULL,"Ablaze",NULL,6 },
	{ MON_FUTO,CLASS_FUTO,NULL,"Rotary Throw",NULL,4 },
	{ MON_FUTO,CLASS_FUTO,"for","Catastrophe",NULL,18 },

	{ MON_MIKO,CLASS_MIKO,"of the","Land of the Rising Sun",NULL,25 },
	{ MON_MIKO,CLASS_MIKO,"atop","One's Palm",NULL,21 },
	{ MON_MIKO,CLASS_MIKO,NULL,"Guse",NULL,11 },
	{ MON_MIKO,CLASS_MIKO,"of the","Seventeen Articles",NULL,12 },
	{ MON_MIKO,CLASS_MIKO,NULL,"Laser",NULL,8 },
	{ MON_MIKO,CLASS_MIKO,NULL,"My Way","is Truly That of",14 },
	{ MON_MIKO,CLASS_MIKO,NULL,"Chaotic Dance",NULL,6 },

	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"Wave",NULL,6 },
	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"Fish",NULL,7 },
	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"School","of",16 },
	{ MON_WAKASAGI,CLASS_WAKASAGI,NULL,"Slap",NULL,3 },

	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"Ray",NULL,1 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"Rokuro",NULL,13 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"Multiplicative",NULL,16 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"Head",NULL,5 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"Severed Head",NULL,10 },
	{ MON_SEKIBANKI,CLASS_BANKI,NULL,"Nimble",NULL,20 },


	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"Bloodthirsty",NULL,18 },
	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"Wolf",NULL,8 },
	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"Fang",NULL,6 },
	{ MON_KAGEROU,CLASS_KAGEROU,NULL,"Full Moon",NULL,18 },

	{ MON_BENBEN,CLASS_BENBEN,"of","Jetavana",NULL,15 },
	{ MON_BENBEN,CLASS_BENBEN,NULL,"Score",NULL,4 },
	{ MON_BENBEN,CLASS_BENBEN,NULL,"Ensemble",NULL,0 },
	{ MON_BENBEN,CLASS_BENBEN,NULL,"Euphoric Song",NULL,12 },

	{ MON_YATSUHASHI,CLASS_YATSUHASHI,"of","Anicca",NULL,13 },
	{ MON_YATSUHASHI,CLASS_YATSUHASHI,NULL,"Joururi",NULL,12 },
	{ MON_YATSUHASHI,CLASS_YATSUHASHI,NULL,"Reverberation","of",3 },
	{ MON_YATSUHASHI,CLASS_YATSUHASHI,"no","Norigoto",NULL,5 },

		//正邪は出さない

	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,NULL,"Inchling","of",5 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,NULL,"You",NULL,18 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,"also","Grow Bigger",NULL,0 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,NULL,"Needle","of",3 },
	{ MON_SHINMYOUMARU,CLASS_SHINMYOUMARU,NULL,"Eye-Stabbing",NULL,7 },

	{ MON_RAIKO,CLASS_RAIKO,NULL,"High Speed Taiko",NULL,18 },
	{ MON_RAIKO,CLASS_RAIKO,"of","Anger","of",12 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"Den-Den",NULL,10 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"Percuss",NULL,7 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"Show",NULL,3 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"Beat",NULL,5 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"Woofer",NULL,8 },
	{ MON_RAIKO,CLASS_RAIKO,NULL,"Dondoko",NULL,18 },

	{ MON_KASEN,CLASS_KASEN,NULL,"Dragon",NULL,16 },
	{ MON_KASEN,CLASS_KASEN,NULL,"Growl",NULL,3 },
	{ MON_KASEN,CLASS_KASEN,NULL,"Proteus",NULL,6 },
	{ MON_KASEN,CLASS_KASEN,NULL,"Hawk",NULL,11 },


	{ MON_SUIKA,CLASS_SUIKA,NULL,"Missing",NULL,16 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"Power",NULL,3 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"Throw",NULL,0 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"Swarm",NULL,3 },
	{ MON_SUIKA,CLASS_SUIKA,NULL,"Pandemonium",NULL,16 },

	{ MON_IKU,CLASS_IKU,NULL,"Drill",NULL,4 },
	{ MON_IKU,CLASS_IKU,NULL,"Like the Sky",NULL,0 },
	{ MON_IKU,CLASS_IKU,NULL,"Oarfish",NULL,16 },
	{ MON_IKU,CLASS_IKU,NULL,"Elekiter",NULL,20 },

	{ MON_TENSHI,CLASS_TENSHI,NULL,"Sword","of",1 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"Press",NULL,4 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"World",NULL,19 },
	{ MON_TENSHI,CLASS_TENSHI,"of","All Humankind",NULL,16 },
	{ MON_TENSHI,CLASS_TENSHI,"of","All Youkai",NULL,16 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"High-Spirited",NULL,15 },
	{ MON_TENSHI,CLASS_TENSHI,NULL,"Keystone",NULL,12 },

	{ MON_KOKORO,CLASS_KOKORO,NULL,"Possession",NULL,0 },
	{ MON_KOKORO,CLASS_KOKORO,NULL,"Monkey",NULL,10 },
	{ MON_KOKORO,CLASS_KOKORO,NULL,"Four Humours",NULL,16 },
	{ MON_KOKORO,CLASS_KOKORO,NULL,"Darkness",NULL,12 },

	{ MON_MEDICINE,CLASS_MEDICINE,NULL,"Poison","of",5 },
	{ MON_MEDICINE,CLASS_MEDICINE,NULL,"Melancholy",NULL,15 },
	{ MON_MEDICINE,CLASS_MEDICINE,NULL,"Gassing",NULL,12 },
	{ MON_MEDICINE,CLASS_MEDICINE,NULL,"Garden",NULL,0 },

	{ MON_YUUKA,CLASS_YUUKA,NULL,"Reflowering",NULL,5 },
	{ MON_YUUKA,CLASS_YUUKA,NULL,"Beauties of Nature",NULL,20 },

	{ MON_KOMACHI,CLASS_KOMACHI,NULL,"Yesterday",NULL,16 },
	{ MON_KOMACHI,CLASS_KOMACHI,NULL,"Higan",NULL,15 },
	{ MON_KOMACHI,CLASS_KOMACHI,NULL,"Scythe","of",3 },
	{ MON_KOMACHI,CLASS_KOMACHI,NULL,"Regretful",NULL,18 },

	{ MON_EIKI,CLASS_EIKI,NULL,"Last",NULL,18 },
	{ MON_EIKI,CLASS_EIKI,NULL,"Judgment",NULL,0 },
	{ MON_EIKI,CLASS_EIKI,NULL,"Ten Kings",NULL,10 },
	{ MON_EIKI,CLASS_EIKI,NULL,"Trial",NULL,0 },
	{ MON_EIKI,CLASS_EIKI,NULL,"Wandering",NULL,20 },
	{ MON_EIKI,CLASS_EIKI,NULL,"Great Sin",NULL,7 },

	{ MON_HATATE,CLASS_HATATE,NULL,"Secluded",NULL,16 },
	{ MON_HATATE,CLASS_HATATE,NULL,"Full Panoramic",NULL,12 },
	{ MON_HATATE,CLASS_HATATE,NULL,"Shot",NULL,2 },
	{ MON_HATATE,CLASS_HATATE,NULL,"Tengu",NULL,14 },
	{ MON_HATATE,CLASS_HATATE,NULL,"Psycho",NULL,25 },
	{ MON_HATATE,CLASS_HATATE,NULL,"Graphy",NULL,0 },
	{ MON_HATATE,CLASS_HATATE,"of","Hatate Himekaidou",NULL,40 },

	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"Full Moon",NULL,28 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"Pompokolin",NULL,0 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"Danmaku Transformation",NULL,6 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"Hot Soup Bathtub",NULL,3 },
	{ MON_MAMIZOU,CLASS_MAMIZOU,NULL,"Full Moon",NULL,0 },

	{ MON_3FAIRIES,CLASS_3_FAIRIES,NULL,"Fairy",NULL,14 },
	{ MON_3FAIRIES,CLASS_3_FAIRIES,NULL,"Overdrive",NULL,0 },
	{ MON_3FAIRIES,CLASS_3_FAIRIES,NULL,"Triple",NULL,16 },

	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"Falconer",NULL,5 },
	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"Dream Shot",NULL,0 },
	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"Eagle",NULL,16 },
	{ MON_SEIRAN,CLASS_SEIRAN,NULL,"Lunatic","Gun",8 },
	{ MON_SEIRAN,CLASS_SEIRAN,"Shot its","Target",NULL,0 },


	{ MON_RINGO,CLASS_RINGO,NULL,"Dango",NULL,3 },
	{ MON_RINGO,CLASS_RINGO,NULL,"Dango",NULL,12 },
	{ MON_RINGO,CLASS_RINGO,NULL,"September",NULL,20 },
	{ MON_RINGO,CLASS_RINGO,NULL,"Full Moon",NULL,5 },
	{ MON_RINGO,CLASS_RINGO,NULL,"Three Sisters",NULL,7 },

	{ MON_DOREMY,CLASS_DOREMY,NULL,"Nightmare",NULL,0 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"Nightmare",NULL,8 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"Dream",NULL,16 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"Dream",NULL,6 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"Nightmare","of",20 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"Scarlet",NULL,22 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"Indigo",NULL,22 },
	{ MON_DOREMY,CLASS_DOREMY,NULL,"Pitch-Black",NULL,22 },


	{ MON_SAGUME,CLASS_SAGUME,NULL,"Curse",NULL,1 },
	{ MON_SAGUME,CLASS_SAGUME,NULL,"Disorderly Flock",NULL,16 },
	{ MON_SAGUME,CLASS_SAGUME,NULL," V2",NULL,0 },
	{ MON_SAGUME,CLASS_SAGUME,"of the","Gods",NULL,12 },
	{ MON_SAGUME,CLASS_SAGUME,NULL,"White Heron",NULL,5 },

	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"Hell",NULL,15 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,"of","Hell",NULL,15 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"Eclipse",NULL,1 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"Inferno",NULL,5 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,NULL,"Flash","and",18 },
	{ MON_CLOWNPIECE,CLASS_CLOWNPIECE,"and","Stripe",NULL,4 },

	{ MON_JUNKO,CLASS_JUNKO,NULL,"Pure Light","of the",1 },
	{ MON_JUNKO,CLASS_JUNKO,"of","Murderous Intent",NULL,30 },
	{ MON_JUNKO,CLASS_JUNKO,NULL,"Pristine",NULL,18 },
	{ MON_JUNKO,CLASS_JUNKO,NULL,"Purely",NULL,22 },
	{ MON_JUNKO,CLASS_JUNKO,NULL,"Certain Kill via Nightmares",NULL,18 },

	{ MON_HECATIA1,CLASS_HECATIA,NULL,"Non-Ideal",NULL,18 },
	{ MON_HECATIA1,CLASS_HECATIA,NULL,"Cosmic",NULL,18 },

	{ MON_HECATIA2,CLASS_HECATIA,NULL,"Rain Falling","in",1 },
	{ MON_HECATIA2,CLASS_HECATIA,"in","Hell",NULL,14 },

	{ MON_HECATIA3,CLASS_HECATIA,NULL,"Impact",NULL,1 },
	{ MON_HECATIA3,CLASS_HECATIA,NULL,"Falls Down!",NULL,0 },

	{ MON_LARVA,CLASS_LARVA,NULL,"Swallowtail",NULL,20 },
	{ MON_LARVA,CLASS_LARVA,NULL,"Midsummer",NULL,25 },
	{ MON_LARVA,CLASS_LARVA,NULL,"Scales",NULL,3 },

	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"Yamanba",NULL,20 },
	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"Oni Kitchen Knife",NULL,6 },
	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"Mountain",NULL,13 },
	{ MON_NEMUNO,CLASS_NEMUNO,NULL,"Murder",NULL,3 },

	{ MON_AUNN,CLASS_AUNN,NULL,"Koma-Inu",NULL,13 },
	{ MON_AUNN,CLASS_AUNN,NULL,"Giant Slalom Spin",NULL,2 },
	{ MON_AUNN,CLASS_AUNN,NULL,"A-Un",NULL,16 },

	{ MON_NARUMI,CLASS_NARUMI,NULL,"Golem",NULL,8 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"Jizo",NULL,8 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"Stomp",NULL,1 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"Instantaneous",NULL,15 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"Merciful",NULL,18 },
	{ MON_NARUMI,CLASS_NARUMI,NULL,"5.67 Billion Years","of",25 },


	{ MON_MAI,CLASS_MAI,NULL,"Bamboo",NULL,14 },
	{ MON_MAI,CLASS_MAI,NULL,"Tanabata",NULL,18 },
	{ MON_MAI,CLASS_MAI,NULL,"Dance",NULL,4 },
	{ MON_MAI,CLASS_MAI,NULL,"Dance",NULL,15 },

	{ MON_SATONO,CLASS_SATONO,NULL,"Behind",NULL,18 },
	{ MON_SATONO,CLASS_SATONO,NULL,"Your Name",NULL,3 },
	{ MON_SATONO,CLASS_SATONO,NULL,"Dance",NULL,4 },
	{ MON_SATONO,CLASS_SATONO,NULL,"Dance",NULL,15 },

	{ MON_OKINA,CLASS_OKINA,NULL,"Matara",NULL,12 },
	{ MON_OKINA,CLASS_OKINA,NULL,"Dukkha",NULL,5 },
	{ MON_OKINA,CLASS_OKINA,NULL,"Behind-the-Scenes",NULL,18 },
	{ MON_OKINA,CLASS_OKINA,NULL,"Hidden",NULL,40 },
	{ MON_OKINA,CLASS_OKINA,NULL,"Dupion",NULL,6 },
	{ MON_OKINA,CLASS_OKINA,"from the","Back",NULL,23 },

	{ MON_JYOON,CLASS_JYOON,NULL,"Robber",NULL,7 },
	{ MON_JYOON,CLASS_JYOON,NULL,"Pluck",NULL,18 },
	{ MON_JYOON,CLASS_JYOON,NULL,"80's",NULL,22 },
	{ MON_JYOON,CLASS_JYOON,NULL,"Queen","of",16 },

	{ MON_SHION_1,CLASS_SHION,NULL,"Super",NULL,18 },
	{ MON_SHION_1,CLASS_SHION,NULL,"Poverty",NULL,13 },
	{ MON_SHION_1,CLASS_SHION,NULL,"Sphere",NULL,8 },

	{ MON_SHION_2,CLASS_SHION,NULL,"Super",NULL,18 },
	{ MON_SHION_2,CLASS_SHION,NULL,"Poverty",NULL,13 },
	{ MON_SHION_2,CLASS_SHION,NULL,"Sphere",NULL,8 },
	{ MON_SHION_2,CLASS_SHION,NULL,"Despicable and Disastrous",NULL,23 },

	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"Applique",NULL,0 },
	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"Telekinses",NULL,12 },
	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"Radio Tower",NULL,8 },
	{ MON_SUMIREKO_2,CLASS_SUMIREKO,NULL,"Esoteric",NULL,17 },


	{ MON_EIKA,CLASS_EIKA,NULL,"Stone",NULL,20 },
	{ MON_EIKA,CLASS_EIKA,NULL,"Adult",NULL,25 },
	{ MON_EIKA,CLASS_EIKA,NULL,"Children",NULL,16 },
	{ MON_EIKA,CLASS_EIKA,NULL,"Limbo",NULL,5 },
	{ MON_EIKA,CLASS_EIKA,NULL,"Woods",NULL,5 },
	{ MON_EIKA,CLASS_EIKA,NULL,"Stone Stack",NULL,10 },


	{ MON_URUMI,CLASS_URUMI,NULL,"Heavy",NULL,18 },
	{ MON_URUMI,CLASS_URUMI,NULL,"Demon",NULL,12 },
	{ MON_URUMI,CLASS_URUMI,NULL,"Baby",NULL,7 },

	{ MON_KUTAKA,CLASS_KUTAKA,"of","Mikumari",NULL,20 },
	{ MON_KUTAKA,CLASS_KUTAKA,"of","Miwatashi",NULL,20 },
	{ MON_KUTAKA,CLASS_KUTAKA,"of","Oniwatari",NULL,20 },
	{ MON_KUTAKA,CLASS_KUTAKA,NULL,"Trial","of",3 },
	{ MON_KUTAKA,CLASS_KUTAKA,NULL,"Watershed","of",3 },

	{ MON_YACHIE,CLASS_YACHIE,NULL,"Tortoise Shell",NULL,16 },
	{ MON_YACHIE,CLASS_YACHIE,NULL,"Rear-Attacking",NULL,16 },
	{ MON_YACHIE,CLASS_YACHIE,NULL,"Devilish Beasts",NULL,1 },

	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"Haniwa",NULL,20 },
	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"Haniwa",NULL,10 },
	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"Haniwa",NULL,5 },
	{ MON_MAYUMI,CLASS_MAYUMI,NULL,"Hollow",NULL,25 },

	{ MON_KEIKI,CLASS_KEIKI,NULL,"Sculpting Art",NULL,3 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"Creature",NULL,3 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"Square",NULL,15 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"Circle",NULL,15 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"Linear",NULL,15 },
	{ MON_KEIKI,CLASS_KEIKI,NULL,"Idol",NULL,15 },

	{ MON_SAKI,CLASS_SAKI,NULL,"Black Pegasus",NULL,22 },
	{ MON_SAKI,CLASS_SAKI,NULL,"Shot",NULL,5 },
	{ MON_SAKI,CLASS_SAKI,NULL,"Lightning",NULL,15 },
	{ MON_SAKI,CLASS_SAKI,NULL,"Beast",NULL,12 },
	{ MON_SAKI,CLASS_SAKI,NULL,"Muscle",NULL,16 },
	{ MON_SAKI,CLASS_SAKI,NULL,"Explosion",NULL,5 },
	{ MON_SAKI,CLASS_SAKI,"is","Muscle Strength!",NULL,0 },


	{ MON_MIKE,CLASS_MIKE,NULL,"Danmaku",NULL,25 },
	{ MON_MIKE,CLASS_MIKE,NULL,"Many Guests",NULL,5 },
	{ MON_MIKE,CLASS_MIKE,NULL,"Shoot Away Disaster",NULL,25 },
	{ MON_MIKE,CLASS_MIKE,NULL,"Beckon in Fortune",NULL,5 },
	{ MON_MIKE,CLASS_MIKE,NULL,"Koban Coins","Before a",3 },


	{ MON_TAKANE,CLASS_TAKANE,NULL,"Technology",NULL,3 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"Green",NULL,20 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"Tree-Veiling",NULL,25 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"True",NULL,30 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"Extreme",NULL,30 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"Spiral",NULL,8 },
	{ MON_TAKANE,CLASS_TAKANE,NULL,"Innermost",NULL,28 },

	{ MON_SANNYO,CLASS_SANNYO,NULL,"Heaven-Shaking",NULL,24 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"Astonishing",NULL,24 },
	{ MON_SANNYO,CLASS_SANNYO,"of","Massacre",NULL,20 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"Kumomagusa",NULL,7 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"Usuyukisou",NULL,7 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"Komakusa",NULL,7 },
	{ MON_SANNYO,CLASS_SANNYO,NULL,"Queen",NULL,2 },

	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"Ying-Yang",NULL,15 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"Orb",NULL,2 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"Queen","of",25 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"Ying-Yang",NULL,20 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"Sphere",NULL,6 },
	{ MON_MISUMARU,CLASS_MISUMARU,NULL,"Beyond","the",1 },

	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"Fox",NULL,15 },
	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"Fox",NULL,5 },
	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"Cylinder",NULL,12 },
	{ MON_TSUKASA,CLASS_TSUKASA,NULL,"Within the Pipe",NULL,25 },

	{ MON_MEGUMU,CLASS_MEGUMU,"of","Prairie Fire, Star's Spark",NULL,20 },
	{ MON_MEGUMU,CLASS_MEGUMU,"of","Dazzling Iridescence",NULL,20 },
	{ MON_MEGUMU,CLASS_MEGUMU,"of","Sky-Racing Heavenly Steeds",NULL,20 },
	{ MON_MEGUMU,CLASS_MEGUMU,"of","Ingenuous Brilliance",NULL,20 },
	{ MON_MEGUMU,CLASS_MEGUMU,NULL,"Dance","of",1 },
	{ MON_MEGUMU,CLASS_MEGUMU,NULL,"Wind","of",7 },

	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"High Density",NULL,30 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"Bullet",NULL,20 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"Market",NULL,12 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"Dominion",NULL,7 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"Asylum","of",5 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"Tyrannical",NULL,20 },
	{ MON_CHIMATA,CLASS_CHIMATA,NULL,"Michigan Roll",NULL,5 },

	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Cannibalistic",NULL,15 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Insect",NULL,5 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Mine",NULL,12 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Dump",NULL,5 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Eater",NULL,2 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Kodoku",NULL,25 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Mushihime-Sama",NULL,25 },
	{ MON_MOMOYO,CLASS_MOMOYO,NULL,"Resplendent Daily Life",NULL,16 },

	{ MON_YUMA,CLASS_YUMA,NULL,"Empty-Stomached",NULL,20 },
	{ MON_YUMA,CLASS_YUMA,NULL,"Greed",NULL,12 },
	{ MON_YUMA,CLASS_YUMA,NULL,"Monster",NULL,12 },
	{ MON_YUMA,CLASS_YUMA,NULL,"Gluttony",NULL,12 },
	{ MON_YUMA,CLASS_YUMA,NULL,"Blood",NULL,16 },
	{ MON_YUMA,CLASS_YUMA,NULL,"Dinner","of",8 },

	{ MON_BITEN,CLASS_BITEN,NULL,"Monkey",NULL,15 },
	{ MON_BITEN,CLASS_BITEN,NULL,"Magic",NULL,5 },

	{ MON_ENOKO,CLASS_ENOKO,NULL,"Cerberus",NULL,15 },
	{ MON_ENOKO,CLASS_ENOKO,NULL,"Fire",NULL,5 },

	{ MON_CHIYARI,CLASS_CHIYARI,NULL,"Cursed",NULL,15 },
	{ MON_CHIYARI,CLASS_CHIYARI,NULL,"Devil",NULL,5 },
	{ MON_CHIYARI,CLASS_CHIYARI,NULL,"Devil",NULL,15 },

	{ MON_HISAMI,CLASS_HISAMI,NULL,"Jailbreak",NULL,15 },
	{ MON_HISAMI,CLASS_HISAMI,NULL,"Stalker",NULL,5 },
	{ MON_HISAMI,CLASS_HISAMI,NULL,"Jailbreak",NULL,5 },
	{ MON_HISAMI,CLASS_HISAMI,NULL,"Stalker",NULL,15 },

	{ MON_ZANMU,CLASS_ZANMU,"of","Lost Sheep",NULL,20 },
	{ MON_ZANMU,CLASS_ZANMU,NULL,"Pure Spirit",NULL,18 },
	{ MON_ZANMU,CLASS_ZANMU,NULL,"Shot",NULL,7 },
	{ MON_ZANMU,CLASS_ZANMU,NULL,"Kingdom",NULL,2 },


	{ MON_UBAME,CLASS_UBAME,NULL,"Cosmic",NULL,20 },
	{ MON_UBAME,CLASS_UBAME,NULL,"Dust",NULL,5 },
	{ MON_UBAME,CLASS_UBAME,NULL,"Karabitsu",NULL,25 },
	{ MON_UBAME,CLASS_UBAME,NULL,"Upheaval",NULL,2 },

	{ MON_CHIMI,CLASS_CHIMI,"of","Swamp",NULL,15 },
	{ MON_CHIMI,CLASS_CHIMI,"of","Forest",NULL,15 },
	{ MON_CHIMI,CLASS_CHIMI,"of","Mountain",NULL,15 },
	{ MON_CHIMI,CLASS_CHIMI,NULL,"Qi","of",1 },

	{ MON_NAREKO,CLASS_NAREKO,NULL,"Logical",NULL,15 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"Labyrinth",NULL,5 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"Wall",NULL,8 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"Wall",NULL,16 },
	{ MON_NAREKO,CLASS_NAREKO,NULL,"Ancient",NULL,24 },

	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"Streaming",NULL,25 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"Data",NULL,5 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"Deer",NULL,25 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"Dis",NULL,15 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"Beautiful Memory","of",3 },
	{ MON_YUIMAN,CLASS_YUIMAN,NULL,"Genocider",NULL,7 },

	{ MON_ARIYA,CLASS_ARIYA,NULL,"Eternal",NULL,20 },
	{ MON_ARIYA,CLASS_ARIYA,NULL,"Stone",NULL,16 },
	{ MON_ARIYA,CLASS_ARIYA,NULL,"Illusionary",NULL,20 },
	{ MON_ARIYA,CLASS_ARIYA,NULL,"Winter",NULL,3 },
	{ MON_ARIYA,CLASS_ARIYA,NULL,"Fossil",NULL,6 },

	{ MON_NINA,CLASS_NINA,"of","Angolmois",NULL,25 },
	{ MON_NINA,CLASS_NINA,NULL,"Great King","of",7 },
	{ MON_NINA,CLASS_NINA,NULL,"Order",NULL,5 },
	{ MON_NINA,CLASS_NINA,NULL,"Artificial",NULL,25 },
	{ MON_NINA,CLASS_NINA,NULL,"Tetra",NULL,20 },


	{ MON_REIMU,CLASS_REIMU,NULL,"Dream",NULL,16},
	{ MON_REIMU,CLASS_REIMU,NULL,"Seal",NULL,3 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Barrier",NULL,7 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Circle",NULL,2 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Flying","in",22 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Hakurei",NULL,20 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Expulsion",NULL,5 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Surprise",NULL,12 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Needle",NULL,5 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Ying-Yang",NULL,15 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Merciless",NULL,23 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Photography Strictly Prohibited",NULL,0 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Sneak-Photographer",NULL,30 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Bonus Packets",NULL,15 },
	{ MON_REIMU,CLASS_REIMU,NULL,"Entire Stock","of",25 },

	{ MON_MARISA,CLASS_MARISA,NULL,"Master",NULL,12 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Spark",NULL,6 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Laser",NULL,3 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Final",NULL,25 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Milky",NULL,16 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Asteroid",NULL,18 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Meteo",NULL,5 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Star",NULL,2 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Shoot","the",25 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Easily-Fruitful",NULL,24 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Flashlight",NULL,1 },
	{ MON_MARISA,CLASS_MARISA,NULL,"Illusion",NULL,8 },
#endif



	{ 0,0,NULL,"",NULL,0 } //終端ダミー
};


//v1.1.51	新アリーナの地形生成に使う街ファイル名と流用開始位置xy座標
const nightmare_gen_map_type	nightmare_gen_map_table[NIGHTMARE_GEN_MAP_TABLE_SIZE] =
{
	//townfile,x,y
	{ "t0000001.txt",5,26 },
	{ "t0000001.txt",13,9 },
	{ "t0000001.txt",13,37 },
	{ "t0000001.txt",18,25 },
	{ "t0000001.txt",60,15 },
	{ "t0000001.txt",84,12 },
	{ "t0000001.txt",120,37 },
	{ "t0000001.txt",130,24 },
	{ "t0000002.txt",75,40 },
	{ "t0000002.txt",2,3 },
	{ "t0000002.txt",130,6 },
	{ "t0000002.txt",22,10 },
	{ "t0000002.txt",4,35 },
	{ "t0000002.txt",30,27 },
	{ "t0000002.txt",70,35 },
	{ "t0000002.txt",90,30 },
	{ "t0000003.txt",110,30 },
	{ "t0000003.txt",1,20 },
	{ "t0000003.txt",80,16 },
	{ "t0000003.txt",45,43 },
	{ "t0000004.txt",35,42 },
	{ "t0000004.txt",35,3 },
	{ "t0000004.txt",130,40 },
	{ "t0000004.txt",132,3 },
	{ "t0000005.txt",70,15 },
	{ "t0000005.txt",70,35 },
	{ "t0000006.txt",84,25 },
	{ "t0000006.txt",60,35 },
	{ "t0000006.txt",95,21 },
	{ "t0000006.txt",120,33 },
	{ "t0000007.txt",103,17 },
	{ "t0000007.txt",48,25 },
	{ "t0000008.txt",100,13 },
	{ "t0000008.txt",50,23 },
	{ "t0000008.txt",83,42 },
	{ "t0000009.txt",55,16 },
	{ "t0000009.txt",6,23 },
	{ "t0000009.txt",110,5 },
	{ "t0000010.txt",60,30 },
	{ "t0000010.txt",30,6 },
	{ "t0000010.txt",128,43 },
	{ "t0000011.txt",80,35 },
	{ "t0000011.txt",30,15 },
	{ "t0000012.txt",70,4 },
	{ "t0000012.txt",70,24 },
	{ "t0000012.txt",97,44 },

};



//v1.1.51 新アリーナ用商品テーブル
//{stage_level(0-7),rarity,tral,sval,basenum}
const nightmare_treasure_type nightmare_treasure_table[] =
{

	//0:lev20
	{ 0,100,TV_POTION,SV_POTION_CURE_CRITICAL,1 },
	{ 0,100,TV_POTION,SV_POTION_HEROISM,1 },
	{ 0,100,TV_POTION,SV_POTION_RESIST_HEAT,1 },
	{ 0,100,TV_POTION,SV_POTION_RESIST_COLD,1 },
	{ 0,100,TV_POTION,SV_POTION_POISON2,1 },
	{ 0,100,TV_SCROLL,SV_SCROLL_LIGHT,1 },
	{ 0,100,TV_SCROLL,SV_SCROLL_DETECT_ITEM,1 },
	{ 0,100,TV_SCROLL,SV_SCROLL_DETECT_TRAP,1 },
	{ 0,100,TV_SCROLL,SV_SCROLL_DETECT_DOOR,1 },
	{ 0,100,TV_SCROLL,SV_SCROLL_TELEPORT,1 },
	{ 0,100,TV_MATERIAL,SV_MATERIAL_HIKARIGOKE,1 },
	{ 0,100,TV_ALCOHOL,SV_ALCOHOL_ORC,1 },
	{ 0,100,TV_ALCOHOL,SV_ALCOHOL_BEER,1 },
	{ 0,10,TV_MATERIAL,SV_MATERIAL_NIGHTMARE_FRAGMENT,1 },
	{ 0,50,TV_SOUVENIR,SV_SOUVENIR_ULTRASONIC,1 },
	{ 0,50,TV_SWEETS,SV_SWEET_POTATO,1 },

	//1:lev30
	{ 1,100,TV_SCROLL,SV_SCROLL_WORD_OF_RECALL,1 },
	{ 1,100,TV_SCROLL,SV_SCROLL_MAPPING,1 },
	{ 1,100,TV_POTION,SV_POTION_CURE_CRITICAL,1 },
	{ 1,75,TV_POTION,SV_POTION_CURING,1 },
	{ 1,75,TV_POTION,SV_POTION_SPEED,1 },
	{ 1,100,TV_SCROLL,SV_SCROLL_TELEPORT_LEVEL,1 },
	{ 1,100,TV_SCROLL,SV_SCROLL_DISPEL_UNDEAD,1 },
	{ 1,75,TV_SCROLL,SV_SCROLL_SUMMON_KIN,1 },
	{ 1,100,TV_MATERIAL,SV_MATERIAL_HEMATITE,1 },
	{ 1,100,TV_MATERIAL,SV_MATERIAL_MAGNETITE,1 },
	{ 1,100,TV_MATERIAL,SV_MATERIAL_BROKEN_NEEDLE,1 },
	{ 1,50,TV_COMPOUND,SV_COMPOUND_MUSCLE_DRUG,1 },
	{ 1,50,TV_MATERIAL,SV_MATERIAL_NIGHTMARE_FRAGMENT,1 },
	{ 1,70,TV_ALCOHOL,SV_ALCOHOL_REISYU,1 },

	//2:lev40

	{ 2,100,TV_POTION,SV_POTION_CURING,1 },
	{ 2,20,TV_COMPOUND,SV_COMPOUND_NECOMIMI,1 },
	{ 2,100,TV_SCROLL,SV_SCROLL_STAR_REMOVE_CURSE,1 },
	{ 2,70,TV_COMPOUND,SV_COMPOUND_GELSEMIUM_TEA,1 },
	{ 2,80,TV_MATERIAL,SV_MATERIAL_ARSENIC,1 },
	{ 2,70,TV_MATERIAL,SV_MATERIAL_MERCURY,1 },
	{ 2,80,TV_MATERIAL,SV_MATERIAL_NIGHTMARE_FRAGMENT,1 },

	{ 2,100,TV_MATERIAL,SV_MATERIAL_GARNET,1 },
	{ 2,100,TV_MATERIAL,SV_MATERIAL_AMETHYST,1 },
	{ 2,100,TV_MATERIAL,SV_MATERIAL_AQUAMARINE,1 },
	{ 2,100,TV_MATERIAL,SV_MATERIAL_MOONSTONE,1 },
	{ 2,100,TV_MATERIAL,SV_MATERIAL_PERIDOT,1 },
	{ 2,100,TV_MATERIAL,SV_MATERIAL_OPAL,1 },
	{ 2,100,TV_MATERIAL,SV_MATERIAL_TOPAZ,1 },
	{ 2,100,TV_MATERIAL,SV_MATERIAL_LAPISLAZULI,1 },

	{ 2,100,TV_SWEETS,SV_SWEETS_MIRACLE_FRUIT,1 },

	//3:lev50
	{ 3,100,TV_WAND,SV_WAND_TELEPORT_AWAY,1 },
	{ 3,100,TV_WAND,SV_WAND_STONE_TO_MUD,1 },
	{ 3,100,TV_POTION,SV_POTION_HEALING,1 },
	{ 3,100,TV_POTION,SV_POTION_RESISTANCE,1 },
	{ 3,50,TV_COMPOUND,SV_COMPOUND_JEKYLL,1 },
	{ 3,100,TV_WHISTLE,SV_WHISTLE,1 },
	{ 3,80,TV_STAFF,SV_STAFF_SPEED,1 },
	{ 3,100,TV_WAND,SV_WAND_DRAIN_LIFE,1 },
	{ 3,100,TV_SCROLL,SV_SCROLL_STAR_DESTRUCTION,1 },
	{ 3,100,TV_SCROLL,SV_SCROLL_STAR_ENCHANT_ARMOR,1 },
	{ 3,100,TV_SCROLL,SV_SCROLL_STAR_ENCHANT_WEAPON,1 },
	{ 3,100,TV_MATERIAL,SV_MATERIAL_ISHIZAKURA,1 },
	{ 3,100,TV_MATERIAL,SV_MATERIAL_MITHRIL,1 },
	{ 3,70,TV_MATERIAL,SV_MATERIAL_ADAMANTITE,1 },
	{ 3,100,TV_MATERIAL,SV_MATERIAL_NIGHTMARE_FRAGMENT,1 },
	{ 3,30,TV_MATERIAL,SV_MATERIAL_HOPE_FRAGMENT,1 },
	{ 3,100,TV_ALCOHOL,SV_ALCOHOL_REISYU,1 },
	{ 3,100,TV_SWEETS,SV_SWEETS_PEACH,1 },


	//4:lev60
	{ 4,100,TV_POTION,SV_POTION_HEALING,1 },
	{ 4,80,TV_POTION,SV_POTION_RESTORE_MANA,1 },
	{ 4,100,TV_POTION,SV_POTION_ENLIGHTENMENT,1 },
	{ 4,100,TV_POTION,SV_POTION_RESISTANCE,1 },
	{ 4,80,TV_WAND,SV_WAND_DRAGON_BREATH,1 },
	{ 4,100,TV_STAFF,SV_STAFF_DISPEL_EVIL,1 },
	{ 4,60,TV_ROD,SV_ROD_TELEPORT_AWAY,1 },
	{ 4,60,TV_ROD,SV_ROD_MAPPING,1 },
	{ 4,60,TV_ROD,SV_ROD_STONE_TO_MUD,1 },
	{ 4,100,TV_SCROLL,SV_SCROLL_MUNDANITY,1 },
	{ 4,100,TV_SCROLL,SV_SCROLL_PROTECTION_FROM_EVIL,1 },
	{ 4,75,TV_SCROLL,SV_SCROLL_RUNE_OF_PROTECTION,1 },
	{ 4,100,TV_POTION,SV_POTION_DETONATIONS,1 },
	{ 4,80,TV_MATERIAL,SV_MATERIAL_DRAGONSCALE,1 },
	{ 4,100,TV_MATERIAL,SV_MATERIAL_TAKAKUSAGORI,1 },
	{ 4,60,TV_MATERIAL,SV_MATERIAL_HOPE_FRAGMENT,1 },

	//5:lev70
	{ 5,70,TV_POTION,SV_POTION_STAR_HEALING,1 },
	{ 5,100,TV_POTION,SV_POTION_RESTORE_MANA,1 },
	{ 5,100,TV_POTION,SV_POTION_POLYMORPH,1 },
	{ 5,100,TV_POTION,SV_POTION_SELF_KNOWLEDGE,1 },
	{ 5,80,TV_POTION,SV_POTION_NANIKASUZUSHIKUNARU,1 },

	{ 5,100,TV_STAFF,SV_STAFF_DESTRUCTION,1 },
	{ 5,100,TV_ROD,SV_ROD_SPEED,1 },
	{ 5,100,TV_ROD,SV_ROD_DETECTION,1 },
	{ 5,100,TV_SCROLL,SV_SCROLL_SPELL,1 },

	{ 5,100,TV_WAND,SV_WAND_STRIKING,1 },

	{ 5,100,TV_SCROLL,SV_SCROLL_FIRE,1 },
	{ 5,100,TV_SCROLL,SV_SCROLL_ICE,1 },
	{ 5,100,TV_SCROLL,SV_SCROLL_CHAOS,1 },
	{ 5,100,TV_SCROLL,SV_SCROLL_GENOCIDE,1 },

	{ 5,70,TV_MATERIAL,SV_MATERIAL_EMERALD,1 },
	{ 5,70,TV_MATERIAL,SV_MATERIAL_RUBY,1 },
	{ 5,70,TV_MATERIAL,SV_MATERIAL_SAPPHIRE,1 },
	{ 5,80,TV_MATERIAL,SV_MATERIAL_DRAGONNAIL,1 },
	{ 5,100,TV_MATERIAL,SV_MATERIAL_HOPE_FRAGMENT,1 },

	{ 5,100,TV_ALCOHOL,SV_ALCOHOL_NECTAR,1 },
	{ 5,50,TV_SOUVENIR,SV_SOUVENIR_SMARTPHONE,1 },


	//6:lev80

	{ 6,100,TV_POTION,SV_POTION_STAR_HEALING,1 },
	{ 6,100,TV_POTION,SV_POTION_RESTORE_MANA,1 },
	{ 6,75,TV_POTION,SV_POTION_LIFE,1 },
	{ 6,80,TV_COMPOUND,SV_COMPOUND_STAR_DETORNATION,1 },


	{ 6,60,TV_STAFF,SV_STAFF_HOLINESS,1 },
	{ 6,50,TV_STAFF,SV_STAFF_POWER,1 },
	{ 6,40,TV_STAFF,SV_STAFF_HEALING,1 },
	{ 6,30,TV_STAFF,SV_STAFF_MSTORM,1 },
	{ 6,50,TV_WAND,SV_WAND_DISINTEGRATE,1 },
	{ 6,25,TV_WAND,SV_WAND_ROCKETS,1 },

	{ 6,100,TV_ROD,SV_ROD_IDENTIFY,1 },
	{ 6,100,TV_SCROLL,SV_SCROLL_MASS_GENOCIDE,1 },

	{ 6,50,TV_MATERIAL,SV_MATERIAL_IZANAGIOBJECT,1 },
	{ 6,80,TV_MATERIAL,SV_MATERIAL_DIAMOND,1 },

	//7:lev100-127

	{ 7,100,TV_POTION,SV_POTION_LIFE,1 },
	{ 7,100,TV_POTION,SV_POTION_NEW_LIFE,1 },

	{ 7,80,TV_WAND,SV_WAND_ROCKETS,1 },
	{ 7,100,TV_POTION,SV_POTION_LOVE,1 },
	{ 7,100,TV_ALCOHOL,SV_ALCOHOL_GOLDEN_MEAD,1 },

	{ 7,100,TV_MATERIAL,SV_MATERIAL_IZANAGIOBJECT,1 },
	{ 7,30,TV_MATERIAL,SV_MATERIAL_MYSTERIUM,1 },

	{ 7,10,TV_STAFF,SV_STAFF_THE_MAGI,1 },
	{ 7,60,TV_ROD,SV_ROD_HEALING,1 },
	{ 7,40,TV_ROD,SV_ROD_HAVOC,1 },

	{ 7,10,TV_SOUVENIR,SV_SOUVENIR_PHOENIX_FEATHER,1 },
	{ 7,10,TV_SOUVENIR,SV_SOUVENIR_SHILVER_KEY,1 },
	{ 7,10,TV_SCROLL,SV_SCROLL_ARTIFACT,1 },

	{ 7,100,TV_MATERIAL,SV_MATERIAL_METEORICIRON,1 },
	{ 7,5,TV_MATERIAL,SV_MATERIAL_HIHIIROKANE,1 },

	{ 7,50,TV_MUSHROOM,SV_MUSHROOM_MON_SUPER,1 },

	{ 0,0,0,0,0 } //終端ダミー
};



//名もなき技の概要表示文字列 新菫子性格用
const cptr	nameless_skill_type_desc[JKF1_MAX + 1] =
{
#ifdef JP
	"ダミー","ボルト攻撃","ボール攻撃","ビーム攻撃","ロケット攻撃","ブレス攻撃",
	"大型レーザー攻撃","自分中心巨大ボール","視界内攻撃","フロア全体攻撃","空腹充足",
	//10
	"回復","回復","モンスター感知","罠感知","アイテム感知",
	"啓蒙","全復活","テレポート","次元の扉","全周囲攻撃",
	//20
	"入身攻撃","連続攻撃","癒し","完全回復","解呪",
	"弾幕回避","爆風軽減","ブレス軽減","破壊防御","魔法吸収",
	//30
	"壁堀移動","魔道具強力使用","肉体強化","知性強化","無敵化",
	"一時加速","魔法防御上昇","物理防御上昇","魔法の鎧","一時超隠密",
	//40
	"壁抜け","破片オーラ","エレメント耐性","究極の耐性","エッセンス付与",
	"エッセンス付与","鑑定","*破壊*","フロア静寂","周辺抹殺",
	//50
	"混沌招来(1d777)","視界内テレポートアウェイ","視界内死の光線","視界内水棲スレイ攻撃","視界内金縛り",
	"召喚阻害","現実変容","流星群","発光","隣接攻撃能力強化",
	//60
	"地震","周辺トラップ解除","幸運","能力低下","魔力消去","幻惑","全感知"
#else
    "dummy","bolt attack","ball attack","beam attack","rocket attack","breath attack",
	"large laser attack","huge ball centered on yourself","line of sight attack","entire level attack","satisfy hunger",
	//10
	"healing","healing","detect monsters","detect traps","detect items",
	"enlightenment","restoration","teleport","dimension door","all-around attack",
	//20
	"charge attack","consecutive attacks","curing","full healing","remove curse",
	"evade danmaku","endure blasts","endure breaths","endure destruction","mana drain",
	//30
	"wall digging","powerful device use","physical augmentation","knowledge augmentation","invincibility",
	"temporary haste","protection from magic","physical defense","magic armor","temporary superstealth",
	//40
	"wall walking","shard aura","element resistance","ultimate resistance","confer essence",
	"confer essence","identify","*destruction*","silence level","*banishment*",
	//50
	"invoke chaos (1d777)","line of sight teleport away","line of sight death rays","line of sight aquatic slay attack","line of sight binding",
	"prevent summons","alter reality","meteor shower","emit light","empower melee attacks",
	//60
	"earthquake","destroy nearby traps","good fortune", "lower abilities", "dispel magic", "dazzle", "detection"
#endif

};

//v1.1.57	隠岐奈「秘神の暗躍弾幕」の攻撃タイプ
//{lev,desc,RF3フラグ}
//この表はレベル昇順に並んでいなければならない
pattern_attack_type pattern_attack_table[PATTERN_ATTACK_TYPE_MAX + 1] =
{
	{ 1,_("攻撃を中断する", "Stop attacking"), 0L },
	{ 1,_("幻想郷人間勢力", "humans of Gensoukyou"), RF3_GEN_HUMAN },
	{ 1,_("幻想郷妖怪勢力", "youkai of Gensoukyou"), RF3_GEN_KWAI },
	{ 30,_("アンデッド", "undead"),RF3_UNDEAD },
	{ 30,_("悪魔", "demons"),RF3_DEMON },
	{ 30,_("自然界の生物", "natural creatures"),RF3_ANIMAL },
	{ 40,_("ドラゴン", "dragons"), RF3_DRAGON },
	{ 40,_("月面勢力", "Lunarians"), RF3_GEN_MOON },
	{ 40,_("アンバーの王族", "Lords of Amber"), RF3_ANG_AMBER },
	{ 50,_("全ての人間", "all humans"),RF3_HUMAN },
	{ 50,_("秩序の勢力", "lawful beings"), RF3_ANG_COSMOS },
	{ 50,_("混沌の勢力", "chaotic beings"), RF3_ANG_CHAOS },
};


//アビリティカード情報テーブル
//アビリティカードのo_ptr->pvalにこのテーブルのインデックスを記録する
//{"card_name",rarity_rank,trade_value,activate,difficulty,charge_turn}
//charge_turnは300を超えないこと
//{"card_name",rarity_rank,trade_value,activate,difficulty,charge_turn,mon_r_idx}
ability_card_type ability_card_list[ABILITY_CARD_LIST_LEN] =
{

	{ _("空白のカード", "Blank Card")		,0,0,TRUE,10,10 ,0}, //通常生成されない。凡庸化するとこのカードになる。千亦プレイ時以外に使い道はない
	{ _("命のカード", "Life Card")			                ,1,11,FALSE,0,0,0 },
	{ _("スペルのカード", "Spell Card")		                ,1,10,FALSE,0,0,0 },
	{ _("勝手に天下の回り物", "Money Comes and Goes")	    ,1,22,FALSE,0,0,MON_NAZRIN },
	{ _("鈴瑚印の団子", "Ringo-Brand Dango")		        ,1,20,TRUE ,50,100 ,MON_RINGO},
	{ _("不死鳥の尾", "Phoenix's Tail")			            ,4,150,FALSE,0,0 ,MON_MOKOU},
	{ _("陰陽玉", "Yin-Yang Orb")				            ,1,14,TRUE,50,25 ,MON_REIMU},
	{ _("陰陽玉(針)", "Yin-Yang Orb (Needle)")			    ,2,37,TRUE,65,10 ,MON_REIMU},
	{ _("ミニ八卦炉", "Mini-Hakkero")			            ,1,13,TRUE,55,20 ,MON_MARISA},
	{ _("ミニ八卦炉(ミサイル)", "Mini-Hakkero (Missile)")   ,2,45,TRUE,70,25 ,MON_MARISA},
	{ _("メイドナイフ", "Maid Knife")		                ,1,12,TRUE,30,10 ,MON_SAKUYA},
	{ _("メイドナイフ(跳弾)", "Maid Knife (Ricochet)")	    ,2,30,TRUE,60,20 ,MON_SAKUYA},
	{ _("無事かえるお守り", "Safe Return Amulet")	        ,1,18,TRUE,40,100 ,MON_SANAE},
	{ _("蛇の抜け殻入りお守り", "Shed Snakeskin Amulet")    ,2,48,TRUE,65,50 ,MON_SANAE},
	{ _("半霊の半分", "Half-Half Ghost")			        ,2,27,FALSE,0,0 ,MON_YOUMU},
	{ _("上海人形", "Shanghai Doll")			            ,2,25,TRUE,50,75 ,MON_ALICE},
	{ _("アイスフェアリー", "Ice Fairy")	                ,2,28,TRUE,60,35 ,MON_CIRNO},
	{ _("背中の扉", "Back Door")			                ,3,64,FALSE,0,0 ,MON_OKINA},
	{ _("鬱陶しいUFO", "Annoying UFO")			            ,4,140,FALSE,0,0 ,MON_NUE},
	{ _("太古の勾玉", "Ancient Magatama")			        ,2,42,FALSE,0,0 ,MON_MISUMARU},
	{ _("守銭奴の教訓", "Miser's Advice")		            ,1,16,FALSE,0,0 ,MON_NITORI},
	{ _("神山への供物", "Sacred Mountain Offerings")        ,3,70,FALSE,0,0 ,MON_KANAKO},
	{ _("死穢回避の薬", "Death Avoidance Elixir")		    ,4,135,TRUE,95,100 ,MON_EIRIN},
	{ _("幸運うさぎの足", "Lucky Rabbit's Foot")		    ,2,34,FALSE,0,0 ,MON_TEWI},
	{ _("弱肉強食の理", "Survival of the Fittest")		    ,4,130,FALSE,0,0 ,MON_SAKI},
	{ _("法力経典", "Sutra of Dharmatic Power")			    ,4,120,FALSE,0,0 ,MON_BYAKUREN},
	{ _("小石ころ帽子", "Pebble Hat")		                ,4,110,TRUE,85,100 ,MON_KOISHI},
	{ _("はじける赤蛙", "Bursting Red Frog")		        ,3,67,FALSE,0,0 ,MON_SUWAKO},
	{ _("疾風の下駄", "Gale Geta")			                ,3,85,TRUE ,70,12 ,MON_AYA},
	{ _("偶像防衛隊", "Idol Defense Corps")			        ,3,72,FALSE,0,0 ,MON_KEIKI},
	{ _("かぐや姫の隠し箱", "Kaguya's Secret Stash")	    ,4,115,FALSE,0,0 ,MON_KAGUYA},
	{ _("頼りになる弟子狸", "Reliable Tanuki Apprentice")	,2,36,TRUE ,55,50 ,MON_MAMIZOU},
	{ _("弾幕の亡霊", "Danmaku Ghost")			            ,3,87,FALSE,0,0 ,MON_YUYUKO},
	{ _("鬼傑組長の脅嚇", "Kiketsu Matriarch's Threat")		,3,93,FALSE,0,0 ,MON_YACHIE},
	{ _("地獄の沙汰も金次第", "Money is the Best Lawyer in Hell")	,2,44,FALSE,0,0 ,MON_EIKI},
	{ _("肉体強化地蔵", "Physical Enhancement Jizo")		,2,35,FALSE,0,0 ,MON_NARUMI},
	{ _("転ばぬ先のスペル", "Spell Before The Fall")	    ,2,43,FALSE,0,0 ,MON_PATCHOULI},
	{ _("商売上手な招き猫", "Cat with Good Business Skills")	,2,41,FALSE,0,0 ,MON_MIKE},
	{ _("山童的買い物術", "Yamawaro Shopping Technique")	,1,15,FALSE,0,0 ,MON_TAKANE},
	{ _("ドラゴンキセル", "Dragon Pipe")		            ,2,40,TRUE,60,100 ,MON_SANNYO},
	{ _("暴食のムカデ", "Gluttonous Centipede")		        ,3,90,FALSE,0,0 ,MON_MOMOYO},
	{ _("画面の境界", "Screen Border")			            ,3,100,TRUE,80,8 ,MON_YUKARI},
	{ _("打ち出の小槌", "Miracle Mallet")		            ,2,50,TRUE,70,25 ,MON_SHINMYOUMARU},
	{ _("忍耐の要石", "Keystone of Endurance")			    ,2,46,TRUE,75,50 ,MON_TENSHI},
	{ _("狂気の月", "Moon of Madness")			            ,4,125,TRUE,85,40 ,MON_CLOWNPIECE},
	{ _("やんごとなき威光", "Esteemed Authority")	        ,3,75,TRUE,75,50 ,MON_MIKO},
	{ _("ヴァンパイアファング", "Vampire Fang")             ,3,82,TRUE,70,15 ,MON_REMY},
	{ _("地底の太陽", "Underground Sun")                    ,4,145,TRUE,100,160 ,MON_UTSUHO},
	{ _("アイテムの季節", "Item Season")	            	,2,32,TRUE,60,100 ,MON_LILY_WHITE},
	{ _("重低音バスドラム", "Heavy Bass Drum")	            ,3,80,FALSE,0,0 ,MON_RAIKO},
	{ _("サイコキネシス", "Psychokinesis")		            ,3,95,FALSE,0,0 ,MON_SUMIREKO},
	{ _("霊力の標本瓶", "Spirit Power Sample Bottle")		,3,60,TRUE,60,50 ,MON_TSUKASA},
	{ _("大天狗の麦飯", "Great Tengu's Barley Rice")		,3,77,TRUE,70,100 ,MON_MEGUMU},
	//空色の勾玉は出さない
	//↓v2.0.1追加
	{ _("資本主義のジレンマ", "Capitalist's Dilemma")		,2,30,FALSE,0,0,MON_NITORI },
	{ _("魔法使いの基礎勉強", "Magician's Basic Study")	,2,47,FALSE,0,0,MON_PATCHOULI },
	{ _("破壊の美学", "Beauty of Destruction")				,3,80,TRUE,75,50,MON_FLAN },
	{ _("龍の通り道", "Dragon's Passage")   				,3,88,FALSE,0,0,MON_FUTO },
	{ _("けしかける狛犬", "Unleash the Guardian Hounds")	,2,33,TRUE,65,15,MON_AUNN },
	{ _("生命爆発の薬 ", "Life Explosion Elixir")			,4,118,TRUE,95,100,MON_EIRIN },
	{ _("生命の豊穣 ", "Bumper Crop of Life")				,3,65,FALSE,0,0,MON_MINORIKO },
	{ _("不屈の脳筋 ", "Indominable Meathead")				,3,63,FALSE,0,0,MON_SAKI },
	{ _("半霊のスペア ", "Spare Half-Ghost")      			,2,26,FALSE,0,0,MON_YOUMU },
	{ _("静かなる輝き", "Quiet Twinkling")        			,1,17,TRUE,50,15,MON_3FAIRIES },
	{ _("狂おしい静寂", "Lunatic Silence")       			,1,17,TRUE,50,15,MON_3FAIRIES },
	{ _("賑やかな無力", "Exuberant Powerlessness")			,1,17,TRUE,50,15,MON_3FAIRIES },
	{ _("刺激的な鱗粉", "Stimulating Scales")     			,1,19,TRUE,40,30,MON_LARVA },
	{ _("山姥の包丁", "Yamanba's Kitchen Knife")			,3,62,TRUE,55,20,MON_NEMUNO },
	{ _("舞い降りた兎", "The Rabbit That Landed")			,3,73,FALSE,0,0,MON_SEIRAN },
	{ _("攻撃的な宝塔", "Offensive Jeweled Pagoda")			,3,90,TRUE,75,60,MON_SHOU },
	{ _("自由気ままな生首", "Freewheeling Severed Head")	,3,68,TRUE,75,100,MON_SEKIBANKI },
	{ _("気ままな無脊椎動物", "Laid-Back Invertebrate")		,2,31,FALSE,0,0,MON_EIKA },
	{ _("濡れた大蛇", "Drenched Giant Snake")				,2,38,TRUE,60,40,MON_URUMI },
	{ _("クリエイターなら容易な事", "No Problem for a Creator!")    ,3,65,TRUE,80,100,MON_KEIKI },
	{ _("詐欺うさぎの足", "Scam Rabbit's Foot")    			,2,30,TRUE,70,45,MON_TEWI },
	{ _("酔狂の伊吹瓢", "Drunkenly Whimsical Ibuki Gourd")          ,3,74,TRUE,60,100,MON_SUIKA },
	{ _("命を焚く松明", "Life-Burning Torch")	    		,4,128,TRUE,60,20,MON_CLOWNPIECE },
	{ _("要石ミサイル", "Keystone Missile")       			,4,112,TRUE,80,60,MON_TENSHI },
	{ _("わかさぎの鱗", "Smelt's Scales")         			,2,33,TRUE,65,50,MON_WAKASAGI },
	{ _("正直すぎる道しるべ", "Too-Honest Signpost")		,2,48,TRUE,50,50,MON_KUTAKA },
	{ _("急がば三途の回り道", "Three Crossings Hasty Detour")		,2,49,TRUE,50,25,MON_KOMACHI },
	{ _("ひらり布", "Nimble Fabric")        				,2,29,TRUE,50,30,MON_SEIJA },
	{ _("抗いがたきジュリ扇", "Irresistible Julie Fan")		,3,83,FALSE,0,0,MON_JYOON },
	{ _("煤けた団扇", "Soot-covered Uchiwa")				,3,84,FALSE,0,0,MON_SHION_2 },
	{ _("数えたくなる羊", "Sheep You Want to Count")		,3,77,TRUE,80,100,MON_DOREMY },
	{ _("純粋な自己肯定感", "Pristine Self-Confidence")		,4,123,TRUE,70,50,MON_JUNKO },
	{ _("ゆのみ霊夢", "Teacup Reimu")        				,4,143,TRUE,80,50,MON_REIMU },//レベル90以上限定
	{ _("ゆのみ魔理沙", "Teacup Marisa")          			,4,147,TRUE,80,50,MON_MARISA },//レベル90以上限定
	{ _("百回目のブラックマーケット", "Hundredth Black Market")	,4,160,FALSE,0,0,0 },


};




//v2.0.6 装備品のTR_***のフラグの記述名称
const cptr equipment_tr_flag_names[TR_FLAG_MAX + 1] =
{
	_("腕力", "Strength"),//0
	_("知能", "Intelligence"),
	_("賢さ", "Wisdom"),
	_("器用", "Dexterity"),
	_("耐久", "Constitution"),
	_("魅力", "Charisma"),

	_("魔道具支配", "Magic Device Use"),
	_("隠密", "Stealth"),
	_("探索", "Searching"),
	_("赤外線視力", "Infravision"),
	_("掘削", "Tunnelling"),

	_("加速", "Speed"),
	_("攻撃回数", "Extra Blows"),
	_("カオス攻撃", "Chaos Brand"),
	_("吸血攻撃", "Vampiric"),
	_("理力攻撃", "Force Brand"),

	_("切れ味", "Sharpness"),
	_("*切れ味*", "*Sharpness*"),
	_("地震", "Earthquakes"),
	_("毒攻撃", "Poison Brand"),
	_("酸攻撃", "Acid Brand"),

	_("電撃攻撃", "Lightning Brand"),
	_("火炎攻撃", "Fire Brand"),
	_("冷気攻撃", "Cold Brand"),
	_("混沌特効", "Slay Chaotic"),
	_("秩序特効", "Slay Lawful"),

	_("動物特効", "Slay Animals"),
	_("人間特効", "Slay Humans"),
	_("死人特効", "Slay Undead"),
	_("竜特効", "Slay Dragons"),
	_("神格特効", "Slay Deities"),

	_("悪魔特効", "Slay Demons"),
	_("妖怪特効", "Slay Youkai"),
	_("*混沌特効*", "*Slay Chaotic*"),
	_("*秩序特効*", "*Slay Lawful*"),
	_("*動物特効*", "*Slay Animals*"),

	_("*人間特効*", "*Slay Humans*"),
	_("*死人特効*", "*Slay Undead*"),
	_("*竜特効*", "*Slay Dragons*"),
	_("*神格特効*", "*Slay Deities*"),
	_("*悪魔特効*", "*Slay Demons*"),

	_("*妖怪特効*", "*Slay Youkai*"),
	_("混沌ESP", "Chaotic ESP"),
	_("秩序ESP", "Lawful ESP"),
	_("動物ESP", "Animal ESP"),
	_("人間ESP", "Human ESP"),

	_("死人ESP", "Undead ESP"),
	_("竜ESP", "Dragon ESP"),
	_("神格ESP", "Deity ESP"),
	_("悪魔ESP", "Demon ESP"),
	_("妖怪ESP", "Youkai ESP"),

	_("無生物ESP", "Nonliving ESP"),
	_("ユニークESP", "Unique ESP"),
	_("腕力維持", "Sustain Strength"),
	_("知能維持", "Sustain Intelligence"),
	_("賢さ維持", "Sustain Wisdom"),

	_("器用維持", "Sustain Dexterity"),
	_("耐久維持", "Sustain Constitution"),
	_("魅力維持", "Sustain Charisma"),
	_("魔法難度低下", "Easy Spellcasting"),
	_("消費魔力減少", "Cheap Spellcasting"),

	_("強力射撃", "Shooting Power"),
	_("射撃回数", "Extra Shots"),
	_("投擲", "Throwing"),
	_("乗馬適格", "Riding"),
	_("反射", "Reflection"),

	_("酸免疫", "Immunity to Acid"),
	_("電撃免疫", "Immunity to Lightning"),
	_("火炎免疫", "Immunity to Fire"),
	_("冷気免疫", "Immunity to Cold"),
	_("酸耐性", "Resist Acid"),

	_("電撃耐性", "Resist Lightning"),
	_("火炎耐性", "Resist Fire"),
	_("冷気耐性", "Resist Cold"),
	_("毒耐性", "Resist Poison"),
	_("閃光耐性", "Resist Light"),

	_("暗黒耐性", "Resist Darkness"),
	_("破片耐性", "Resist Shards"),
	_("轟音耐性", "Resist Sound"),
	_("地獄耐性", "Resist Nether"),
	_("水耐性", "Resist Water"),

	_("混沌耐性", "Resist Chaos"),
	_("劣化耐性", "Resist Disenchantment"),
	_("破邪耐性", "Resist Holy"),
	_("時空耐性", "Resist Time"),
	_("麻痺耐性", "Free Action"),

	_("恐怖耐性", "Resist Fear"),
	_("盲目耐性", "Resist Blindness"),
	_("混乱耐性", "Resist Confusion"),
	_("狂気耐性", "Resist Insanity"),
	_("浮遊", "Levitation"),

	_("透明視認", "See Invisible"),
	_("遅消化", "Slow Digestion"),
	_("急回復", "Regeneration"),
	_("光源", "Light Source"),
	_("警告", "Warning"),

	_("祝福", "Blessed"),
	_("テレポート", "Teleportation"),
	_("二刀流", "Dual Wielding"),
	_("高速移動", "Swift Movement"),
	_("テレパシー", "Telepathy"),

	_("火炎オーラ", "Fire Aura"),
	_("電撃オーラ", "Lightning Aura"),
	_("冷気オーラ", "Cold Aura"),
	_("反テレポート", "Anti-Teleportation"),
	_("反魔法", "Anti-Magic"),

	_("太古の怨念", "Ancient Foul Curse"),
	_("反感", "Aggravation"),
	_("経験値減少", "EXP Drain"),
	_("弱い呪い増加", "Gain Weak Curses"),
	_("(強い呪い増加", "Gain Strong Curses"),

	_("酸破壊防止", "Indestructible (Acid)"),
	_("電撃破壊防止", "Indestructible (Lightning)"),
	_("火炎破壊防止", "Indestructible (Fire)"),
	_("冷気破壊防止", "Indestructible (Cold)"),
	_("発動可能", "Activate"),

	_("素材", "Material"),
	_("使用可能", "Usable"),
	_("ブーメラン", "Boomerang"),
	_("記述", "Description"),
	_("(こころの仮面専用)", "(Kokoro mask)"),

	_("(未使用)", "(unused)"),
	"(SHOW_MODS)",
	"(HIDE_TYPE)",
	"(FULL_NAME)",
	"(FIXED_FLAVOR)",

	_("居住可能", "Inhabitable"),
	_("罠解除", "Disarming"),
	_("魔法防御", "Protection from Magic"),
	_("(終端ダミー)", "(term dummy)"),

};


//v2.0.8 鯢呑亭に持ち込める食物モンスターリスト
//モンスターにはRF8_FOODを設定しておく必要がある
monster_food_type monster_food_list[] =
{

	{ MON_SUPPON,500,_("すっぽんの生き血酒", "Soft-shelled turtle bloodwine") },	//士気高揚

	{ MON_WILD_BOAR,5000,_("山鯨の大鍋", "Wild boar pot") },//耐久増加

	{ MON_WILD_BOAR_2,10000,_("大猪の妖獣のグリル", "Great boar youkai grill") },//腕力大幅増加

	{ MON_BADGER,5000,_("穴熊の丸焼き", "Roast badger") },//器用増加

	{ MON_RIVER_CRAB,2000,_("沢蟹の素揚げ", "Deep-fried river crab") },//水耐性？

	//v2.0.10追加
	{MON_NEWT,3000,_("赤腹イモリのスープ", "Red-bellied newt soup")},//急回復
	{ MON_VORPAL_BUNNY ,5000,_("兎鍋", "Rabbit stew")},//毒耐性
	{ MON_BALL_LIGHTNING,3000,_("雷トカゲのレバ刺し", "Lightning lizard liver sashimi")},//電撃耐性
	{ MON_LAMPREY,5000,_("ヤツメウナギの串揚げ", "Fried lamprey skewers") },//盲目耐性


	//16を超えると料理選択画面のページ送りの実装が必要
	//32以上になると記録するフラグ変数を増やす必要がある

	{ 0,0,"dummy" }//r_idxが0の終端ダミー

};

//慧ノ子が生成できるトラップのリスト
//player_level,trap_idx,f_tag,trap_name
//player_levelの昇順に記述する
enoko_make_trap_type enoko_make_trap_list[ENOKO_TRAP_LIST_MAX] =
{
	{ 1,TRAP_BEAR,"TRAP_BEAR",_("トラバサミ", "beartrap") },//アイテムカードでも配置可能にするため低レベルに
	{ 15,TRAP_PIT,"TRAP_PIT",_("落とし穴", "pit trap") }, //ダメージ+朦朧付与　飛行無効

	{ 18,TRAP_SLOW,"TRAP_SLOW",_("減速ダーツの罠", "slowness dart trap") },
	{ 20,TRAP_LOSE_STR,"TRAP_LOSE_STR",_("腕力低下ダーツの罠", "strength drain dart trap") },
	//{15,TRAP_LOSE_DEX,"","器用低下ダーツの罠"},対モンスターでは腕力も器用も攻撃力低下なので片方外す
	{ 22,TRAP_LOSE_CON,"TRAP_LOSE_CON",_("耐久低下ダーツの罠", "constitution drain dart trap") },

	//{25,TRAP_BLIND,"","盲目ガスの罠"},対モンスターでは混乱ガスと同じなので外す
	{ 24,TRAP_SLEEP,"TRAP_SLEEP",_("睡眠ガスの罠", "sleeping gas trap") },
	{ 26,TRAP_CONFUSE,"TRAP_CONFUSE",_("混乱ガスの罠", "confusion gas trap") },
	{ 28,TRAP_TELEPORT,"TRAP_TELEPORT",_("テレポートの罠", "teleport trap") },

	{ 30,TRAP_POISON,"TRAP_POISON",_("毒ガスの罠", "poison gas trap") },
	{ 32,TRAP_FIRE,"TRAP_FIRE",_("火炎の罠", "fire trap") },
	{ 34,TRAP_ACID,"TRAP_ACID",_("酸の罠", "acid trap") },
	//{30,TRAP_ALARM,"","警報"},対モンスターではあまりメリットがないので外しておく

	{ 36,TRAP_TRAPDOOR,"TRAP_TRAPDOOR",_("落とし戸", "trapdoor") },
	{ 38,TRAP_BEAM,"TRAP_BEAM",_("レーザー・トラップ", "laser trap") },

	{ 40,TRAP_POISON_PIT,"TRAP_POISON_PIT",_("石油地形生成罠", "oil creation trap") },
	{ 42,TRAP_SPIKED_PIT,"TRAP_SPIKED_PIT",_("水地形生成罠", "water creation trap") },
	{ 45,TRAP_TY_CURSE,"TRAP_TY_CURSE",_("太古の呪いの罠", "Ancient Foul Curse trap") },//対モンスターでは高判定の全能力低下+移動禁止
	{ 48,TRAP_ARMAGEDDON,"TRAP_ARMAGEDDON",_("ハルマゲドン・トラップ", "Armageddon trap") },

	//{ 0,0,"","dummy" }//player_levelが0の終端ダミー リスト長さを定数で管理することにしたので削除

};

//v2.1.6
//ニナが特技で作れるダンジョン内建物
//レベル昇順にして最後にレベル0の終端ダミー
const nina_build_type nina_build_table[] =
{

	{1,BLDG_EX_STORE_GENERAL,_("雑貨屋", "General Store")},
	{1,BLDG_EX_STORE_WEAPON,_("武器屋", "Weapon Store")},
	{1,BLDG_EX_STORE_ARMOURY ,_("防具屋", "Armoury")},
	{20,BLDG_EX_STORE_TEMPLE ,_("薬屋", "Potion Store")},
	{20,BLDG_EX_STORE_ALCHEMIST ,_("巻物屋", "Scroll Store")},
	{20,BLDG_EX_STORE_MAGIC ,_("魔法屋", "Magic Store")},
	{20,BLDG_EX_STORE_BOOK ,_("本屋", "Bookstore")},

	{30,BLDG_EX_STORE_BLACK ,_("故買屋", "Pawn Shop")},
	{30,BLDG_EX_EIRIN ,_("治療屋(治療費は階層で変動)", "Healer (cost depends on depth)")},
	{30,BLDG_EX_PATCHOULI ,_("鑑定充填屋", "Identify/recharge services")},
	{30,BLDG_EX_CHOCOLATE ,_("チョコレートの川", "Chocolate River")},

	{40,BLDG_EX_HOME ,_("探索拠点", "Exploration base")},

	{0,0,_("終端ダミー", "terminator dummy")}
};

